AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DATA       : 20;           /*!< Oldest data in the FIFO.                                                  */
      __IOM uint32_t COUNT      : 8;            /*!< Number of valid entries in the ADC FIFO.                                  */
      __IOM uint32_t SLOTNUMPR  : 3;            /*!< Slot number associated with this FIFO data.                               */
      __IOM uint32_t RSVDPR     : 1;            /*!< RESERVED.                                                                 */
    } FIFOPR_b;
  } ;

  union {
    __IOM uint32_t INTTRIGTIMER;                /*!< ADC-Internal Repeating Trigger Timer Configuration                        */

    struct {
      __IOM uint32_t TIMERMAX   : 10;           /*!< Trigger counter count max, used as initial condition to trigger.
                                                     Also used repeatedly each time counter reaches it to restart
                                                     trigger timer at zero. To update this value, first disable
                                                     the INTTRIGTIMER by setting TIMEREN to DIS, change TIMERMAX,
                                                     and then reenable it INTTRIGTIMER by setting TIMEREN to
                                                     EN again.                                                                 */
            uint32_t            : 6;
      __IOM uint32_t CLKDIV     : 3;            /*!< Configure number of divide-by-2 of clock source as input to
                                                     trigger counter. (Max value of 5.) A value of 0 in this
                                                     register would not divide down the ADC input clock. A value
                                                     of 1 would divide the ADC input clock frequency by 2. A
                                                     value of 5 would divide the ADC input clock frequency by
                                                     2^5 = 32. To update this value, first disable the INTTRIGTIMER
                                                     by setting TIMEREN to DIS, change CLKDIV, and then reenable
                                                     it INTTRIGTIMER by setting TIMEREN to EN again.                           */
            uint32_t            : 12;
      __IOM uint32_t TIMEREN    : 1;            /*!< ADC-internal trigger timer enable.                                        */
    } INTTRIGTIMER_b;
  } ;
  __IM  uint32_t  RESERVED[7];

  union {
    __IOM uint32_t ZXCFG;                       /*!< Zero Crossing Comparator Configuration                                    */

    struct {
      __IOM uint32_t ZXEN       : 1;            /*!< Enable the ZX comparator                                                  */
            uint32_t            : 3;
      __IOM uint32_t ZXCHANSEL  : 1;            /*!< Select which slots to use for zero crossing measurement. 0 enables
                                                     zero crossing detection on slots 0 and 2. 1 enables zero
                                                     crossing detection on slots 1 and 3.                                      */
            uint32_t            : 27;
    } ZXCFG_b;
  } ;

  union {
    __IOM uint32_t ZXLIM;                       /*!< Zero Crossing Comparator Limits                                           */

    struct {
      __IOM uint32_t LZXC       : 12;           /*!< Sets the lower integer sample limit for the ZX comparator. Note
                                                     that these values are raw ADC values whose bounds are specified
                                                     by PRMODE but not maniupulated by accumulate/divide logic.
                                                     Therefore, there is no oversampling and no binary point
                                                     in this value. Samples must enter the range between UZXC
                                                     and LZXC in order for a zero crossing to be recognized.                   */
            uint32_t            : 4;
      __IOM uint32_t UZXC       : 12;           /*!< Sets the upper integer sample limit for the ZX comparator. Note
                                                     that these values are raw ADC values whose bounds are specified
                                                     by PRMODE but not maniupulated by accumulate/divide logic.
                                                     Therefore, there is no oversampling and no binary point
                                                     in this value. Samples must enter the range between UZXC
                                                     and LZXC in order for a zero crossing to be recognized.                   */
            uint32_t            : 4;
    } ZXLIM_b;
  } ;

  union {
    __IOM uint32_t GAINCFG;                     /*!< PGA Gain Configuration                                                    */

    struct {
      __IOM uint32_t PGACTRLEN  : 1;            /*!< Enable PGA gain updates.                                                  */
            uint32_t            : 3;
      __IOM uint32_t UPDATEMODE : 1;            /*!< PGA update mode                                                           */
            uint32_t            : 27;
    } GAINCFG_b;
  } ;

  union {
    __IOM uint32_t GAIN;                        /*!< PGA Gain Codes                                                            */

    struct {
      __IOM uint32_t LGA        : 7;            /*!< Specifies the low gain code (0 to 102 decimal specifies -6.0
                                                     dB to 45.0 dB in half-dB increments) for channel A (slot
                                                     0).                                                                       */
            uint32_t            : 1;
      __IOM uint32_t HGADELTA   : 7;            /*!< Specifies the high gain code as an delta from the LGA field
                                                     for channel A (slot 1).                                                   */
            uint32_t            : 1;
      __IOM uint32_t LGB        : 7;            /*!< Specifies the low gain code (0 to 102 decimal specifies -6.0
                                                     dB to 45.0 dB in half-dB increments) for channel B (slot
                                                     2).                                                                       */
            uint32_t            : 1;
      __IOM uint32_t HGBDELTA   : 7;            /*!< Specifies the high gain code as an delta from the LGB field
                                                     for channel B (slot 3).                                                   */
            uint32_t            : 1;
    } GAIN_b;
  } ;
  __IM  uint32_t  RESERVED1[13];

  union {
    __IOM uint32_t SATCFG;                      /*!< Saturation Comparator Configuration                                       */

