AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t SATEN      : 1;            /*!< Enable the saturation comparator                                          */
            uint32_t            : 3;
      __IOM uint32_t SATCHANSEL : 1;            /*!< Select which slots to use for saturation measurement. 0 enables
                                                     saturation on slots 0 and 2. 1 enables saturation on slots
                                                     1 and 3.                                                                  */
            uint32_t            : 27;
    } SATCFG_b;
  } ;

  union {
    __IOM uint32_t SATLIM;                      /*!< Saturation Comparator Limits                                              */

    struct {
      __IOM uint32_t LSATC      : 12;           /*!< Sets the lower integer sample limit for the saturation comparator.
                                                     Note that these values are raw ADC values whose bounds
                                                     are specified by PRMODE but not manipulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value.                                                      */
            uint32_t            : 4;
      __IOM uint32_t USATC      : 12;           /*!< Sets the upper integer sample limit for the saturation comparator.
                                                     Note that these values are raw ADC values whose bounds
                                                     are specified by PRMODE but not manipulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value.                                                      */
            uint32_t            : 4;
    } SATLIM_b;
  } ;

  union {
    __IOM uint32_t SATMAX;                      /*!< Saturation Comparator Event Counter Limits                                */

    struct {
      __IOM uint32_t SATCAMAX   : 12;           /*!< Sets the number of saturation events that may occur before a
                                                     SATCA interrupt occurs. Once this interrupt occurs, the
                                                     saturation event counter must be cleared by writing the
                                                     SATCLR register. A value of 0 is invalid and will cause
                                                     the saturation interrupt to assert immediately.                           */
            uint32_t            : 4;
      __IOM uint32_t SATCBMAX   : 12;           /*!< Sets the number of saturation events that may occur before a
                                                     SATCB interrupt occurs. Once this interrupt occurs, the
                                                     saturation event counter must be cleared by writing the
                                                     SATCLR register. A value of 0 is invalid and will cause
                                                     the saturation interrupt to assert immediately.                           */
            uint32_t            : 4;
    } SATMAX_b;
  } ;

  union {
    __IOM uint32_t SATCLR;                      /*!< Clears the saturation event counter registers                             */

    struct {
      __IOM uint32_t SATCACLR   : 1;            /*!< Clear saturation event counter register for channel A (slots
                                                     0 or 1, depending on SATCHANSEL)                                          */
      __IOM uint32_t SATCBCLR   : 1;            /*!< Clear saturation event counter register for channel B (slots
                                                     2 or 3, depending on SATCHANSEL)                                          */
            uint32_t            : 30;
    } SATCLR_b;
  } ;
  __IM  uint32_t  RESERVED2[25];

  union {
    __IOM uint32_t CALCTRL;                     /*!< Calibration Control                                                       */

    struct {
      __IOM uint32_t RESETDLY   : 10;           /*!< Sets the delay between the deassertion of ADC reset and the
                                                     start of calibration in ADC CLKs. Minimum per spec is 8
                                                     CLKs. Specifying a value smaller than 8 is not supported.                 */
      __IOM uint32_t ISODLY     : 10;           /*!< Sets the delay between the deassertion of ADC isolation and
                                                     the deassertion of ADC reset in ADC CLKs. This allows for
                                                     synchronous reset of logic within the ADC.                                */
            uint32_t            : 12;
    } CALCTRL_b;
  } ;
  __IM  uint32_t  RESERVED3[57];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t CNVCMP     : 1;            /*!< ADC conversion complete interrupt.                                        */
      __IOM uint32_t SCNCMP     : 1;            /*!< ADC scan complete interrupt.                                              */
      __IOM uint32_t FIFOOVR1   : 1;            /*!< FIFO 75 percent full interrupt.                                           */
      __IOM uint32_t FIFOOVR2   : 1;            /*!< FIFO 100 percent full interrupt.                                          */
      __IOM uint32_t WCEXC      : 1;            /*!< Window comparator voltage excursion interrupt.                            */
      __IOM uint32_t WCINC      : 1;            /*!< Window comparator voltage incursion interrupt.                            */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Condition                                                       */
      __IOM uint32_t ZXCA       : 1;            /*!< Zero Crossing - Channel A (Slots 0 or 1)                                  */
      __IOM uint32_t ZXCB       : 1;            /*!< Zero Crossing - Channel B (Slots 2 or 3)                                  */
      __IOM uint32_t SATCA      : 1;            /*!< Saturation - Channel A (Slots 0 or 1)                                     */
      __IOM uint32_t SATCB      : 1;            /*!< Saturation - Channel B (Slots 2 or 3)                                     */
            uint32_t            : 20;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

