AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t D75STAT    : 1;            /*!< Triggered DMA from FIFO 75 percent Full                                   */
      __IOM uint32_t DFULLSTAT  : 1;            /*!< Triggered DMA from FIFO 100 percent Full                                  */
            uint32_t            : 30;
    } DMATRIGSTAT_b;
  } ;
  __IM  uint32_t  RESERVED5[14];

  union {
    __IOM uint32_t DMACFG;                      /*!< DMA Configuration                                                         */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable                                                                */
            uint32_t            : 1;
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 5;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DMADYNPRI  : 1;            /*!< Enables dynamic priority based on FIFO fullness. When FIFO is
                                                     full, priority is automatically set to HIGH. Otherwise,
                                                     DMAPRI is used.                                                           */
            uint32_t            : 7;
      __IOM uint32_t DMAMSK     : 1;            /*!< Mask the FIFOCNT and SLOTNUM when transferring FIFO contents
                                                     to memory                                                                 */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power Off the ADC System upon DMACPL.                                     */
            uint32_t            : 13;
    } DMACFG_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< DMA Total Transfer Count                                                  */

    struct {
            uint32_t            : 2;
      __IOM uint32_t TOTCOUNT   : 16;           /*!< Total Transfer Count                                                      */
            uint32_t            : 14;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< DMA Target Address                                                        */

    struct {
      __IOM uint32_t LTARGADDR  : 28;           /*!< DMA Target Address                                                        */
      __IOM uint32_t UTARGADDR  : 4;            /*!< SRAM Target                                                               */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< DMA Status                                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress                                                  */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error                                                                 */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;
} ADC_Type;                                     /*!< Size = 660 (0x294)                                                        */



/* =========================================================================================================================== */
/* ================                                          APBDMA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief APB DMA Register Interfaces (APBDMA)
  */

typedef struct {                                /*!< APBDMA Structure                                                          */

  union {
    __IOM uint32_t BBVALUE;                     /*!< Control                                                                   */

    struct {
      __IOM uint32_t DATAOUT    : 8;            /*!< Data Output Values                                                        */
            uint32_t            : 8;
      __IOM uint32_t PIN        : 8;            /*!< PIO values                                                                */
            uint32_t            : 8;
    } BBVALUE_b;
  } ;

  union {
    __IOM uint32_t BBSETCLEAR;                  /*!< Set/Clear                                                                 */

    struct {
      __IOM uint32_t SET        : 8;            /*!< Write 1 to Set PIO value (set hier priority than clear if both
                                                     bit set)                                                                  */
            uint32_t            : 8;
      __IOM uint32_t CLEAR      : 8;            /*!< Write 1 to Clear PIO value                                                */
            uint32_t            : 8;
    } BBSETCLEAR_b;
  } ;

  union {
    __IOM uint32_t BBINPUT;                     /*!< PIO Input Values                                                          */

    struct {
      __IOM uint32_t DATAIN     : 8;            /*!< PIO values                                                                */
            uint32_t            : 24;
    } BBINPUT_b;
  } ;
  __IM  uint32_t  RESERVED[5];

  union {
    __IOM uint32_t DEBUGDATA;                   /*!< PIO Input Values                                                          */

    struct {
      __IOM uint32_t DEBUGDATA  : 32;           /*!< Debug Data                                                                */
    } DEBUGDATA_b;
  } ;
  __IM  uint32_t  RESERVED1[7];

  union {
    __IOM uint32_t DEBUG;                       /*!< PIO Input Values                                                          */

    struct {
      __IOM uint32_t DEBUGEN    : 4;            /*!< Debug Enable                                                              */
            uint32_t            : 28;
    } DEBUG_b;
  } ;
} APBDMA_Type;                                  /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                          AUDADC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Audio Analog Digital Converter Control (AUDADC)
  */

typedef struct {                                /*!< AUDADC Structure                                                          */

  union {
    __IOM uint32_t CFG;                         /*!< The Audio ADC Configuration Register contains the software control
                                                     for selecting the clock frequency used for the SAR conversions,
                                                     the trigger polarity, the trigger select, the reference
                                                     voltage select, the low power mode, the operating mode
                                                     (single scan per trigger vs. repeating mode) and AUDADC
                                                     enable.                                                                   */

