AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t TOTCOUNT   : 16;           /*!< Total Transfer Count                                                      */
            uint32_t            : 14;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< DMA Target Address                                                        */

    struct {
      __IOM uint32_t LTARGADDR  : 28;           /*!< DMA Target Address                                                        */
      __IOM uint32_t UTARGADDR  : 4;            /*!< SRAM Target                                                               */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< DMA Status                                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress                                                  */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error                                                                 */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;
} AUDADC_Type;                                  /*!< Size = 660 (0x294)                                                        */



/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock Generator (CLKGEN)
  */

typedef struct {                                /*!< CLKGEN Structure                                                          */
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t OCTRL;                       /*!< This register includes controls for autocalibration in addition
                                                     to the RTC oscillator controls.                                           */

    struct {
            uint32_t            : 7;
      __IOM uint32_t OSEL       : 1;            /*!< Selects the RTC oscillator (1=LFRC, 0=XT)                                 */
            uint32_t            : 24;
    } OCTRL_b;
  } ;

  union {
    __IOM uint32_t CLKOUT;                      /*!< This register enables the CLKOUT to the GPIOs, and selects the
                                                     clock source to that.                                                     */

    struct {
      __IOM uint32_t CKSEL      : 6;            /*!< CLKOUT signal select                                                      */
            uint32_t            : 1;
      __IOM uint32_t CKEN       : 1;            /*!< Enable the CLKOUT signal                                                  */
            uint32_t            : 24;
    } CLKOUT_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t HFADJ;                       /*!< This register controls the HFRC adjustment. The HFRC clock can
                                                     change with temperature and process corners, and this register
                                                     controls the HFRC adjustment logic which reduces the fluctuations
                                                     to the clock.                                                             */

    struct {
      __IOM uint32_t HFADJEN    : 1;            /*!< HFRC adjustment control                                                   */
      __IOM uint32_t HFADJCK    : 3;            /*!< Repeat period for HFRC adjustment                                         */
            uint32_t            : 4;
      __IOM uint32_t HFXTADJ    : 12;           /*!< Target HFRC adjustment value.                                             */
      __IOM uint32_t HFWARMUP   : 1;            /*!< XT warmup period for HFRC adjustment                                      */
      __IOM uint32_t HFADJGAIN  : 3;            /*!< Gain control for HFRC adjustment                                          */
      __IOM uint32_t HFADJMAXDELTA : 5;         /*!< Maximum delta for HF Adjustments. 0=Disabled, 1-31=maximum delta
                                                     step                                                                      */
            uint32_t            : 3;
    } HFADJ_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t CLOCKENSTAT;                 /*!< This register provides the enable status to all the peripheral
                                                     clocks.                                                                   */

    struct {
      __IOM uint32_t CLOCKENSTAT : 32;          /*!< Clock enable status                                                       */
    } CLOCKENSTAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN2STAT;                /*!< This is a continuation of the clock enable status.                        */

    struct {
      __IOM uint32_t CLOCKEN2STAT : 32;         /*!< Clock enable status 2                                                     */
    } CLOCKEN2STAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN3STAT;                /*!< This is a continuation of the clock enable status.                        */

    struct {
      __IOM uint32_t CLOCKEN3STAT : 32;         /*!< Clock enable status 3                                                     */
    } CLOCKEN3STAT_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t MISC;                        /*!< This register controls a 'safe' mode for burst, which disables
                                                     the clock when burst transition is happening. It also includes
                                                     a register to force the HFRC during deep sleep. It is mainly
                                                     used for debug and testing.                                               */

