AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t FRCHFRC    : 1;            /*!< Force HFRC On .                                                           */
      __IOM uint32_t FRCBURSTOFF : 1;           /*!< Force fclk, hclk, fclk_wic and fclk_pmu to be turned off during
                                                     burst transition.                                                         */
      __IOM uint32_t USEHFRC2FQ48MHZ : 1;       /*!< Use HFRC-48MHz or HFRC2-48MHz for DSP                                     */
      __IOM uint32_t USEHFRC2FQ96MHZ : 1;       /*!< Use HFRC-96MHz or HFRC2-96MHz for DSP                                     */
      __IOM uint32_t USEHFRC2FQ192MHZ : 1;      /*!< Use HFRC-192MHz or HFRC2-192MHz for MCU                                   */
      __IOM uint32_t FRCHFRC2   : 1;            /*!< Force HFRC2 On.Setting this bit forces HFRC2 to remain on, including
                                                     in deep sleep. When changing a module's clock source to
                                                     HFRC2, this bit must be set and remain set when any module
                                                     is using HFRC2 as its clock.                                              */
      __IOM uint32_t PWRONCLKENDISP : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENDISPPHY : 1;     /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENGFX : 1;         /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENUSB : 1;         /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENSDIO : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENCRYPTO : 1;      /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S0 : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S1 : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t AXIXACLKENOVRRIDE : 1;     /*!< Chicken bit to disable Rev B added clock gating                           */
      __IOM uint32_t PWRONCLKENI2S0REFCLK : 1;  /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S1REFCLK : 1;  /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENUSBREFCLK : 1;   /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t CM4DAXICLKGATEEN : 1;      /*!< Chicken bit to enable clock gating on CM4 DAXI CLK                        */
      __IOM uint32_t GFXCLKCLKGATEEN : 1;       /*!< Chicken bit to enable clock gating on GFX CLK                             */
      __IOM uint32_t GFXAXICLKCLKGATEEN : 1;    /*!< Chicken bit to enable clock gating on GFX AXI CLK                         */
      __IOM uint32_t APBDMACPUCLKCLKGATEEN : 1; /*!< Chicken bit to enable clock gating on APB DMA CPU CLK                     */
      __IOM uint32_t ETMTRACECLKCLKGATEEN : 1;  /*!< Chicken bit to enable clock gating on ETM TRACE CLK                       */
      __IOM uint32_t HFRCFUNCCLKGATEEN : 1;     /*!< Chicken bit to enable clock gating on HFRC_FUNC_CLK                       */
      __IOM uint32_t HFRC96TRUNKGATE : 1;       /*!< DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0,
                                                     will kill HFRC root clock.                                                */
      __IOM uint32_t CLKGENMISCSPARE : 1;       /*!< Spare/Unused Chicken Bit                                                  */
            uint32_t            : 6;
    } MISC_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ0;                     /*!< This register controls hf2adj enable, fast_start enable, fast_start_delay
                                                     setting and counter input offset.                                         */

    struct {
      __IOM uint32_t HF2ADJEN   : 1;            /*!< HF2ADJ control                                                            */
      __IOM uint32_t HF2ADJFASTSTREN : 1;       /*!< Fast_start_delay control                                                  */
      __IOM uint32_t HF2ADJFASTSTRDLY : 13;     /*!< Fast_start_delay value setting                                            */
      __IOM uint32_t HF2ADJCNTINOFFSET : 14;    /*!< Counter input offset                                                      */
      __IOM uint32_t HF2ADJXTHSMUXSEL : 1;      /*!< 0=XTHS 1=EXTREF select                                                    */
            uint32_t            : 2;
    } HF2ADJ0_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ1;                     /*!< This register controls hf2adj trimming enable and trimming offset.        */

    struct {
      __IOM uint32_t HF2ADJTRIMEN : 3;          /*!< HF2ADJ output selection                                                   */
      __IOM uint32_t HF2ADJTRIMOFFSET : 11;     /*!< HF2ADJ trimming offset. (signed number)                                   */
            uint32_t            : 18;
    } HF2ADJ1_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ2;                     /*!< This register controls xtal32m divider ratio and HF2ADJ ration
                                                     setting.                                                                  */

    struct {
      __IOM uint32_t HF2ADJXTALDIVRATIO : 2;    /*!< XTAL32MHz divider ratio for HF2ADJ.                                       */
      __IOM uint32_t HF2ADJRATIO : 29;          /*!< HF2ADJ ratio setting.                                                     */
            uint32_t            : 1;
    } HF2ADJ2_b;
  } ;

  union {
    __IOM uint32_t HF2VAL;                      /*!< This register provides the read back of the HF2TUNE                       */

