AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP16 : 10;        /*!< Contains the physical address in memory to map the R16 register.          */
            uint32_t            : 21;
    } MEMORYMAP16_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP17;                 /*!< This register maps the virtual register R17 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP17 : 10;        /*!< Contains the physical address in memory to map the R17 registero.         */
            uint32_t            : 21;
    } MEMORYMAP17_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP18;                 /*!< This register maps the virtual register R18 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP18 : 10;        /*!< Contains the physical address in memory to map the R18 register.          */
            uint32_t            : 21;
    } MEMORYMAP18_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP19;                 /*!< This register maps the virtual register R19 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP19 : 10;        /*!< Contains the physical address in memory to map the R19 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP19_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP20;                 /*!< This register maps the virtual register R20 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP20 : 10;        /*!< Contains the physical address in memory to map the R20 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP20_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP21;                 /*!< This register maps the virtual register R21 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP21 : 10;        /*!< Contains the physical address in memory to map the R21 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP21_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP22;                 /*!< This register maps the virtual register R22 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP22 : 10;        /*!< Contains the physical address in memory to map the R22 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP22_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP23;                 /*!< This register maps the virtual register R23 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP23 : 10;        /*!< Contains the physical address in memory to map the R23 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP23_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP24;                 /*!< This register maps the virtual register R24 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP24 : 10;        /*!< Contains the physical address in memory to map the R24 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP24_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP25;                 /*!< This register maps the virtual register R25 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP25 : 10;        /*!< Contains the physical address in memory to map the R25 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP25_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP26;                 /*!< This register maps the virtual register R26 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP26 : 10;        /*!< Contains the physical address in memory to map the R26 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP26_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP27;                 /*!< This register maps the virtual register R27 to a physical address
                                                     in memory.                                                                */

