AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t PKASRAMWRCLR : 32;         /*!< Clear the write buffer.                                                   */
    } PKASRAMWRCLR_b;
  } ;

  union {
    __IOM uint32_t PKASRAMRADDR;                /*!< first address given to PKA SRAM for read transactions.                    */

    struct {
      __IOM uint32_t PKASRAMRADDR : 32;         /*!< PKA SRAM read starting address                                            */
    } PKASRAMRADDR_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t PKAWORDACCESS;               /*!< This register holds the data written to PKA memory using the
                                                     wop opcode.                                                               */

    struct {
      __IOM uint32_t PKAWORDACCESS : 32;        /*!< 32 bit read_write data.                                                   */
    } PKAWORDACCESS_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t PKABUFFADDR;                 /*!< This register maps the virtual buffer registers to a physical
                                                     address in memory.                                                        */

    struct {
      __IOM uint32_t PKABUFADDR : 12;           /*!< Contains the physical address in memory to map the buffer registers.      */
            uint32_t            : 20;
    } PKABUFFADDR_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t RNGIMR;                      /*!< Interrupt masking register. Consists of {prng_imr trng_imr}
                                                     bit[31-16] - PRNG_IMR bit[15-0] - TRNG_IMR(Ws - PRNG bit
                                                     exists only if PRNG_EXISTS flag)                                          */

    struct {
      __IOM uint32_t EHRVALIDINTMASK : 1;       /*!< 0x1 - masks the EHR interrupt. No interrupt is generated.                 */
      __IOM uint32_t AUTOCORRERRINTMASK : 1;    /*!< 0x1 - masks the autocorrelation interrupt. No interrupt is generated.     */
      __IOM uint32_t CRNGTERRINTMASK : 1;       /*!< 0x1 - masks the CRNGT error interrupt. No interrupt is generated.         */
      __IOM uint32_t VNERRINTMASK : 1;          /*!< 0x1 - masks the Von-Neumann error interrupt. No interrupt is
                                                     generated.                                                                */
      __IOM uint32_t WATCHDOGINTMASK : 1;       /*!< 0x1 - masks the watchdog interrupt. No interrupt is generated.            */
      __IOM uint32_t RNGDMADONEINT : 1;         /*!< 0x1 - masks the RNG DMA completion interrupt. No interrupt is
                                                     generated.                                                                */
            uint32_t            : 26;
    } RNGIMR_b;
  } ;

  union {
    __IOM uint32_t RNGISR;                      /*!< Status register. If corresponding RNG_IMR bit is unmasked, an
                                                     interrupt is generated.Consists of trng_isr and prng_isr
                                                     bit[15-0] - TRNG bit[31-16] - PRNG                                        */

    struct {
      __IOM uint32_t EHRVALID   : 1;            /*!< 0x1 indicates that 192 bits have been collected in the TRNG
                                                     and are ready to be read.                                                 */
      __IOM uint32_t AUTOCORRERR : 1;           /*!< 0x1 indicates Autocorrelation test failed four times in a row.
                                                     When it set ,TRNG ceases to function until next reset.                    */
      __IOM uint32_t CRNGTERR   : 1;            /*!< 0x1 indicates CRNGT in the TRNG test failed. Failure occurs
                                                     when two consecutive blocks of 16 collected bits are equal.               */
      __IOM uint32_t VNERR      : 1;            /*!< 0x1 indicates Von Neumann error. Error in von Neumann occurs
                                                     if 32 consecutive collected bits are identical, ZERO, or
                                                     ONE.                                                                      */
            uint32_t            : 1;
      __IOM uint32_t RNGDMADONE : 1;            /*!< 0x1 indicates RNG DMA to SRAM is completed.                               */
            uint32_t            : 10;
      __IOM uint32_t RESEEDINGDONE : 1;         /*!< 0x1 indicates completion of reseeding algorithm with no errors.           */
      __IOM uint32_t INSTANTIATIONDONE : 1;     /*!< 0x1 indicates completion of instantiation algorithm with no
                                                     errors.                                                                   */
      __IOM uint32_t FINALUPDATEDONE : 1;       /*!< 0x1 indicates completion of final update algorithm.                       */
      __IOM uint32_t OUTPUTREADY : 1;           /*!< 0x1 indicates that the result of PRNG is valid and ready to
                                                     be read. The result can be read from the RNG_READOUT register.            */
      __IOM uint32_t RESEEDCNTRFULL : 1;        /*!< 0x1 indicates that the reseed counter has reached 2^48, requiring
                                                     to run the reseed algorithm before generating new random
                                                     numbers.                                                                  */
      __IOM uint32_t RESEEDCNTRTOP40 : 1;       /*!< 0x1 indicates that the top 40 bits of the reseed counter are
                                                     set (that is the reseed counter is larger than 2^48-2^8).
                                                     This is a recommendation for running the reseed algorithm
                                                     before the counter reaches its max value.                                 */
      __IOM uint32_t PRNGCRNGTERR : 1;          /*!< 0x1 indicates CRNGT in the PRNG test failed. Failure occurs
                                                     when two consecutive results of AES are equal                             */
      __IOM uint32_t REQSIZE    : 1;            /*!< 0x1 indicates that the request size counter (which represents
                                                     how many generations of random bits in the PRNG have been
                                                     produced) has reached 2^12, thus requiring a working state
                                                     update before generating new random numbers.                              */
      __IOM uint32_t KATERR     : 1;            /*!< 0x1 indicates that one of the KAT (Known Answer Tests) tests
                                                     has failed. When set, the entire engine ceases to function.               */
      __IOM uint32_t WHICHKATERR : 2;           /*!< When the KAT_ERR bit is set, these bits represent which Known
                                                     Answer Test had failed:                                                   */
            uint32_t            : 5;
    } RNGISR_b;
  } ;

  union {
    __IOM uint32_t RNGICR;                      /*!< Interrupt_status bit clear Register. Consists of trng_icr and
                                                     prng_icr bit[15-0] - TRNG bit[31-16] - PRNG                               */

