AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[159_128]. Note: can
                                                     only be set while in debug mode (rng_debug_enable input
                                                     is set).                                                                  */
    } EHRDATA4_b;
  } ;

  union {
    __IOM uint32_t EHRDATA5;                    /*!< This register contains the data collected in the TRNG[191_160].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[191_160]. Note: can
                                                     only be set while in debug mode (rng_debug_enable input
                                                     is set).                                                                  */
    } EHRDATA5_b;
  } ;

  union {
    __IOM uint32_t RNDSOURCEENABLE;             /*!< This register holds the enable signal for the random source.              */

    struct {
      __IOM uint32_t RNDSRCEN   : 1;            /*!< Enable signal for the random source.                                      */
            uint32_t            : 31;
    } RNDSOURCEENABLE_b;
  } ;

  union {
    __IOM uint32_t SAMPLECNT1;                  /*!< Counts clocks between sampling of random bit.                             */

    struct {
      __IOM uint32_t SAMPLECNTR1 : 32;          /*!< Sets the number of rng_clk cycles between two consecutive ring
                                                     oscillator samples. Note: If the Von-Neumann is bypassed,
                                                     the minimum value for sample counter must not be less than
                                                     decimal seventeen.                                                        */
    } SAMPLECNT1_b;
  } ;

  union {
    __IOM uint32_t AUTOCORRSTATISTIC;           /*!< Statistics about autocorrelation test activations.                        */

    struct {
      __IOM uint32_t AUTOCORRTRYS : 14;         /*!< Count each time an autocorrelation test starts. Any write to
                                                     the register resets the counter. Stops collecting statistics
                                                     if one of the counters has reached the limit.                             */
      __IOM uint32_t AUTOCORRFAILS : 8;         /*!< Count each time an autocorrelation test fails. Any write to
                                                     the register resets the counter. Stops collecting statistics
                                                     if one of the counters has reached the limit.                             */
            uint32_t            : 10;
    } AUTOCORRSTATISTIC_b;
  } ;

  union {
    __IOM uint32_t TRNGDEBUGCONTROL;            /*!< This register is used to debug the TRNG                                   */

    struct {
            uint32_t            : 1;
      __IOM uint32_t VNCBYPASS  : 1;            /*!< When this bit is set, the Von-Neumann balancer is bypassed (including
                                                     the 32 consecutive bits test). Note: Can only be set while
                                                     in debug mode. If TRNG_TESTS_BYPASS_EN HW flag is defined,
                                                     this bit can be set while not in debug mode.                              */
      __IOM uint32_t TRNGCRNGTBYPASS : 1;       /*!< When this bit is set, the CRNGT test in the TRNG is bypassed.
                                                     Note: Can only be set while in debug mode. If TRNG_TESTS_BYPASS_EN
                                                     HW flag is defined, this bit can be set while not in debug
                                                     mode.                                                                     */
      __IOM uint32_t AUTOCORRELATEBYPASS : 1;   /*!< When this bit is set, the autocorrelation test in the TRNG module
                                                     is bypassed. Note: Can only be set while in debug mode.
                                                     If TRNG_TESTS_BYPASS_EN HW flag is defined, this bit can
                                                     be set while not in debug mode.                                           */
            uint32_t            : 28;
    } TRNGDEBUGCONTROL_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t RNGSWRESET;                  /*!< Generate SW reset solely to RNG block.                                    */

    struct {
      __IOM uint32_t RNGSWRESET : 1;            /*!< Any value written (0x0 or 0x1) causes a reset cycle to the TRNG
                                                     block.                                                                    */
            uint32_t            : 31;
    } RNGSWRESET_b;
  } ;
  __IM  uint32_t  RESERVED6[28];

  union {
    __IOM uint32_t RNGDEBUGENINPUT;             /*!< Defines the RNG in debug mode                                             */

    struct {
      __IOM uint32_t RNGDEBUGEN : 1;            /*!< Reflects the rng_debug_enable input port                                  */
            uint32_t            : 31;
    } RNGDEBUGENINPUT_b;
  } ;

  union {
    __IOM uint32_t RNGBUSY;                     /*!< RNG busy indication                                                       */

    struct {
      __IOM uint32_t RNGBUSY    : 1;            /*!< Reflects rng_busy output port which Consists of trng_busy and
                                                     prng_busy.                                                                */
      __IOM uint32_t TRNGBUSY   : 1;            /*!< Reflects trng_busy.                                                       */
      __IOM uint32_t PRNGBUSY   : 1;            /*!< Reflects prng_busy.                                                       */
            uint32_t            : 29;
    } RNGBUSY_b;
  } ;

  union {
    __IOM uint32_t RSTBITSCOUNTER;              /*!< Resets the counter of collected bits in the TRNG                          */

