AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t SRAMTODINCLEAR : 1;        /*!< The SRAM to DIN DMA done interrupt clear.                                 */
      __IOM uint32_t DOUTTOSRAMCLEAR : 1;       /*!< The DOUT to SRAM DMA done interrupt clear.                                */
      __IOM uint32_t MEMTODINCLEAR : 1;         /*!< The memory to DIN DMA done interrupt clear.                               */
      __IOM uint32_t DOUTTOMEMCLEAR : 1;        /*!< The DOUT to memory DMA done interrupt clear.                              */
      __IOM uint32_t AXIERRCLEAR : 1;           /*!< The AXI error interrupt clear.                                            */
      __IOM uint32_t PKAEXPCLEAR : 1;           /*!< The PKA end of operation interrupt clear.                                 */
      __IOM uint32_t RNGINTCLEAR : 1;           /*!< The RNG interrupt clear.                                                  */
      __IOM uint32_t SYMDMACOMPLETEDCLEAR : 1;  /*!< The GPR interrupt clear.                                                  */
            uint32_t            : 20;
    } HOSTRGFICR_b;
  } ;

  union {
    __IOM uint32_t HOSTRGFENDIAN;               /*!< This register defines the endianness of the Host-accessible
                                                     registers. Note: This is a special register, affected by
                                                     internal logic. Test result of this register is NA.                       */

    struct {
            uint32_t            : 3;
      __IOM uint32_t DOUTWRBG   : 1;            /*!< DOUT write endianness:                                                    */
            uint32_t            : 3;
      __IOM uint32_t DINRDBG    : 1;            /*!< DIN write endianness:                                                     */
            uint32_t            : 3;
      __IOM uint32_t DOUTWRWBG  : 1;            /*!< DOUT write word endianness:                                               */
            uint32_t            : 3;
      __IOM uint32_t DINRDWBG   : 1;            /*!< DIN write word endianness:                                                */
            uint32_t            : 16;
    } HOSTRGFENDIAN_b;
  } ;
  __IM  uint32_t  RESERVED35[5];

  union {
    __IOM uint32_t HOSTRGFSIGNATURE;            /*!< This register holds the CryptoCell product signature.                     */

    struct {
      __IOM uint32_t HOSTSIGNATURE : 32;        /*!< Identification 'signature': always returns a fixed value, used
                                                     by Host driver to verify CryptoCell presence at this address.             */
    } HOSTRGFSIGNATURE_b;
  } ;

  union {
    __IOM uint32_t HOSTBOOT;                    /*!< This register holds the values of CryptoCells pre-synthesis
                                                     flags                                                                     */

    struct {
      __IOM uint32_t SYNTHESISCONFIG : 1;       /*!< POWER_GATING_EXISTS_LOCAL                                                 */
      __IOM uint32_t LARGERKEKLOCAL : 1;        /*!< LARGE_RKEK_LOCAL                                                          */
      __IOM uint32_t HASHINFUSESLOCAL : 1;      /*!< HASH_IN_FUSES_LOCAL                                                       */
      __IOM uint32_t EXTMEMSECUREDLOCAL : 1;    /*!< EXT_MEM_SECURED_LOCAL                                                     */
            uint32_t            : 1;
      __IOM uint32_t RKEKECCEXISTSLOCALN : 1;   /*!< RKEK_ECC_EXISTS_LOCAL_N                                                   */
      __IOM uint32_t SRAMSIZELOCAL : 3;         /*!< SRAM_SIZE_LOCAL                                                           */
      __IOM uint32_t DSCRPTREXISTSLOCAL : 1;    /*!< DSCRPTR_EXISTS_LOCAL                                                      */
      __IOM uint32_t PAUEXISTSLOCAL : 1;        /*!< PAU_EXISTS_LOCAL                                                          */
      __IOM uint32_t RNGEXISTSLOCAL : 1;        /*!< RNG_EXISTS_LOCAL                                                          */
      __IOM uint32_t PKAEXISTSLOCAL : 1;        /*!< PKA_EXISTS_LOCAL                                                          */
      __IOM uint32_t RC4EXISTSLOCAL : 1;        /*!< RC4_EXISTS_LOCAL                                                          */
      __IOM uint32_t SHA512PRSNTLOCAL : 1;      /*!< SHA_512_PRSNT_LOCAL                                                       */
      __IOM uint32_t SHA256PRSNTLOCAL : 1;      /*!< SHA_256_PRSNT_LOCAL                                                       */
      __IOM uint32_t MD5PRSNTLOCAL : 1;         /*!< MD5_PRSNT_LOCAL                                                           */
      __IOM uint32_t HASHEXISTSLOCAL : 1;       /*!< HASH_EXISTS_LOCAL                                                         */
      __IOM uint32_t C2EXISTSLOCAL : 1;         /*!< C2_EXISTS_LOCAL                                                           */
      __IOM uint32_t DESEXISTSLOCAL : 1;        /*!< DES_EXISTS_LOCAL                                                          */
      __IOM uint32_t AESXCBCMACEXISTSLOCAL : 1; /*!< AES_XCBC_MAC_EXISTS_LOCAL                                                 */
      __IOM uint32_t AESCMACEXISTSLOCAL : 1;    /*!< AES_CMAC_EXISTS_LOCAL                                                     */
      __IOM uint32_t AESCCMEXISTSLOCAL : 1;     /*!< AES_CCM_EXISTS_LOCAL                                                      */
      __IOM uint32_t AESXEXHWTCALCLOCAL : 1;    /*!< AES_XEX_HW_T_CALC_LOCAL                                                   */
      __IOM uint32_t AESXEXEXISTSLOCAL : 1;     /*!< AES_XEX_EXISTS_LOCAL                                                      */
      __IOM uint32_t CTREXISTSLOCAL : 1;        /*!< CTR_EXISTS_LOCAL                                                          */
      __IOM uint32_t AESDINBYTERESOLUTIONLOCAL : 1;/*!< AES_DIN_BYTE_RESOLUTION_LOCAL                                          */
      __IOM uint32_t TUNNELINGENBLOCAL : 1;     /*!< TUNNELING_ENB_LOCAL                                                       */
      __IOM uint32_t SUPPORT256192KEYLOCAL : 1; /*!< SUPPORT_256_192_KEY_LOCAL                                                 */
      __IOM uint32_t ONLYENCRYPTLOCAL : 1;      /*!< ONLY_ENCRYPT_LOCAL                                                        */
      __IOM uint32_t AESEXISTSLOCAL : 1;        /*!< AES_EXISTS_LOCAL                                                          */
            uint32_t            : 1;
    } HOSTBOOT_b;
  } ;
  __IM  uint32_t  RESERVED36[3];

  union {
    __IOM uint32_t HOSTCRYPTOKEYSEL;            /*!< AES hardware key select. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

