AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DATA       : 32;           /*!< DOUT This address can be used by the CPU to read data directly
                                                     from the DOUT buffer.                                                     */
    } DOUTBUFFER_b;
  } ;
  __IM  uint32_t  RESERVED46[7];

  union {
    __IOM uint32_t DOUTMEMDMABUSY;              /*!< DOUT memory DMA busy - Indicates that memory (AXI) destination
                                                     DMA (DOUT) is busy,                                                       */

    struct {
      __IOM uint32_t DOUTMEMDMABUSY : 1;        /*!< DOUT memory DMA busy:                                                     */
            uint32_t            : 31;
    } DOUTMEMDMABUSY_b;
  } ;
  __IM  uint32_t  RESERVED47;

  union {
    __IOM uint32_t DSTLLIWORD0;                 /*!< This register is used in direct LLI mode - holds the location
                                                     of the data destination in the memory (AXI)                               */

    struct {
      __IOM uint32_t DSTLLIWORD0 : 32;          /*!< Destination address within memory                                         */
    } DSTLLIWORD0_b;
  } ;

  union {
    __IOM uint32_t DSTLLIWORD1;                 /*!< This register is used in direct LLI mode - holds the number
                                                     of bytes to be written to the memory (AXI). Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

    struct {
      __IOM uint32_t BYTESNUM   : 30;           /*!< Total byte number to be written by DMA in this entry                      */
      __IOM uint32_t FIRST      : 1;            /*!< 0x1 - Indicates the first LLI entry                                       */
      __IOM uint32_t LAST       : 1;            /*!< 0x1 - Indicates the last LLI entry                                        */
    } DSTLLIWORD1_b;
  } ;

  union {
    __IOM uint32_t SRAMDESTADDR;                /*!< Location of result to be sent to in SRAM. Note: This is a special
                                                     register, affected by internal logic. Test result of this
                                                     register is NA.                                                           */

    struct {
      __IOM uint32_t SRAMDEST   : 32;           /*!< SRAM destination base address for data.                                   */
    } SRAMDESTADDR_b;
  } ;

  union {
    __IOM uint32_t DOUTSRAMBYTESLEN;            /*!< This register holds the size of the data (in bytes) to be written
                                                     to the SRAM. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t BYTESLEN   : 32;           /*!< Size of data to write to SRAM (bytes). This is the trigger to
                                                     the SRAM DST DMA.                                                         */
    } DOUTSRAMBYTESLEN_b;
  } ;

  union {
    __IOM uint32_t DOUTSRAMDMABUSY;             /*!< This register holds the status of the SRAM DMA DOUT.                      */

    struct {
      __IOM uint32_t BUSY       : 1;            /*!< DOUT SRAM DMA busy status.                                                */
            uint32_t            : 31;
    } DOUTSRAMDMABUSY_b;
  } ;

  union {
    __IOM uint32_t DOUTSRAMENDIANNESS;          /*!< This register defines the endianness of the DOUT interface from
                                                     SRAM.                                                                     */

    struct {
      __IOM uint32_t DOUTSRAMENDIANNESS : 1;    /*!< Defines the endianness of DOUT interface from SRAM:                       */
            uint32_t            : 31;
    } DOUTSRAMENDIANNESS_b;
  } ;
  __IM  uint32_t  RESERVED48;

  union {
    __IOM uint32_t READALIGNLAST;               /*!< Indication that the next read from the CPU is the last one.
                                                     This is needed only when the data size is NOT modulo 4
                                                     (e.g. HASH padding).                                                      */

    struct {
      __IOM uint32_t LAST       : 1;            /*!< 0x1 - Flush the read aligner content (used for reading the last
                                                     data).                                                                    */
            uint32_t            : 31;
    } READALIGNLAST_b;
  } ;
  __IM  uint32_t  RESERVED49[2];

  union {
    __IOM uint32_t DOUTFIFOEMPTY;               /*!< DOUT_FIFO_EMPTY Register.                                                 */

    struct {
      __IOM uint32_t DOUTFIFOEMPTY : 1;         /*!< DOUT FIFO empty status.                                                   */
            uint32_t            : 31;
    } DOUTFIFOEMPTY_b;
  } ;
  __IM  uint32_t  RESERVED50[107];

  union {
    __IOM uint32_t SRAMDATA;                    /*!< READ WRITE DATA FROM SRAM. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t SRAMDATA   : 32;           /*!< 32 bit write or read from SRAM: read - triggers the SRAM read
                                                     DMA address automatically incremented write - triggers
                                                     the SRAM write DMA address automatically incremented                      */
    } SRAMDATA_b;
  } ;

  union {
    __IOM uint32_t SRAMADDR;                    /*!< first address given to SRAM DMA for read_write transactions
                                                     from SRAM                                                                 */

