AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t HOSTFATALERR : 1;          /*!< When the 'FATAL_ERROR' register is asserted - HW keys will not
                                                     be copied from OTP                                                        */
      __IOM uint32_t HOSTKPICVLOCK : 1;         /*!< When this FW controlled register is set, the Kpicv HW key is
                                                     masked (to zero).                                                         */
      __IOM uint32_t HOSTKCEICVLOCK : 1;        /*!< When this FW controlled register is set, the Kceicv HW key is
                                                     masked (to zero).                                                         */
      __IOM uint32_t HOSTKCPLOCK : 1;           /*!< When this FW controlled register is set, the Kcp HW key is masked
                                                     (to zero).                                                                */
      __IOM uint32_t HOSTKCELOCK : 1;           /*!< When this FW controlled register is set, the Kce HW key is masked
                                                     (to zero).                                                                */
      __IOM uint32_t HOSTICVRMALOCK : 1;        /*!< The ICV_RMA_LOCK register is set-once (per POR).                          */
      __IOM uint32_t RESETUPONDEBUGDISABLE : 1; /*!< The RESET_UPON_DEBUG_DISABLE register is set-once (per POR).              */
      __IOM uint32_t HOSTFORCEDFAENABLE : 1;    /*!< When this FW controlled register is set, the AES DFA countermeasures
                                                     are enabled_disabled (regardless of the AES_DFA_IS_ON register
                                                     value).                                                                   */
      __IOM uint32_t HOSTDFAENABLELOCK : 1;     /*!< When this FW control is set, the DFA_ENABLE register cant be
                                                     written until the next POR. The DFA_ENABLE_LOCK register
                                                     is set-once (per POR).                                                    */
            uint32_t            : 23;
    } HOSTAOLOCKBITS_b;
  } ;

  union {
    __IOM uint32_t AOAPBFILTERING;              /*!< This register holds the AO_APB_FILTERING data. Note: This is
                                                     a special register, affected by internal logic. Test result
                                                     of this register is NA.                                                   */

    struct {
      __IOM uint32_t ONLYSECACCESSALLOW : 1;    /*!< when this FW controlled register is set, the APB slave accepts
                                                     only secure accesses                                                      */
      __IOM uint32_t ONLYSECACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the ONLY_SEC_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR).                           */
      __IOM uint32_t ONLYPRIVACCESSALLOW : 1;   /*!< when this FW controlled register is set, the APB slave accepts
                                                     only privileged accesses                                                  */
      __IOM uint32_t ONLYPRIVACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR)                            */
      __IOM uint32_t APBCONLYSECACCESSALLOW : 1;/*!< when this FW controlled register is set, the APB-C slave accepts
                                                     only secure accesses                                                      */
      __IOM uint32_t APBCONLYSECACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_SEC_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR).                           */
      __IOM uint32_t APBCONLYPRIVACCESSALLOW : 1;/*!< when this FW controlled register is set, the APB-C slave accepts
                                                     only privileged accesses                                                  */
      __IOM uint32_t APBCONLYPRIVACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR)                            */
      __IOM uint32_t APBCONLYINSTACCESSALLOW : 1;/*!< when this FW controlled register is set, the APB-C slave accepts
                                                     only instruction accesses                                                 */
      __IOM uint32_t APBCONLYINSTACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_INST_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR)                            */
            uint32_t            : 22;
    } AOAPBFILTERING_b;
  } ;

  union {
    __IOM uint32_t AOCCGPPC;                    /*!< holds the AO_CC_GPPC value from AONote: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t AOCCGPPC   : 8;            /*!< The AO_CC_GPPC value                                                      */
            uint32_t            : 24;
    } AOCCGPPC_b;
  } ;

  union {
    __IOM uint32_t HOSTRGFCCSWRST;              /*!< Writing to this register generates a general reset to CryptoCell.
                                                     This reset takes about 4 core clock cycles.Note: This is
                                                     a special register, affected by internal logic. Test result
                                                     of this register is NA.                                                   */

