AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DIVIDEVALUE : 6;           /*!< Value of first clock divider                                              */
      __IOM uint32_t RSVD0      : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LINENUM    : 6;            /*!< Number of lines to be prefetched before starting the frame through
                                                     DMA. Maximum value is 32                                                  */
      __IOM uint32_t RSVD1      : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t PLL        : 8;            /*!< Select PLL Clock                                                          */
      __IOM uint32_t LVDS       : 3;            /*!< Clock phase shift value for LVDS operation                                */
      __IOM uint32_t SECCLKDIV  : 5;            /*!< Value of secondary clock divider                                          */
    } CLKCTRL_b;
  } ;

  union {
    __IOM uint32_t BGCOLOR;                     /*!< Specifies the main background color.                                      */

    struct {
      __IOM uint32_t ALPHACOLOR : 8;            /*!< Color alpha is used as background color                                   */
      __IOM uint32_t BLUECOLOR  : 8;            /*!< Color blue is used as background color                                    */
      __IOM uint32_t GREENCOLOR : 8;            /*!< Color green is used as background color                                   */
      __IOM uint32_t REDCOLOR   : 8;            /*!< Color red is used as background color                                     */
    } BGCOLOR_b;
  } ;

  union {
    __IOM uint32_t RESXY;                       /*!< Specifies the main X and Y resolutions.                                   */

    struct {
      __IOM uint32_t YRES       : 16;           /*!< Value of Y resolution in pixels                                           */
      __IOM uint32_t XRES       : 16;           /*!< Value of X resolution in pixels                                           */
    } RESXY_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t FRONTPORCHXY;                /*!< Specifies the X and Y dimensions for the Front Porch.                     */

    struct {
      __IOM uint32_t FLINES     : 16;           /*!< Specify the number of lines for the front porch Y dimension               */
      __IOM uint32_t FPCLKCYCLES : 16;          /*!< Specify the pixel clock cycles for the front porch X dimension            */
    } FRONTPORCHXY_b;
  } ;

  union {
    __IOM uint32_t BLANKINGXY;                  /*!< Specifies the X and Y dimensions for the Blanking Period.                 */

    struct {
      __IOM uint32_t VSYNCLINES : 16;           /*!< Specify the VSYNC lines for the Y dimension blanking period               */
      __IOM uint32_t HSYNCPULSE : 16;           /*!< Specify the HSYNC pulse length for the X dimension blanking
                                                     period                                                                    */
    } BLANKINGXY_b;
  } ;

  union {
    __IOM uint32_t BACKPORCHXY;                 /*!< Specifies the X and Y dimensions for the Back Porch.                      */

    struct {
      __IOM uint32_t BLINES     : 16;           /*!< Specify the number of lines for the back porch Y dimension                */
      __IOM uint32_t BPCLKCYCLES : 16;          /*!< Specify the pixel clock cycles for the back porch X dimension             */
    } BACKPORCHXY_b;
  } ;

  union {
    __IOM uint32_t CURSORXY;                    /*!< Specifies the cursor's start X and Y coordinates.                         */

    struct {
      __IOM uint32_t CURSORY    : 16;           /*!< Specify cursor's Y dimension                                              */
      __IOM uint32_t CURSORX    : 16;           /*!< Specify cursor's X dimension                                              */
    } CURSORXY_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t DBICFG;                      /*!< Register for the configuration DBI Type-B interface and the
                                                     activation of SPI 3-/4-wire interfaces.                                   */

    struct {
      __IOM uint32_t DBICOLORFMT : 3;           /*!< Set the color format for DBI interface                                    */
      __IOM uint32_t DATAWDORDER : 3;           /*!< Set the data order of the 8-bit data word:                                */
      __IOM uint32_t TYPEBWIDTH : 2;            /*!< Set DBI Type-B interface width (8, 9 or 16 bits) and the serial
                                                     interface:                                                                */
      __IOM uint32_t RSVD0      : 3;            /*!< This field is reserved.                                                   */
      __IOM uint32_t BACKPRESSUREEN : 1;        /*!< When set to 1, back pressure support is enabled (not currently
                                                     supported)                                                                */
      __IOM uint32_t RSVD1      : 4;            /*!< This field is reserved.                                                   */
      __IOM uint32_t INVHRZLINE : 1;            /*!< When set to 1, inverts the bit-order of the horizontal line
                                                     address (used along with DBI_CFG[17] register bit)                        */
      __IOM uint32_t BINDCMDS   : 1;            /*!< When set to 1, binds the store commands with the RGB data and
                                                     two-byte address is sent with each horizontal line                        */
      __IOM uint32_t RSVD2      : 4;            /*!< This field is reserved.                                                   */
      __IOM uint32_t SPI4       : 1;            /*!< When set to 1, SPI 4-wire interface is enabled                            */
      __IOM uint32_t SPI3       : 1;            /*!< When set to 1, SPI 3-wire interface is enabled                            */
      __IOM uint32_t RSVD3      : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t RESXLOW    : 1;            /*!< When set to 1, drives RESX signal low to reset DBI Type-B interface       */
      __IOM uint32_t RSVD4      : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t DBIBTEDIS  : 1;            /*!< When set to 1, the DBIB_TE signal is disabled                             */
      __IOM uint32_t CSXSET     : 1;            /*!< Sets the value of DBIB_CSX signal:                                        */
      __IOM uint32_t CSXCFG     : 1;            /*!< When set to 1, the value of the CSX signal of the DBI interface
                                                     can be configured from the DBI_CFG[29] register bit                       */
      __IOM uint32_t DBIINTACT  : 1;            /*!< When set to 1, the DBI interface is activated                             */
    } DBICFG_b;
  } ;

  union {
    __IOM uint32_t DCGPIO;                      /*!< General Purpose register: read/write GPIO external pins. This
                                                     is accumulated as- {CGBYPASS_in,13'd0,ADVANCE_ANYWAY_in,5'd0,GPIO_in}     */

