AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t RWPINS     : 2;            /*!< These are not implemented                                                 */
      __IOM uint32_t RSVD0      : 5;            /*!< This field is reserved.                                                   */
      __IOM uint32_t ADVANCEANYWAY : 2;         /*!< No idea what this is                                                      */
      __IOM uint32_t RSVD1      : 13;           /*!< This field is reserved.                                                   */
      __IOM uint32_t CGBYPASS   : 10;           /*!< No idea what this is                                                      */
    } DCGPIO_b;
  } ;

  union {
    __IOM uint32_t LAYER0MODE;                  /*!< LAYER0_MODE: Activate and set-up layer 0.                                 */

    struct {
      __IOM uint32_t LAYER0COLMODE : 5;         /*!< Color mode                                                                */
      __IOM uint32_t RSVD0      : 3;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER0SBLEND : 4;          /*!< Source blending function                                                  */
      __IOM uint32_t LAYER0DBLEND : 4;          /*!< Destination blending function                                             */
      __IOM uint32_t LAYER0ALPHA : 8;           /*!< Alpha layer global value (0x00-0xFF range)                                */
      __IOM uint32_t RSVD1      : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER0GAMMA : 1;           /*!< When set to 1, Gamma Look Up Table is enabled                             */
      __IOM uint32_t LAYER0HLOCK : 1;           /*!< When set to 1, HLOCK signal on AHB DMAs is asserted                       */
      __IOM uint32_t LAYER0PREMULT : 1;         /*!< When set to 1, premultiply image alpha is enabled                         */
      __IOM uint32_t LAYER0BFILTER : 1;         /*!< When set to 1, bilinear filtering is enabled                              */
      __IOM uint32_t LAYER0FORCE : 1;           /*!< When set to 1, force alpha with global alpha is enabled                   */
      __IOM uint32_t LAYER0EN   : 1;            /*!< When set to 1, layer n is enabled                                         */
    } LAYER0MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER0STARTXY;               /*!< X and Y start dimensions of layer 0.                                      */

    struct {
      __IOM uint32_t LAYER0YOFF : 16;           /*!< Specify the pixel offset of the starting Y dimension of layer
                                                     0                                                                         */
      __IOM uint32_t LAYER0XOFF : 16;           /*!< Specify the pixel offset of the starting X dimension of layer
                                                     0                                                                         */
    } LAYER0STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER0SIZEXY;                /*!< X and Y size of layer 0.                                                  */

    struct {
      __IOM uint32_t LAYER0PIXSZEY : 16;        /*!< Specify the pixel size of the layer 0 in the Y dimension                  */
      __IOM uint32_t LAYER0PIXSZEX : 16;        /*!< Specify the pixel size of the layer 0 in the X dimension                  */
    } LAYER0SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER0ADDR;                  /*!< The start address of the framebuffer to be accessed by layer
                                                     0.                                                                        */

    struct {
      __IOM uint32_t LAYER0STARTADDRFBUF : 32;  /*!< Specify the start address of framebuffer for each layer 0.                */
    } LAYER0ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER0STRIDE;                /*!< Specify the stride and the AXI bus burst of layer 0.                      */

    struct {
      __IOM uint32_t LAYER0STRIDEDIST : 16;     /*!< Specify the stride, which is the distance from line to line
                                                     in bytes for each layer 0 memory                                          */
      __IOM uint32_t LAYER0AXIBURSTBITS : 3;    /*!< Specify the AXI bits per burst in layer 0                                 */
      __IOM uint32_t LAYER0AXIFIFOTHLD : 2;     /*!< Specify the AXI fifo threshold burst start in layer 0                     */
      __IOM uint32_t RSVD       : 11;           /*!< This field is reserved.                                                   */
    } LAYER0STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER0RESXY;                 /*!< X and Y dimensions for the resolution of layer 0.                         */

    struct {
      __IOM uint32_t LAYER0PIXRESY : 16;        /*!< Specify the layer n pixel resolution in the Y dimension                   */
      __IOM uint32_t LAYER0PIXRESX : 16;        /*!< Specify the layer n pixel resolution in the X dimension                   */
    } LAYER0RESXY_b;
  } ;

  union {
    __IOM uint32_t LAYER0SCALEX;                /*!< Scale X factor of layer 0.                                                */

    struct {
      __IOM uint32_t LAYER0XFACTOR : 32;        /*!< Specify the scale X factor of layer n (4.14 fixed point number)           */
    } LAYER0SCALEX_b;
  } ;

  union {
    __IOM uint32_t LAYER0SCALEY;                /*!< Scale Y factor of layer 0.                                                */

    struct {
      __IOM uint32_t LAYER0YFACTOR : 32;        /*!< Specify the scale Y factor of layer n (4.14 fixed point number)           */
    } LAYER0SCALEY_b;
  } ;

  union {
    __IOM uint32_t LAYER1MODE;                  /*!< Activate and set-up layer 1.                                              */

    struct {
      __IOM uint32_t LAYER1COLORMODE : 5;       /*!< Color mode                                                                */
      __IOM uint32_t RSVD0      : 3;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER1SBLEND : 4;          /*!< Source blending function                                                  */
      __IOM uint32_t LAYER1DBLEND : 4;          /*!< Destination blending function                                             */
      __IOM uint32_t LAYER1ALPHA : 8;           /*!< Alpha layer global value (0x00-0xFF range)                                */
      __IOM uint32_t RSVD1      : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER1GAMMA : 1;           /*!< When set to 1, Gamma Look Up Table is enabled                             */
      __IOM uint32_t LAYER1HLOCK : 1;           /*!< When set to 1, HLOCK signal on AHB DMAs is asserted                       */
      __IOM uint32_t LAYER1PREMULT : 1;         /*!< When set to 1, premultiply image alpha is enabled                         */
      __IOM uint32_t LAYER1BFILTER : 1;         /*!< When set to 1, bilinear filtering is enabled                              */
      __IOM uint32_t LAYER1FORCE : 1;           /*!< When set to 1, force alpha with global alpha is enabled                   */
      __IOM uint32_t LAYER1EN   : 1;            /*!< When set to 1, layer n is enabled                                         */
    } LAYER1MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER1STARTXY;               /*!< X and Y start dimensions of layer 1.                                      */

