AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t LAYER2STARTADDRFBUF : 32;  /*!< Specify the start address of framebuffer for each layer 2.                */
    } LAYER2ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER2STRIDE;                /*!< Specify the stride and the AXI bus burst of layer 2.                      */

    struct {
      __IOM uint32_t LAYER2STRIDEDIST : 16;     /*!< Specify the stride, which is the distance from line to line
                                                     in bytes for each layer 2 memory                                          */
      __IOM uint32_t LAYER2AXIBURSTBITS : 3;    /*!< Specify the AXI bits per burst in layer 2                                 */
      __IOM uint32_t LAYER2AXIFIFOTHLD : 2;     /*!< Specify the AXI fifo threshold burst start in layer 2                     */
      __IOM uint32_t RSVD       : 11;           /*!< This field is reserved.                                                   */
    } LAYER2STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER2RESXY;                 /*!< X and Y dimensions for the resolution of layer 2.                         */

    struct {
      __IOM uint32_t LAYER2PIXRESY : 16;        /*!< Specify the layer n pixel resolution in the Y dimension                   */
      __IOM uint32_t LAYER2PIXRESX : 16;        /*!< Specify the layer n pixel resolution in the X dimension                   */
    } LAYER2RESXY_b;
  } ;

  union {
    __IOM uint32_t LAYER2SCALEX;                /*!< Scale X factor of layer 2.                                                */

    struct {
      __IOM uint32_t LAYER2XFACTOR : 32;        /*!< Specify the scale X factor of layer n (4.14 fixed point number)           */
    } LAYER2SCALEX_b;
  } ;

  union {
    __IOM uint32_t LAYER2SCALEY;                /*!< Scale Y factor of layer 2.                                                */

    struct {
      __IOM uint32_t LAYER2YFACTOR : 32;        /*!< Specify the scale Y factor of layer n (4.14 fixed point number)           */
    } LAYER2SCALEY_b;
  } ;

  union {
    __IOM uint32_t LAYER3MODE;                  /*!< Activate and set-up layer 3.                                              */

    struct {
      __IOM uint32_t LAYER3COLORMODE : 5;       /*!< Color mode                                                                */
      __IOM uint32_t RSVD0      : 3;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER3SBLEND : 4;          /*!< Source blending function                                                  */
      __IOM uint32_t LAYER3DBLEND : 4;          /*!< Destination blending function                                             */
      __IOM uint32_t LAYER3ALPHA : 8;           /*!< Alpha layer global value (0x00-0xFF range)                                */
      __IOM uint32_t RSVD1      : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER3GAMMA : 1;           /*!< When set to 1, Gamma Look Up Table is enabled                             */
      __IOM uint32_t LAYER3HLOCK : 1;           /*!< When set to 1, HLOCK signal on AHB DMAs is asserted                       */
      __IOM uint32_t LAYER3PREMULT : 1;         /*!< When set to 1, premultiply image alpha is enabled                         */
      __IOM uint32_t LAYER3BFILTER : 1;         /*!< When set to 1, bilinear filtering is enabled                              */
      __IOM uint32_t LAYER3FORCE : 1;           /*!< When set to 1, force alpha with global alpha is enabled                   */
      __IOM uint32_t LAYER3EN   : 1;            /*!< When set to 1, layer n is enabled                                         */
    } LAYER3MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER3STARTXY;               /*!< X and Y start dimensions of layer 3.                                      */

    struct {
      __IOM uint32_t LAYER3YOFF : 16;           /*!< Specify the pixel offset of the starting Y dimension of layer
                                                     3                                                                         */
      __IOM uint32_t LAYER3XOFF : 16;           /*!< Specify the pixel offset of the starting X dimension of layer
                                                     3                                                                         */
    } LAYER3STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER3SIZEXY;                /*!< X and Y size of layer 3.                                                  */

    struct {
      __IOM uint32_t LAYER3PIXSZEY : 16;        /*!< Specify the pixel size of the layer 3 in the Y dimension                  */
      __IOM uint32_t LAYER3PIXSZEX : 16;        /*!< Specify the pixel size of the layer 3 in the X dimension                  */
    } LAYER3SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER3ADDR;                  /*!< The start address of the framebuffer to be accessed by layer
                                                     3.                                                                        */

    struct {
      __IOM uint32_t LAYER3STARTADDRFBUF : 32;  /*!< Specify the start address of framebuffer for each layer 3.                */
    } LAYER3ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER3STRIDE;                /*!< Specify the stride and the AXI bus burst of layer 3.                      */

    struct {
      __IOM uint32_t LAYER3STRIDEDIST : 16;     /*!< Specify the stride, which is the distance from line to line
                                                     in bytes for each layer 3 memory                                          */
      __IOM uint32_t LAYER3AXIBURSTBITS : 3;    /*!< Specify the AXI bits per burst in layer 3                                 */
      __IOM uint32_t LAYER3AXIFIFOTHLD : 2;     /*!< Specify the AXI fifo threshold burst start in layer 3                     */
      __IOM uint32_t RSVD       : 11;           /*!< This field is reserved.                                                   */
    } LAYER3STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER3RESXY;                 /*!< X and Y dimensions for the resolution of layer 3.                         */

