AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t LAYER3PIXRESY : 16;        /*!< Specify the layer n pixel resolution in the Y dimension                   */
      __IOM uint32_t LAYER3PIXRESX : 16;        /*!< Specify the layer n pixel resolution in the X dimension                   */
    } LAYER3RESXY_b;
  } ;

  union {
    __IOM uint32_t LAYER3SCALEX;                /*!< Scale X factor of layer 3.                                                */

    struct {
      __IOM uint32_t LAYER3XFACTOR : 32;        /*!< Specify the scale X factor of layer n (4.14 fixed point number)           */
    } LAYER3SCALEX_b;
  } ;

  union {
    __IOM uint32_t LAYER3SCALEY;                /*!< Scale Y factor of layer 3.                                                */

    struct {
      __IOM uint32_t LAYER3YFACTOR : 32;        /*!< Specify the scale Y factor of layer n (4.14 fixed point number)           */
    } LAYER3SCALEY_b;
  } ;
  __IM  uint32_t  RESERVED2[14];

  union {
    __IOM uint32_t DBICMD;                      /*!< Register to read/write commands from/to DBI Type-B interface.             */

    struct {
      __IOM uint32_t DATA2DBI   : 16;           /*!< Data to send to the DBI interface                                         */
      __IOM uint32_t RSVD0      : 11;           /*!< This field is reserved.                                                   */
      __IOM uint32_t LOCALSTORE : 1;            /*!< When set to 1, bits [15:0] are locally stored as base address
                                                     of the horizontal line; it is used along with the DBI_CFG[17:16]
                                                     register bits for the SPI interface                                       */
      __IOM uint32_t READDBI    : 1;            /*!< Read from DBI interface                                                   */
      __IOM uint32_t RSVD1      : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t DIRECTDATA : 1;            /*!< Send direct data of type 'command' to the DBI interface                   */
      __IOM uint32_t RSVD2      : 1;            /*!< This field is reserved.                                                   */
    } DBICMD_b;
  } ;

  union {
    __IOM uint32_t DBIRDAT;                     /*!< Data read by DBI Type-B interface are stored in the DBI_RDAT
                                                     register.                                                                 */

    struct {
      __IOM uint32_t READTYPEB  : 32;           /*!< Read data from DBI Type-B interface                                       */
    } DBIRDAT_b;
  } ;

  union {
    __IOM uint32_t CONFG;                       /*!< Information of the layers n activation and setup.                         */

    struct {
      __IOM uint32_t CFGGLBGAMMAEN : 1;         /*!< Indicates that Global Gamma/Palette is enabled                            */
      __IOM uint32_t CFGFCURSOREN : 1;          /*!< Indicates that fixed cursor is enabled                                    */
      __IOM uint32_t CFGPCURSOREN : 1;          /*!< Indicates that programmable cursor is enabled                             */
      __IOM uint32_t CFGDITHEREN : 1;           /*!< Indicates that dithering is enabled                                       */
      __IOM uint32_t CFGFORMATTEN : 1;          /*!< Indicates that formatting is enabled                                      */
      __IOM uint32_t CFGYUVCNVTEN : 1;          /*!< Indicates that high quality YUV converter is enabled                      */
      __IOM uint32_t CFGDBITYPEBEN : 1;         /*!< Indicates that DBI Type-B interface is enabled                            */
      __IOM uint32_t CFGRGB2YUVEN : 1;          /*!< Indicates that RGB to YUV converter is enabled                            */
      __IOM uint32_t CFGLAYER0EN : 1;           /*!< Indicates that layer 0 is enabled                                         */
      __IOM uint32_t CFGLAYER0BLENDER : 1;      /*!< Indicates that layer 0 has blender                                        */
      __IOM uint32_t CFGLAYER0SCALAR : 1;       /*!< Indicates that layer 0 has scaler                                         */
      __IOM uint32_t CFGLAYER0GAMMALUT : 1;     /*!< Indicates that layer 0 has gamma LUT                                      */
      __IOM uint32_t CFGLAYER1EN : 1;           /*!< Indicates that layer 1 is enabled                                         */
      __IOM uint32_t CFGLAYER1BLENDER : 1;      /*!< Indicates that layer 1 has blender                                        */
      __IOM uint32_t CFGLAYER1SCALAR : 1;       /*!< Indicates that layer 1 has scaler                                         */
      __IOM uint32_t CFGLAYER1GAMMALUT : 1;     /*!< Indicates that layer 1 has gamma LUT                                      */
      __IOM uint32_t CFGLAYER2EN : 1;           /*!< Indicates that layer 2 is enabled                                         */
      __IOM uint32_t CFGLAYER2BLENDER : 1;      /*!< Indicates that layer 2 has blender                                        */
      __IOM uint32_t CFGLAYER2SCALAR : 1;       /*!< Indicates that layer 2 has scaler                                         */
      __IOM uint32_t CFGLAYER2GAMMALUT : 1;     /*!< Indicates that layer 2 has gamma LUT                                      */
      __IOM uint32_t CFGLAYER3EN : 1;           /*!< Indicates that layer 3 is enabled                                         */
      __IOM uint32_t CFGLAYER3BLENDER : 1;      /*!< Indicates that layer 3 has blender                                        */
      __IOM uint32_t CFGLAYER3SCALAR : 1;       /*!< Indicates that layer 3 has scaler                                         */
      __IOM uint32_t CFGLAYER3GAMMALUT : 1;     /*!< Indicates that layer 3 has gamma LUT                                      */
      __IOM uint32_t RSVD       : 8;            /*!< This field is reserved.                                                   */
    } CONFG_b;
  } ;

  union {
    __IOM uint32_t IDREG;                       /*!< Identification Register.                                                  */

