AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t RXSOTERROR : 1;            /*!< RX start of transmission; set to enable the interrupt for start
                                                     of transmission                                                           */
      __IOM uint32_t RXSOTSYNCERROR : 1;        /*!< RX start of transmission; Set to enable the interrupt for start
                                                     of transmission synchronization error in the acknowledgement
                                                     packet reports                                                            */
      __IOM uint32_t RXEOTSYNCRR : 1;           /*!< RxEot Sync Error l set to enable the interrupt for the end of
                                                     transmission synchronisation Error in the acknowledgment
                                                     packet reports                                                            */
      __IOM uint32_t RXESCPMDETRYERR : 1;       /*!< RxEscape Mode Entry Error; Set to enable the interrupt for Escape
                                                     Mode Entry command error in the acknowledgment packet reports             */
      __IOM uint32_t RXLPTXSYNCERR : 1;         /*!< Rx LP tx sync error; Set to enable the interrupt for Low power
                                                     transmission sync error in the acknowledgment packet reports              */
      __IOM uint32_t RXPERIPHRCVTOE : 1;        /*!< Peripheral receive timeout Error; Set to enable the interrupt
                                                     for the high speed timeout Error or Lp tx timeout error
                                                     in the acknowledgment packet reports                                      */
      __IOM uint32_t RXFALSE    : 1;            /*!< RxFalse Control error; set to enable the interrupt for control
                                                     error in the acknowledgment packet reports.                               */
      __IOM uint32_t RXECCS     : 1;            /*!< RxECC single bit error; Set to enable the interrupt for ECC
                                                     syndrome computation and one bit error correction for the
                                                     acknowledgment packet                                                     */
      __IOM uint32_t RXECCM     : 1;            /*!< RxECC multibit error; Set to enable the interrupt for no ECC
                                                     correction for the packet or there are more than 2 bit
                                                     errors reported in the acknowledgment packet                              */
      __IOM uint32_t RXCHECKSUM : 1;            /*!< Rxchecksum error; Set to enable the interrupt for the computed
                                                     CRC differs from the received CRC value in the acknowledgment
                                                     packet reports                                                            */
      __IOM uint32_t RxDSIData  : 1;            /*!< RxDSI data type not recognised; Set to enable the interrupt
                                                     for the un recognised data type in the acknowledgment packet
                                                     reports                                                                   */
      __IOM uint32_t RxDSIV     : 1;            /*!< RxDSI VC ID invalid virtual channel; Set to enable the interrupt
                                                     for invalid ID in the acknowledgment packet reports                       */
      __IOM uint32_t TxFalseCntrl : 1;          /*!< TxFalse Control; Set to enable the interrupt for the control
                                                     error observed on the lanes by the Arasan_DSI_host                        */
      __IOM uint32_t TxECCS     : 1;            /*!< TxECC single bit; Set to enable the interrupt if ECC syndrome
                                                     was computed and is corrected for one bit error during
                                                     the reception of packets by the Arasan DSI Host                           */
      __IOM uint32_t TxECCM     : 1;            /*!< TxECC multibit; Set to enable the interrupt if there is no ECC
                                                     correction for the packet or there are more than 2 bit
                                                     errors in the packet received by Arasan DSI host                          */
      __IOM uint32_t TXCHCKSUM  : 1;            /*!< Txchecksum error; Set to enable the interrupt if the computed
                                                     CRC differs from the received CRC value for the received
                                                     packets                                                                   */
      __IOM uint32_t TxDSID     : 1;            /*!< TxDSI data type not recognised; Set to enable the interrupt
                                                     if the received packets data type is not recognised                       */
      __IOM uint32_t TxDSIV     : 1;            /*!< TxDSI VC ID invalid; Set to enable the interrupt if the received
                                                     packets virtual channel ID is invalid                                     */
      __IOM uint32_t HIGHC      : 1;            /*!< High contention; Set to enable a LP high fault interrupt                  */
      __IOM uint32_t LOWC       : 1;            /*!< Low contention; Set to enable a LP low fault interrupt                    */
      __IOM uint32_t FIFOEMPTY  : 1;            /*!< Set to enable a FIFO empty interrupt                                      */
      __IOM uint32_t HSTXTIMEOUT : 1;           /*!< Set to enable a high speed transmission timeout                           */
      __IOM uint32_t LPRXTIMEOUT : 1;           /*!< Set to enable low power reception count timeouts                          */
      __IOM uint32_t TURNARNDACK : 1;           /*!< Set to enable turn around acknowledgement sequence timeout                */
      __IOM uint32_t ACKWITHNOERR : 1;          /*!< ACK with No_error; Set to enable acknowledge trigger message
                                                     reception with out any error                                              */
      __IOM uint32_t RXINV      : 1;            /*!< Rx Invalid transmission count error; Set to enable acknowledge
                                                     invalid transmission counterror                                           */
      __IOM uint32_t RXDSI      : 1;            /*!< Rx DSI protocol violation; Set to enable DSI protocol violation
                                                     error                                                                     */
      __IOM uint32_t SPECIALPACK : 1;           /*!< Special packet command sent; Set to enable the confirmation
                                                     interrupt for transmitting DPI events set in the dpi data
                                                     and dpi control registers                                                 */
      __IOM uint32_t INITDONE   : 1;            /*!< Set 1 indicates that the DSI initialisation is done DSI Tx is
                                                     ready to accept the DPI or DBI or Generic transfer                        */
      __IOM uint32_t RXCONTENT  : 1;            /*!< Detected Rx Contention Detected; Set to enable the interrupt
                                                     for contention detected error in the acknowledgment packet
                                                     reports                                                                   */
      __IOM uint32_t DPILINETO  : 1;            /*!< Dpi line timeout; Set to 1 indicates that the line time out
                                                     during the DPI transfer                                                   */
      __IOM uint32_t DPI        : 1;            /*!< PGRMERR DPI program error; Set to 1 indicates that the error
                                                     in DPI parameters programming                                             */
    } INTREN_b;
  } ;

  union {
    __IOM uint32_t DSIFUNCPRG;                  /*!< DSI function programming register                                         */

