AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t CPUDSP0MBDATA : 32;        /*!< DSP 0 CPU Mailbox data                                                    */
    } CPUDSP0MBDATA_b;
  } ;

  union {
    __IOM uint32_t DSP0DSP0MBDATA;              /*!< DSP0 to DSP 0 Mailbox Data                                                */

    struct {
      __IOM uint32_t DSP0DSP0MBDATA : 32;       /*!< DSP0 to DSP 0 Mailbox data                                                */
    } DSP0DSP0MBDATA_b;
  } ;

  union {
    __IOM uint32_t DSP1DSP0MBDATA;              /*!< DSP1 to DSP 0 Mailbox Data                                                */

    struct {
      __IOM uint32_t DSP1DSP0MBDATA : 32;       /*!< DSP1 to DSP 0 Mailbox data                                                */
    } DSP1DSP0MBDATA_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t DSP1MBINTSET;                /*!< DSP1 Mailbox Interrupt Set                                                */

    struct {
      __IOM uint32_t DSP1MBINTSET : 32;         /*!< DSP1 Mailbox interrupt Set. The corresponding data bit will
                                                     set the interrupt.                                                        */
    } DSP1MBINTSET_b;
  } ;

  union {
    __IOM uint32_t DSP1MBINTCLR;                /*!< DSP1 Mailbox Interrupt Clear                                              */

    struct {
      __IOM uint32_t DSP1MBINTCLR : 32;         /*!< DSP1 Mailbox interrupt Clear. The corresponding data bit will
                                                     clear the interrupt.                                                      */
    } DSP1MBINTCLR_b;
  } ;

  union {
    __IOM uint32_t DSP1MBINTSTAT;               /*!< DSP 1 Mailbox Interrupt Status                                            */

    struct {
      __IOM uint32_t DSP1MBINTSTAT : 32;        /*!< DSP 1 CPU Mailbox interrupt                                               */
    } DSP1MBINTSTAT_b;
  } ;

  union {
    __IOM uint32_t CPUDSP1MBDATA;               /*!< CPU to DSP 1 Mailbox Data                                                 */

    struct {
      __IOM uint32_t CPUDSP1MBDATA : 32;        /*!< DSP 1 CPU Mailbox data                                                    */
    } CPUDSP1MBDATA_b;
  } ;

  union {
    __IOM uint32_t DSP0DSP1MBDATA;              /*!< DSP0 to DSP 1 Mailbox Data                                                */

    struct {
      __IOM uint32_t DSP0DSP1MBDATA : 32;       /*!< DSP0 to DSP 1 Mailbox data                                                */
    } DSP0DSP1MBDATA_b;
  } ;

  union {
    __IOM uint32_t DSP1DSP1MBDATA;              /*!< DSP1 to DSP 1 Mailbox Data                                                */

    struct {
      __IOM uint32_t DSP1DSP1MBDATA : 32;       /*!< DSP1 to DSP 1 Mailbox data                                                */
    } DSP1DSP1MBDATA_b;
  } ;
  __IM  uint32_t  RESERVED4[10];

  union {
    __IOM uint32_t DSP0CONTROL;                 /*!< DSP 0 control settings                                                    */

    struct {
      __IOM uint32_t DSP0STATVECSEL : 1;        /*!< DSP 0 StatVectorSel                                                       */
      __IOM uint32_t DSP0BRESET : 1;            /*!< DSP0 BReset. This is the reset used for Xtensa core. S/w must
                                                     clear this reset to use Dsp.                                              */
      __IOM uint32_t DSP0DRESET : 1;            /*!< DSP0 DReset. This is the reset used for debug functionality
                                                     like OCD/TRAX etc.                                                        */
      __IOM uint32_t DSP0RUNSTALL : 1;          /*!< DSP 0 RunStall. When asserted, DSP 0 will stall until bit is
                                                     cleared.                                                                  */
      __IOM uint32_t DSP0IDMATRIG : 2;          /*!< DSP 0 IDMA Trigger Control                                                */
            uint32_t            : 2;
      __IOM uint32_t DSP0IDMAXTRIGSRC : 23;     /*!< DSP 0 IDMA Cross Trigger Source. All enabled sources are ANDed
                                                     to generate a trigger enable.
                                                     Bit30-12:IRQ18-0 Bit11: IDMATRIGPULSE, Bit10: DSP Timer1,
                                                     Bit9: DSP Timer0, Bit8: alternate DSP iDMA trigger out                    */
            uint32_t            : 1;
    } DSP0CONTROL_b;
  } ;

  union {
    __IOM uint32_t DSP0RESETVEC;                /*!< DSP 0 Reset Vector                                                        */

    struct {
      __IOM uint32_t DSP0RESETVEC : 32;         /*!< DSP 0 Reset Vector Address.                                               */
    } DSP0RESETVEC_b;
  } ;

  union {
    __IOM uint32_t DSP0IRQMASK;                 /*!< DSP 0 IRQ Mask                                                            */

    struct {
      __IOM uint32_t DSP0IRQMASK : 23;          /*!< DSP 0 IRQ Mask                                                            */
            uint32_t            : 9;
    } DSP0IRQMASK_b;
  } ;

  union {
    __IOM uint32_t DSP0WAKEMASK;                /*!< DSP 0 IRQ Wake Mask                                                       */

    struct {
      __IOM uint32_t DSP0WAKEMASK : 23;         /*!< DSP 0 IRQ Wake Mask                                                       */
            uint32_t            : 9;
    } DSP0WAKEMASK_b;
  } ;

  union {
    __IOM uint32_t DSP0RAWIRQSTAT31to0;         /*!< DSP 0 Raw IRQ31-0 Status                                                  */

    struct {
      __IOM uint32_t DSP0RAWIRQSTAT31to0 : 32;  /*!< DSP 0 Raw IRQ31-0 Status                                                  */
    } DSP0RAWIRQSTAT31to0_b;
  } ;

  union {
    __IOM uint32_t DSP0RAWIRQSTAT63to32;        /*!< DSP 0 Raw IRQ63-32 Status                                                 */

