AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t FNCSEL22   : 4;            /*!< Function select for GPIO pin 22                                           */
      __IOM uint32_t INPEN22    : 1;            /*!< Input enable for GPIO 22                                                  */
      __IOM uint32_t RDZERO22   : 1;            /*!< Return 0 for read data on GPIO 22                                         */
      __IOM uint32_t IRPTEN22   : 2;            /*!< Interrupt enable for GPIO 22                                              */
      __IOM uint32_t OUTCFG22   : 2;            /*!< Pin IO mode selection for GPIO pin 22                                     */
      __IOM uint32_t DS22       : 2;            /*!< Drive strength selection for GPIO 22                                      */
      __IOM uint32_t SR22       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG22  : 3;            /*!< Pullup/Pulldown configuration for GPIO 22                                 */
      __IOM uint32_t NCESRC22   : 6;            /*!< IOMSTR/MSPI N Chip Select 22, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL22   : 1;            /*!< Polarity select for NCE for GPIO 22                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN22     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN22     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG22_b;
  } ;

  union {
    __IOM uint32_t PINCFG23;                    /*!< Controls the operation of GPIO pin 23.                                    */

    struct {
      __IOM uint32_t FNCSEL23   : 4;            /*!< Function select for GPIO pin 23                                           */
      __IOM uint32_t INPEN23    : 1;            /*!< Input enable for GPIO 23                                                  */
      __IOM uint32_t RDZERO23   : 1;            /*!< Return 0 for read data on GPIO 23                                         */
      __IOM uint32_t IRPTEN23   : 2;            /*!< Interrupt enable for GPIO 23                                              */
      __IOM uint32_t OUTCFG23   : 2;            /*!< Pin IO mode selection for GPIO pin 23                                     */
      __IOM uint32_t DS23       : 2;            /*!< Drive strength selection for GPIO 23                                      */
      __IOM uint32_t SR23       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG23  : 3;            /*!< Pullup/Pulldown configuration for GPIO 23                                 */
      __IOM uint32_t NCESRC23   : 6;            /*!< IOMSTR/MSPI N Chip Select 23, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL23   : 1;            /*!< Polarity select for NCE for GPIO 23                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN23     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN23     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG23_b;
  } ;

  union {
    __IOM uint32_t PINCFG24;                    /*!< Controls the operation of GPIO pin 24.                                    */

    struct {
      __IOM uint32_t FNCSEL24   : 4;            /*!< Function select for GPIO pin 24                                           */
      __IOM uint32_t INPEN24    : 1;            /*!< Input enable for GPIO 24                                                  */
      __IOM uint32_t RDZERO24   : 1;            /*!< Return 0 for read data on GPIO 24                                         */
      __IOM uint32_t IRPTEN24   : 2;            /*!< Interrupt enable for GPIO 24                                              */
      __IOM uint32_t OUTCFG24   : 2;            /*!< Pin IO mode selection for GPIO pin 24                                     */
      __IOM uint32_t DS24       : 2;            /*!< Drive strength selection for GPIO 24                                      */
      __IOM uint32_t SR24       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG24  : 3;            /*!< Pullup/Pulldown configuration for GPIO 24                                 */
      __IOM uint32_t NCESRC24   : 6;            /*!< IOMSTR/MSPI N Chip Select 24, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL24   : 1;            /*!< Polarity select for NCE for GPIO 24                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN24     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN24     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG24_b;
  } ;

  union {
    __IOM uint32_t PINCFG25;                    /*!< Controls the operation of GPIO pin 25.                                    */

