AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t FNCSEL43   : 4;            /*!< Function select for GPIO pin 43                                           */
      __IOM uint32_t INPEN43    : 1;            /*!< Input enable for GPIO 43                                                  */
      __IOM uint32_t RDZERO43   : 1;            /*!< Return 0 for read data on GPIO 43                                         */
      __IOM uint32_t IRPTEN43   : 2;            /*!< Interrupt enable for GPIO 43                                              */
      __IOM uint32_t OUTCFG43   : 2;            /*!< Pin IO mode selection for GPIO pin 43                                     */
      __IOM uint32_t DS43       : 2;            /*!< Drive strength selection for GPIO 43                                      */
      __IOM uint32_t SR43       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG43  : 3;            /*!< Pullup/Pulldown configuration for GPIO 43                                 */
      __IOM uint32_t NCESRC43   : 6;            /*!< IOMSTR/MSPI N Chip Select 43, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL43   : 1;            /*!< Polarity select for NCE for GPIO 43                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN43     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN43     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG43_b;
  } ;

  union {
    __IOM uint32_t PINCFG44;                    /*!< Controls the operation of GPIO pin 44.                                    */

    struct {
      __IOM uint32_t FNCSEL44   : 4;            /*!< Function select for GPIO pin 44                                           */
      __IOM uint32_t INPEN44    : 1;            /*!< Input enable for GPIO 44                                                  */
      __IOM uint32_t RDZERO44   : 1;            /*!< Return 0 for read data on GPIO 44                                         */
      __IOM uint32_t IRPTEN44   : 2;            /*!< Interrupt enable for GPIO 44                                              */
      __IOM uint32_t OUTCFG44   : 2;            /*!< Pin IO mode selection for GPIO pin 44                                     */
      __IOM uint32_t DS44       : 2;            /*!< Drive strength selection for GPIO 44                                      */
      __IOM uint32_t SR44       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG44  : 3;            /*!< Pullup/Pulldown configuration for GPIO 44                                 */
      __IOM uint32_t NCESRC44   : 6;            /*!< IOMSTR/MSPI N Chip Select 44, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL44   : 1;            /*!< Polarity select for NCE for GPIO 44                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN44     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN44     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG44_b;
  } ;

  union {
    __IOM uint32_t PINCFG45;                    /*!< Controls the operation of GPIO pin 45.                                    */

    struct {
      __IOM uint32_t FNCSEL45   : 4;            /*!< Function select for GPIO pin 45                                           */
      __IOM uint32_t INPEN45    : 1;            /*!< Input enable for GPIO 45                                                  */
      __IOM uint32_t RDZERO45   : 1;            /*!< Return 0 for read data on GPIO 45                                         */
      __IOM uint32_t IRPTEN45   : 2;            /*!< Interrupt enable for GPIO 45                                              */
      __IOM uint32_t OUTCFG45   : 2;            /*!< Pin IO mode selection for GPIO pin 45                                     */
      __IOM uint32_t DS45       : 2;            /*!< Drive strength selection for GPIO 45                                      */
      __IOM uint32_t SR45       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG45  : 3;            /*!< Pullup/Pulldown configuration for GPIO 45                                 */
      __IOM uint32_t NCESRC45   : 6;            /*!< IOMSTR/MSPI N Chip Select 45, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL45   : 1;            /*!< Polarity select for NCE for GPIO 45                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN45     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN45     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG45_b;
  } ;

  union {
    __IOM uint32_t PINCFG46;                    /*!< Controls the operation of GPIO pin 46.                                    */

