AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t FNCSEL46   : 4;            /*!< Function select for GPIO pin 46                                           */
      __IOM uint32_t INPEN46    : 1;            /*!< Input enable for GPIO 46                                                  */
      __IOM uint32_t RDZERO46   : 1;            /*!< Return 0 for read data on GPIO 46                                         */
      __IOM uint32_t IRPTEN46   : 2;            /*!< Interrupt enable for GPIO 46                                              */
      __IOM uint32_t OUTCFG46   : 2;            /*!< Pin IO mode selection for GPIO pin 46                                     */
      __IOM uint32_t DS46       : 2;            /*!< Drive strength selection for GPIO 46                                      */
      __IOM uint32_t SR46       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG46  : 3;            /*!< Pullup/Pulldown configuration for GPIO 46                                 */
      __IOM uint32_t NCESRC46   : 6;            /*!< IOMSTR/MSPI N Chip Select 46, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL46   : 1;            /*!< Polarity select for NCE for GPIO 46                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN46     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN46     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG46_b;
  } ;

  union {
    __IOM uint32_t PINCFG47;                    /*!< Controls the operation of GPIO pin 47.                                    */

    struct {
      __IOM uint32_t FNCSEL47   : 4;            /*!< Function select for GPIO pin 47                                           */
      __IOM uint32_t INPEN47    : 1;            /*!< Input enable for GPIO 47                                                  */
      __IOM uint32_t RDZERO47   : 1;            /*!< Return 0 for read data on GPIO 47                                         */
      __IOM uint32_t IRPTEN47   : 2;            /*!< Interrupt enable for GPIO 47                                              */
      __IOM uint32_t OUTCFG47   : 2;            /*!< Pin IO mode selection for GPIO pin 47                                     */
      __IOM uint32_t DS47       : 2;            /*!< Drive strength selection for GPIO 47                                      */
      __IOM uint32_t SR47       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG47  : 3;            /*!< Pullup/Pulldown configuration for GPIO 47                                 */
      __IOM uint32_t NCESRC47   : 6;            /*!< IOMSTR/MSPI N Chip Select 47, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL47   : 1;            /*!< Polarity select for NCE for GPIO 47                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN47     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN47     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG47_b;
  } ;

  union {
    __IOM uint32_t PINCFG48;                    /*!< Controls the operation of GPIO pin 48.                                    */

    struct {
      __IOM uint32_t FNCSEL48   : 4;            /*!< Function select for GPIO pin 48                                           */
      __IOM uint32_t INPEN48    : 1;            /*!< Input enable for GPIO 48                                                  */
      __IOM uint32_t RDZERO48   : 1;            /*!< Return 0 for read data on GPIO 48                                         */
      __IOM uint32_t IRPTEN48   : 2;            /*!< Interrupt enable for GPIO 48                                              */
      __IOM uint32_t OUTCFG48   : 2;            /*!< Pin IO mode selection for GPIO pin 48                                     */
      __IOM uint32_t DS48       : 2;            /*!< Drive strength selection for GPIO 48                                      */
      __IOM uint32_t SR48       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG48  : 3;            /*!< Pullup/Pulldown configuration for GPIO 48                                 */
      __IOM uint32_t NCESRC48   : 6;            /*!< IOMSTR/MSPI N Chip Select 48, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL48   : 1;            /*!< Polarity select for NCE for GPIO 48                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN48     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN48     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG48_b;
  } ;

  union {
    __IOM uint32_t PINCFG49;                    /*!< Controls the operation of GPIO pin 49.                                    */

