AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t PADKEY     : 32;           /*!< Key register value.                                                       */
    } PADKEY_b;
  } ;

  union {
    __IOM uint32_t RD0;                         /*!< GPIO Input 0 (31-0)                                                       */

    struct {
      __IOM uint32_t RD0        : 32;           /*!< GPIO31-0 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD0_b;
  } ;

  union {
    __IOM uint32_t RD1;                         /*!< GPIO Input 1 (63-32)                                                      */

    struct {
      __IOM uint32_t RD1        : 32;           /*!< GPIO63-32 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD1_b;
  } ;

  union {
    __IOM uint32_t RD2;                         /*!< GPIO Input 2 (95-64)                                                      */

    struct {
      __IOM uint32_t RD2        : 32;           /*!< GPIO95-64 Reads pin state - read only. Returns the pad pin state
                                                     for pins 0-31 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD2_b;
  } ;

  union {
    __IOM uint32_t RD3;                         /*!< GPIO Input 3 (127-96)                                                     */

    struct {
      __IOM uint32_t RD3        : 32;           /*!< GPIO127-96 Reads pin state - read only. Returns the pad pin
                                                     state for pins 0-31 if the PINCFG's input enable (INPEN)
                                                     is active and RDZERO is inactive.                                         */
    } RD3_b;
  } ;

  union {
    __IOM uint32_t WT0;                         /*!< GPIO Output 0 (31-0)                                                      */

    struct {
      __IOM uint32_t WT0        : 32;           /*!< GPIO31-0 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT0_b;
  } ;

  union {
    __IOM uint32_t WT1;                         /*!< GPIO Output 1 (63-32)                                                     */

    struct {
      __IOM uint32_t WT1        : 32;           /*!< GPIO63-32 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT1_b;
  } ;

  union {
    __IOM uint32_t WT2;                         /*!< GPIO Output 2 (95-64)                                                     */

    struct {
      __IOM uint32_t WT2        : 32;           /*!< GPIO95-64 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT2_b;
  } ;

  union {
    __IOM uint32_t WT3;                         /*!< GPIO Output 3 (127-96)                                                    */

    struct {
      __IOM uint32_t WT3        : 32;           /*!< GPIO127-96 Reads or writes pin state. Writes of 1 bits set output
                                                     pad signal if the GPIO is enabled for output. Reads return
                                                     status, including sets/clears through the WTS and WTC registers.          */
    } WT3_b;
  } ;

  union {
    __IOM uint32_t WTS0;                        /*!< GPIO Output Set 0 (31-0)                                                  */

    struct {
      __IOM uint32_t WTS0       : 32;           /*!< GPIO31-0 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS0_b;
  } ;

  union {
    __IOM uint32_t WTS1;                        /*!< GPIO Output Set 1 (63-32)                                                 */

    struct {
      __IOM uint32_t WTS1       : 32;           /*!< GPIO63-32 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS1_b;
  } ;

  union {
    __IOM uint32_t WTS2;                        /*!< GPIO Output Set 2 (95-64)                                                 */

