AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO32 : 1;           /*!< GPIO32 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO33 : 1;           /*!< GPIO33 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO34 : 1;           /*!< GPIO34 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO35 : 1;           /*!< GPIO35 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO36 : 1;           /*!< GPIO36 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO37 : 1;           /*!< GPIO37 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO38 : 1;           /*!< GPIO38 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO39 : 1;           /*!< GPIO39 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO40 : 1;           /*!< GPIO40 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO41 : 1;           /*!< GPIO41 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO42 : 1;           /*!< GPIO42 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO43 : 1;           /*!< GPIO43 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO44 : 1;           /*!< GPIO44 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO45 : 1;           /*!< GPIO45 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO46 : 1;           /*!< GPIO46 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO47 : 1;           /*!< GPIO47 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO48 : 1;           /*!< GPIO48 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO49 : 1;           /*!< GPIO49 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO50 : 1;           /*!< GPIO50 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO51 : 1;           /*!< GPIO51 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO52 : 1;           /*!< GPIO52 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO53 : 1;           /*!< GPIO53 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO54 : 1;           /*!< GPIO54 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO55 : 1;           /*!< GPIO55 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO56 : 1;           /*!< GPIO56 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO57 : 1;           /*!< GPIO57 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO58 : 1;           /*!< GPIO58 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO59 : 1;           /*!< GPIO59 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO60 : 1;           /*!< GPIO60 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO61 : 1;           /*!< GPIO61 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO62 : 1;           /*!< GPIO62 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO63 : 1;           /*!< GPIO63 MCU N1-priority interrupt.                                         */
    } MCUN1INT1STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT1CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN1GPIO32 : 1;           /*!< GPIO32 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO33 : 1;           /*!< GPIO33 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO34 : 1;           /*!< GPIO34 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO35 : 1;           /*!< GPIO35 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO36 : 1;           /*!< GPIO36 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO37 : 1;           /*!< GPIO37 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO38 : 1;           /*!< GPIO38 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO39 : 1;           /*!< GPIO39 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO40 : 1;           /*!< GPIO40 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO41 : 1;           /*!< GPIO41 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO42 : 1;           /*!< GPIO42 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO43 : 1;           /*!< GPIO43 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO44 : 1;           /*!< GPIO44 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO45 : 1;           /*!< GPIO45 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO46 : 1;           /*!< GPIO46 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO47 : 1;           /*!< GPIO47 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO48 : 1;           /*!< GPIO48 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO49 : 1;           /*!< GPIO49 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO50 : 1;           /*!< GPIO50 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO51 : 1;           /*!< GPIO51 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO52 : 1;           /*!< GPIO52 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO53 : 1;           /*!< GPIO53 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO54 : 1;           /*!< GPIO54 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO55 : 1;           /*!< GPIO55 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO56 : 1;           /*!< GPIO56 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO57 : 1;           /*!< GPIO57 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO58 : 1;           /*!< GPIO58 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO59 : 1;           /*!< GPIO59 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO60 : 1;           /*!< GPIO60 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO61 : 1;           /*!< GPIO61 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO62 : 1;           /*!< GPIO62 MCU N1-priority interrupt.                                         */
      __IOM uint32_t MCUN1GPIO63 : 1;           /*!< GPIO63 MCU N1-priority interrupt.                                         */
    } MCUN1INT1CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT1SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

