AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DSP0N0GPIO0 : 1;           /*!< GPIO0 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO1 : 1;           /*!< GPIO1 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO2 : 1;           /*!< GPIO2 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO3 : 1;           /*!< GPIO3 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO4 : 1;           /*!< GPIO4 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO5 : 1;           /*!< GPIO5 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO6 : 1;           /*!< GPIO6 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO7 : 1;           /*!< GPIO7 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO8 : 1;           /*!< GPIO8 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO9 : 1;           /*!< GPIO9 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO10 : 1;          /*!< GPIO10 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO11 : 1;          /*!< GPIO11 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO12 : 1;          /*!< GPIO12 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO13 : 1;          /*!< GPIO13 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO14 : 1;          /*!< GPIO14 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO15 : 1;          /*!< GPIO15 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO16 : 1;          /*!< GPIO16 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO17 : 1;          /*!< GPIO17 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO18 : 1;          /*!< GPIO18 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO19 : 1;          /*!< GPIO19 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO20 : 1;          /*!< GPIO20 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO21 : 1;          /*!< GPIO21 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO22 : 1;          /*!< GPIO22 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO23 : 1;          /*!< GPIO23 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO24 : 1;          /*!< GPIO24 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO25 : 1;          /*!< GPIO25 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO26 : 1;          /*!< GPIO26 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO27 : 1;          /*!< GPIO27 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO28 : 1;          /*!< GPIO28 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO29 : 1;          /*!< GPIO29 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO30 : 1;          /*!< GPIO30 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO31 : 1;          /*!< GPIO31 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT0STAT_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT0CLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP0N0GPIO0 : 1;           /*!< GPIO0 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO1 : 1;           /*!< GPIO1 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO2 : 1;           /*!< GPIO2 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO3 : 1;           /*!< GPIO3 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO4 : 1;           /*!< GPIO4 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO5 : 1;           /*!< GPIO5 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO6 : 1;           /*!< GPIO6 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO7 : 1;           /*!< GPIO7 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO8 : 1;           /*!< GPIO8 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO9 : 1;           /*!< GPIO9 DSP0 N0-priority interrupt.                                         */
      __IOM uint32_t DSP0N0GPIO10 : 1;          /*!< GPIO10 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO11 : 1;          /*!< GPIO11 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO12 : 1;          /*!< GPIO12 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO13 : 1;          /*!< GPIO13 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO14 : 1;          /*!< GPIO14 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO15 : 1;          /*!< GPIO15 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO16 : 1;          /*!< GPIO16 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO17 : 1;          /*!< GPIO17 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO18 : 1;          /*!< GPIO18 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO19 : 1;          /*!< GPIO19 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO20 : 1;          /*!< GPIO20 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO21 : 1;          /*!< GPIO21 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO22 : 1;          /*!< GPIO22 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO23 : 1;          /*!< GPIO23 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO24 : 1;          /*!< GPIO24 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO25 : 1;          /*!< GPIO25 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO26 : 1;          /*!< GPIO26 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO27 : 1;          /*!< GPIO27 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO28 : 1;          /*!< GPIO28 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO29 : 1;          /*!< GPIO29 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO30 : 1;          /*!< GPIO30 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO31 : 1;          /*!< GPIO31 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT0CLR_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT0SET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

