AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DSP0N0GPIO64 : 1;          /*!< GPIO64 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO65 : 1;          /*!< GPIO65 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO66 : 1;          /*!< GPIO66 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO67 : 1;          /*!< GPIO67 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO68 : 1;          /*!< GPIO68 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO69 : 1;          /*!< GPIO69 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO70 : 1;          /*!< GPIO70 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO71 : 1;          /*!< GPIO71 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO72 : 1;          /*!< GPIO72 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO73 : 1;          /*!< GPIO73 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO74 : 1;          /*!< GPIO74 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO75 : 1;          /*!< GPIO75 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO76 : 1;          /*!< GPIO76 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO77 : 1;          /*!< GPIO77 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO78 : 1;          /*!< GPIO78 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO79 : 1;          /*!< GPIO79 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO80 : 1;          /*!< GPIO80 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO81 : 1;          /*!< GPIO81 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO82 : 1;          /*!< GPIO82 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO83 : 1;          /*!< GPIO83 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO84 : 1;          /*!< GPIO84 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO85 : 1;          /*!< GPIO85 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO86 : 1;          /*!< GPIO86 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO87 : 1;          /*!< GPIO87 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO88 : 1;          /*!< GPIO88 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO89 : 1;          /*!< GPIO89 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO90 : 1;          /*!< GPIO90 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO91 : 1;          /*!< GPIO91 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO92 : 1;          /*!< GPIO92 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO93 : 1;          /*!< GPIO93 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO94 : 1;          /*!< GPIO94 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO95 : 1;          /*!< GPIO95 DSP0 N0-priority interrupt.                                        */
    } DSP0N0INT2SET_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT3EN;                /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t DSP0N0GPIO96 : 1;          /*!< GPIO96 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO97 : 1;          /*!< GPIO97 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO98 : 1;          /*!< GPIO98 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO99 : 1;          /*!< GPIO99 DSP0 N0-priority interrupt.                                        */
      __IOM uint32_t DSP0N0GPIO100 : 1;         /*!< GPIO100 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO101 : 1;         /*!< GPIO101 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO102 : 1;         /*!< GPIO102 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO103 : 1;         /*!< GPIO103 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO104 : 1;         /*!< GPIO104 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO105 : 1;         /*!< GPIO105 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO106 : 1;         /*!< GPIO106 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO107 : 1;         /*!< GPIO107 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO108 : 1;         /*!< GPIO108 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO109 : 1;         /*!< GPIO109 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO110 : 1;         /*!< GPIO110 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO111 : 1;         /*!< GPIO111 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO112 : 1;         /*!< GPIO112 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO113 : 1;         /*!< GPIO113 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO114 : 1;         /*!< GPIO114 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO115 : 1;         /*!< GPIO115 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO116 : 1;         /*!< GPIO116 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO117 : 1;         /*!< GPIO117 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO118 : 1;         /*!< GPIO118 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO119 : 1;         /*!< GPIO119 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO120 : 1;         /*!< GPIO120 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO121 : 1;         /*!< GPIO121 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO122 : 1;         /*!< GPIO122 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO123 : 1;         /*!< GPIO123 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO124 : 1;         /*!< GPIO124 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO125 : 1;         /*!< GPIO125 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO126 : 1;         /*!< GPIO126 DSP0 N0-priority interrupt.                                       */
      __IOM uint32_t DSP0N0GPIO127 : 1;         /*!< GPIO127 DSP0 N0-priority interrupt.                                       */
    } DSP0N0INT3EN_b;
  } ;

  union {
    __IOM uint32_t DSP0N0INT3STAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

