AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DSP1N0GPIO32 : 1;          /*!< GPIO32 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO33 : 1;          /*!< GPIO33 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO34 : 1;          /*!< GPIO34 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO35 : 1;          /*!< GPIO35 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO36 : 1;          /*!< GPIO36 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO37 : 1;          /*!< GPIO37 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO38 : 1;          /*!< GPIO38 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO39 : 1;          /*!< GPIO39 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO40 : 1;          /*!< GPIO40 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO41 : 1;          /*!< GPIO41 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO42 : 1;          /*!< GPIO42 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO43 : 1;          /*!< GPIO43 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO44 : 1;          /*!< GPIO44 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO45 : 1;          /*!< GPIO45 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO46 : 1;          /*!< GPIO46 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO47 : 1;          /*!< GPIO47 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO48 : 1;          /*!< GPIO48 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO49 : 1;          /*!< GPIO49 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO50 : 1;          /*!< GPIO50 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO51 : 1;          /*!< GPIO51 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO52 : 1;          /*!< GPIO52 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO53 : 1;          /*!< GPIO53 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO54 : 1;          /*!< GPIO54 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO55 : 1;          /*!< GPIO55 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO56 : 1;          /*!< GPIO56 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO57 : 1;          /*!< GPIO57 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO58 : 1;          /*!< GPIO58 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO59 : 1;          /*!< GPIO59 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO60 : 1;          /*!< GPIO60 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO61 : 1;          /*!< GPIO61 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO62 : 1;          /*!< GPIO62 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO63 : 1;          /*!< GPIO63 DSP1 N0-priority interrupt.                                        */
    } DSP1N0INT1STAT_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT1CLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP1N0GPIO32 : 1;          /*!< GPIO32 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO33 : 1;          /*!< GPIO33 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO34 : 1;          /*!< GPIO34 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO35 : 1;          /*!< GPIO35 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO36 : 1;          /*!< GPIO36 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO37 : 1;          /*!< GPIO37 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO38 : 1;          /*!< GPIO38 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO39 : 1;          /*!< GPIO39 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO40 : 1;          /*!< GPIO40 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO41 : 1;          /*!< GPIO41 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO42 : 1;          /*!< GPIO42 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO43 : 1;          /*!< GPIO43 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO44 : 1;          /*!< GPIO44 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO45 : 1;          /*!< GPIO45 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO46 : 1;          /*!< GPIO46 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO47 : 1;          /*!< GPIO47 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO48 : 1;          /*!< GPIO48 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO49 : 1;          /*!< GPIO49 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO50 : 1;          /*!< GPIO50 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO51 : 1;          /*!< GPIO51 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO52 : 1;          /*!< GPIO52 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO53 : 1;          /*!< GPIO53 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO54 : 1;          /*!< GPIO54 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO55 : 1;          /*!< GPIO55 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO56 : 1;          /*!< GPIO56 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO57 : 1;          /*!< GPIO57 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO58 : 1;          /*!< GPIO58 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO59 : 1;          /*!< GPIO59 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO60 : 1;          /*!< GPIO60 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO61 : 1;          /*!< GPIO61 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO62 : 1;          /*!< GPIO62 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO63 : 1;          /*!< GPIO63 DSP1 N0-priority interrupt.                                        */
    } DSP1N0INT1CLR_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT1SET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

