AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DSP1N0GPIO96 : 1;          /*!< GPIO96 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO97 : 1;          /*!< GPIO97 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO98 : 1;          /*!< GPIO98 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO99 : 1;          /*!< GPIO99 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO100 : 1;         /*!< GPIO100 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO101 : 1;         /*!< GPIO101 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO102 : 1;         /*!< GPIO102 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO103 : 1;         /*!< GPIO103 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO104 : 1;         /*!< GPIO104 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO105 : 1;         /*!< GPIO105 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO106 : 1;         /*!< GPIO106 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO107 : 1;         /*!< GPIO107 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO108 : 1;         /*!< GPIO108 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO109 : 1;         /*!< GPIO109 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO110 : 1;         /*!< GPIO110 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO111 : 1;         /*!< GPIO111 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO112 : 1;         /*!< GPIO112 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO113 : 1;         /*!< GPIO113 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO114 : 1;         /*!< GPIO114 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO115 : 1;         /*!< GPIO115 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO116 : 1;         /*!< GPIO116 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO117 : 1;         /*!< GPIO117 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO118 : 1;         /*!< GPIO118 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO119 : 1;         /*!< GPIO119 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO120 : 1;         /*!< GPIO120 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO121 : 1;         /*!< GPIO121 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO122 : 1;         /*!< GPIO122 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO123 : 1;         /*!< GPIO123 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO124 : 1;         /*!< GPIO124 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO125 : 1;         /*!< GPIO125 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO126 : 1;         /*!< GPIO126 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO127 : 1;         /*!< GPIO127 DSP1 N0-priority interrupt.                                       */
    } DSP1N0INT3STAT_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT3CLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t DSP1N0GPIO96 : 1;          /*!< GPIO96 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO97 : 1;          /*!< GPIO97 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO98 : 1;          /*!< GPIO98 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO99 : 1;          /*!< GPIO99 DSP1 N0-priority interrupt.                                        */
      __IOM uint32_t DSP1N0GPIO100 : 1;         /*!< GPIO100 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO101 : 1;         /*!< GPIO101 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO102 : 1;         /*!< GPIO102 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO103 : 1;         /*!< GPIO103 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO104 : 1;         /*!< GPIO104 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO105 : 1;         /*!< GPIO105 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO106 : 1;         /*!< GPIO106 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO107 : 1;         /*!< GPIO107 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO108 : 1;         /*!< GPIO108 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO109 : 1;         /*!< GPIO109 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO110 : 1;         /*!< GPIO110 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO111 : 1;         /*!< GPIO111 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO112 : 1;         /*!< GPIO112 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO113 : 1;         /*!< GPIO113 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO114 : 1;         /*!< GPIO114 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO115 : 1;         /*!< GPIO115 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO116 : 1;         /*!< GPIO116 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO117 : 1;         /*!< GPIO117 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO118 : 1;         /*!< GPIO118 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO119 : 1;         /*!< GPIO119 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO120 : 1;         /*!< GPIO120 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO121 : 1;         /*!< GPIO121 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO122 : 1;         /*!< GPIO122 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO123 : 1;         /*!< GPIO123 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO124 : 1;         /*!< GPIO124 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO125 : 1;         /*!< GPIO125 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO126 : 1;         /*!< GPIO126 DSP1 N0-priority interrupt.                                       */
      __IOM uint32_t DSP1N0GPIO127 : 1;         /*!< GPIO127 DSP1 N0-priority interrupt.                                       */
    } DSP1N0INT3CLR_b;
  } ;

  union {
    __IOM uint32_t DSP1N0INT3SET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

