AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DSP1N1GPIO96 : 1;          /*!< GPIO96 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO97 : 1;          /*!< GPIO97 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO98 : 1;          /*!< GPIO98 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO99 : 1;          /*!< GPIO99 DSP1 N1-priority interrupt.                                        */
      __IOM uint32_t DSP1N1GPIO100 : 1;         /*!< GPIO100 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO101 : 1;         /*!< GPIO101 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO102 : 1;         /*!< GPIO102 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO103 : 1;         /*!< GPIO103 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO104 : 1;         /*!< GPIO104 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO105 : 1;         /*!< GPIO105 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO106 : 1;         /*!< GPIO106 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO107 : 1;         /*!< GPIO107 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO108 : 1;         /*!< GPIO108 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO109 : 1;         /*!< GPIO109 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO110 : 1;         /*!< GPIO110 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO111 : 1;         /*!< GPIO111 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO112 : 1;         /*!< GPIO112 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO113 : 1;         /*!< GPIO113 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO114 : 1;         /*!< GPIO114 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO115 : 1;         /*!< GPIO115 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO116 : 1;         /*!< GPIO116 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO117 : 1;         /*!< GPIO117 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO118 : 1;         /*!< GPIO118 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO119 : 1;         /*!< GPIO119 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO120 : 1;         /*!< GPIO120 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO121 : 1;         /*!< GPIO121 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO122 : 1;         /*!< GPIO122 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO123 : 1;         /*!< GPIO123 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO124 : 1;         /*!< GPIO124 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO125 : 1;         /*!< GPIO125 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO126 : 1;         /*!< GPIO126 DSP1 N1-priority interrupt.                                       */
      __IOM uint32_t DSP1N1GPIO127 : 1;         /*!< GPIO127 DSP1 N1-priority interrupt.                                       */
    } DSP1N1INT3SET_b;
  } ;
} GPIO_Type;                                    /*!< Size = 1088 (0x440)                                                       */



/* =========================================================================================================================== */
/* ================                                            GPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Graphics Processing Unit (GPU)
  */

typedef struct {                                /*!< GPU Structure                                                             */

  union {
    __IOM uint32_t TEX0BASE;                    /*!< Base address of the drawing surface 0 (must be word aligned).             */

    struct {
      __IOM uint32_t Base       : 32;           /*!< Address 0: base address of the drawing surface 0 (must be word
                                                     aligned).                                                                 */
    } TEX0BASE_b;
  } ;

  union {
    __IOM uint32_t TEX0STRIDE;                  /*!< Image 0 mode and stride.                                                  */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< image stride (signed) distance in bytes from one scanline to
                                                     another                                                                   */
      __IOM uint32_t IMGMODE    : 8;            /*!< Image Mode                                                                */
      __IOM uint32_t IMGFMT     : 8;            /*!< Image Format                                                              */
    } TEX0STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX0RES;                     /*!< Image 0 resolution.                                                       */

