AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t RESX       : 16;           /*!< resolution X size                                                         */
      __IOM uint32_t RESY       : 16;           /*!< resolution Y size                                                         */
    } TEX0RES_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t TEX1BASE;                    /*!< Base address of the drawing surface 1 (must be word aligned).             */

    struct {
      __IOM uint32_t Base       : 32;           /*!< address 1: base address of the drawing surface 1 (must be word
                                                     aligned).                                                                 */
    } TEX1BASE_b;
  } ;

  union {
    __IOM uint32_t TEX1STRIDE;                  /*!< Image 1 mode and stride.                                                  */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< image stride (signed) distance in bytes from one scanline to
                                                     another                                                                   */
      __IOM uint32_t IMGMODE    : 8;            /*!< Image Mode                                                                */
      __IOM uint32_t IMGFMT     : 8;            /*!< Image Format                                                              */
    } TEX1STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX1RES;                     /*!< Image 1 resolution.                                                       */

    struct {
      __IOM uint32_t RESX       : 16;           /*!< resolution X size                                                         */
      __IOM uint32_t RESY       : 16;           /*!< resolution Y size                                                         */
    } TEX1RES_b;
  } ;

  union {
    __IOM uint32_t TEX1COLOR;                   /*!< Texture maps default color.Used with luminance and alpha-only
                                                     color formats.                                                            */

    struct {
      __IOM uint32_t RED        : 8;            /*!< red value                                                                 */
      __IOM uint32_t GREEN      : 8;            /*!< green value                                                               */
      __IOM uint32_t BLUE       : 8;            /*!< blue value                                                                */
      __IOM uint32_t ALPHA      : 8;            /*!< alpha value                                                               */
    } TEX1COLOR_b;
  } ;

  union {
    __IOM uint32_t TEX2BASE;                    /*!< Base address of the drawing surface 2 (must be word aligned).             */

    struct {
      __IOM uint32_t Drawing    : 32;           /*!< surface 2 Base address of the drawing surface 2                           */
    } TEX2BASE_b;
  } ;

  union {
    __IOM uint32_t TEX2STRIDE;                  /*!< Image 2 mode and stride.                                                  */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< image stride (signed) distance in bytes from one scanline to
                                                     another                                                                   */
      __IOM uint32_t IMGMODE    : 8;            /*!< image mode                                                                */
      __IOM uint32_t IMGFMT     : 8;            /*!< image format                                                              */
    } TEX2STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX2RES;                     /*!< Image 2 resolution.                                                       */

    struct {
      __IOM uint32_t RESX       : 16;           /*!< resolution X size                                                         */
      __IOM uint32_t RESY       : 16;           /*!< resolution Y size                                                         */
    } TEX2RES_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t TEX3BASE;                    /*!< Base address of the drawing surface 3 (must be word aligned).             */

    struct {
      __IOM uint32_t Image      : 32;           /*!< 3 Base address of the drawing surface                                     */
    } TEX3BASE_b;
  } ;

  union {
    __IOM uint32_t TEX3STRIDE;                  /*!< mode and stride.                                                          */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< image stride (signed) distance in bytes from one scanline to
                                                     another                                                                   */
      __IOM uint32_t IMGMODE    : 8;            /*!< image mode                                                                */
      __IOM uint32_t IMGFMT     : 8;            /*!< image format                                                              */
    } TEX3STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX3RES;                     /*!< Image 3 resolution.                                                       */

    struct {
      __IOM uint32_t RESX       : 16;           /*!< resolution X size                                                         */
      __IOM uint32_t RESY       : 16;           /*!< resolution Y size                                                         */
    } TEX3RES_b;
  } ;
  __IM  uint32_t  RESERVED2[21];

  union {
    __IOM uint32_t CGCMD;                       /*!< Clock gating enable                                                       */

    struct {
      __IOM uint32_t STOP       : 1;            /*!< stop clock                                                                */
      __IOM uint32_t START      : 1;            /*!< start clock                                                               */
            uint32_t            : 30;
    } CGCMD_b;
  } ;

  union {
    __IOM uint32_t CGCTRL;                      /*!< CGCTRL register description needed here.                                  */

