AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DISCLKPROC : 1;            /*!< disable clock gating for command list processor                           */
      __IOM uint32_t DISCLKCFG  : 1;            /*!< disable clock gating for configuration file                               */
      __IOM uint32_t DISCLKFRAME : 2;           /*!< disable clock gating for framebuffer 0 (MISTAKE ?)                        */
      __IOM uint32_t RSVD0      : 19;           /*!< This bitfield is reserved.                                                */
      __IOM uint32_t DISCLKCORE : 1;            /*!< disable clock gating for core 0                                           */
      __IOM uint32_t RSVD1      : 6;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t DISCLKMOD  : 2;            /*!< disable clock gating for all modules (MISTAKE ?)                          */
    } CGCTRL_b;
  } ;

  union {
    __IOM uint32_t DIRTYTRIGMIN;                /*!< Resets dirty region to resolution size when written.                      */

    struct {
      __IOM uint32_t DRTYREG    : 32;           /*!< Resets dirty region to resolution size when written.                      */
    } DIRTYTRIGMIN_b;
  } ;

  union {
    __IOM uint32_t DIRTYTRIGMAX;                /*!< Resets dirty region to resolution size when written.                      */

    struct {
      __IOM uint32_t DRTYREG    : 32;           /*!< Resets dirty region to resolution size when written.                      */
    } DIRTYTRIGMAX_b;
  } ;
  __IM  uint32_t  RESERVED3[4];

  union {
    __IOM uint32_t STATUS;                      /*!< On read, returns GPU status (CHECK address!!).                            */

    struct {
      __IOM uint32_t COREBSY    : 4;            /*!< processing core busy (Cores 3-0)                                          */
      __IOM uint32_t PIPEBSY    : 4;            /*!< pipeline busy (Cores 3-0)                                                 */
      __IOM uint32_t TEXTMAPBSY : 4;            /*!< texture map busy (Cores 3-0)                                              */
      __IOM uint32_t RENDERBSY  : 4;            /*!< render output unit busy (Cores 3-0)                                       */
      __IOM uint32_t DEPTHFIFOBSY : 4;          /*!< depth buffer busy (Cores 3-0)                                             */
            uint32_t            : 4;
      __IOM uint32_t RASTBSY    : 4;            /*!< rasterizer busy                                                           */
      __IOM uint32_t CLPBSY     : 1;            /*!< command list processor busy                                               */
      __IOM uint32_t CLBSY      : 1;            /*!< command list bus busy                                                     */
      __IOM uint32_t MEMBSY     : 1;            /*!< memory system busy                                                        */
      __IOM uint32_t SYSBSY     : 1;            /*!< system busy                                                               */
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED4[3];

  union {
    __IOM uint32_t BUSCTRL;                     /*!< Bus Control                                                               */

    struct {
      __IOM uint32_t BUSCTRL    : 32;           /*!< Bus Control                                                               */
    } BUSCTRL_b;
  } ;

  union {
    __IOM uint32_t IMEMLDIADDR;                 /*!< Load shader instruction memory address.                                   */

    struct {
      __IOM uint32_t IMEM       : 32;           /*!< ADDR Load shader. Load shader instruction memory address.                 */
    } IMEMLDIADDR_b;
  } ;

  union {
    __IOM uint32_t IMEMLDIDATAHL;               /*!< Load shader instruction Memory data (31:0).                               */

    struct {
      __IOM uint32_t IMEM       : 32;           /*!< DATA Load shader. Load shader instruction Memory data (31:0).             */
    } IMEMLDIDATAHL_b;
  } ;

  union {
    __IOM uint32_t IMEMLDIDATAHH;               /*!< Load shader instruction Memory data (63:32).                              */

    struct {
      __IOM uint32_t IMEM       : 32;           /*!< DATA Load shader. Load shader instruction Memory data (63:32).            */
    } IMEMLDIDATAHH_b;
  } ;
  __IM  uint32_t  RESERVED5[6];

  union {
    __IOM uint32_t CMDLISTSTATUS;               /*!< On read, returns command list processor status; On write, resets
                                                     command list processor.                                                   */

    struct {
      __IOM uint32_t LIST       : 1;            /*!< processor status                                                          */
            uint32_t            : 31;
    } CMDLISTSTATUS_b;
  } ;

  union {
    __IOM uint32_t CMDLISTRINGSTOP;             /*!< Updates GPU command list pointer to stop executing.                       */

    struct {
      __IOM uint32_t UPDATEPRT  : 32;           /*!< Updates GPU command list pointer to stop executing.                       */
    } CMDLISTRINGSTOP_b;
  } ;

  union {
    __IOM uint32_t CMDLISTADDR;                 /*!< Command list base pointer.                                                */

    struct {
      __IOM uint32_t BASEPTR    : 32;           /*!< Command list base pointer.                                                */
    } CMDLISTADDR_b;
  } ;

  union {
    __IOM uint32_t CMDLISTSIZE;                 /*!< Command list length in words.                                             */

    struct {
      __IOM uint32_t LISTWORDS  : 32;           /*!< Command list length in words.                                             */
    } CMDLISTSIZE_b;
  } ;

  union {
    __IOM uint32_t INTERRUPTCTRL;               /*!< On write, clears the IRQ (CHECK address!).                                */

    struct {
      __IOM uint32_t IRQACTIVE  : 1;            /*!< if set to zero IRQ is active high, if set to one IRQ is active
                                                     low                                                                       */
      __IOM uint32_t INTCMDEND  : 1;            /*!< if set, signals interrupt at the end of command list                      */
      __IOM uint32_t INTDRAWEND : 1;            /*!< if set, signals interrupt at the end of drawing command                   */
      __IOM uint32_t AUTOCLR    : 1;            /*!< if set, auto clears interrupt                                             */
      __IOM uint32_t RSVD       : 26;           /*!< This bitfield is reserved.                                                */
      __IOM uint32_t CHANGEFREQ : 2;            /*!< change frequency of asynchronous clock                                    */
    } INTERRUPTCTRL_b;
  } ;

  union {
    __IOM uint32_t SYSCLEAR;                    /*!< On write, resets the GPU (CHECK address!).                                */

