AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t XAXISLO    : 32;           /*!< Added depth value for each step at x-axis                                 */
    } DEPTHDXL_b;
  } ;

  union {
    __IOM uint32_t DEPTHDXH;                    /*!< Added depth value for each step at x-axis (32 high bits integral.)        */

    struct {
      __IOM uint32_t XAXISHI    : 32;           /*!< Added depth value for each step at x-axis                                 */
    } DEPTHDXH_b;
  } ;

  union {
    __IOM uint32_t DEPTHDYL;                    /*!< Added depth value for each step at y-axis (32 low bits fractional.)       */

    struct {
      __IOM uint32_t YAXISLO    : 32;           /*!< Added depth value for each step at y-axis                                 */
    } DEPTHDYL_b;
  } ;

  union {
    __IOM uint32_t DEPTHDYH;                    /*!< Added depth value for each step at y-axis (32 high bits integral.)        */

    struct {
      __IOM uint32_t YAXISHI    : 32;           /*!< Added depth value for each step at y-axis                                 */
    } DEPTHDYH_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t REDX;                        /*!< Added red value for each step at x-axis, (16, 16 fixed point)             */

    struct {
      __IOM uint32_t REDX       : 32;           /*!< Added red value for each step at x-axis                                   */
    } REDX_b;
  } ;

  union {
    __IOM uint32_t REDY;                        /*!< Added red value for each step at y-axis, (16, 16 fixed point)             */

    struct {
      __IOM uint32_t REDY       : 32;           /*!< red value for each step at y-axis                                         */
    } REDY_b;
  } ;

  union {
    __IOM uint32_t GREENX;                      /*!< Added green value for each step at x-axis, (16, 16 fixed point)           */

    struct {
      __IOM uint32_t GREENX     : 32;           /*!< Added green value for each step at x-axis                                 */
    } GREENX_b;
  } ;

  union {
    __IOM uint32_t GREENY;                      /*!< Added green value for each step at y-axis, (16, 16 fixed point)           */

    struct {
      __IOM uint32_t GREENY     : 32;           /*!< Added green value for each step at y-axis                                 */
    } GREENY_b;
  } ;

  union {
    __IOM uint32_t BLUEX;                       /*!< Added blue value for each step at x-axis, (16, 16 fixed point)            */

    struct {
      __IOM uint32_t BLUEX      : 32;           /*!< Added blue value for each step at x-axis                                  */
    } BLUEX_b;
  } ;

  union {
    __IOM uint32_t BLUEY;                       /*!< Added blue value for each step at y-axis, (16, 16 fixed point)            */

    struct {
      __IOM uint32_t BLUEY      : 32;           /*!< Added blue value for each step at y-axis                                  */
    } BLUEY_b;
  } ;

  union {
    __IOM uint32_t ALFX;                        /*!< Added alfa value for each step at x-axis, (16, 16 fixed point)            */

    struct {
      __IOM uint32_t ALFX       : 32;           /*!< Added alfa value for each step at x-axis                                  */
    } ALFX_b;
  } ;

  union {
    __IOM uint32_t ALFY;                        /*!< Added alfa value for each step at y-axis, (16, 16 fixed point)            */

    struct {
      __IOM uint32_t ALFY       : 32;           /*!< Added alfa value for each step at y-axis                                  */
    } ALFY_b;
  } ;

  union {
    __IOM uint32_t REDINIT;                     /*!< Red value of STARTXY pixel, (16, 16 fixed point)                          */

    struct {
      __IOM uint32_t REDXY      : 32;           /*!< Red value of STARTXY pixel                                                */
    } REDINIT_b;
  } ;

  union {
    __IOM uint32_t GREINIT;                     /*!< Green value of STARTXY pixel, (16, 16 fixed point)                        */

    struct {
      __IOM uint32_t GREENXY    : 32;           /*!< Green value of STARTXY pixel                                              */
    } GREINIT_b;
  } ;

  union {
    __IOM uint32_t BLUINIT;                     /*!< Blue value of STARTXY pixel, (16, 16 fixed point)                         */

    struct {
      __IOM uint32_t BLUEXY     : 32;           /*!< Blue value of STARTXY pixel                                               */
    } BLUINIT_b;
  } ;

  union {
    __IOM uint32_t ALFINIT;                     /*!< Alfa value of STARTXY pixel, (16, 16 fixed point) Shader Registers        */

    struct {
      __IOM uint32_t ALFXY      : 32;           /*!< Alfa value of STARTXY pixel                                               */
    } ALFINIT_b;
  } ;
  __IM  uint32_t  RESERVED11[7];

  union {
    __IOM uint32_t IDREG;                       /*!< Fixed value                                                               */

    struct {
      __IOM uint32_t GPUID      : 32;           /*!< Fixed value for GPU ID                                                    */
    } IDREG_b;
  } ;

  union {
    __IOM uint32_t LOADCTRL;                    /*!< Load Control                                                              */

    struct {
      __IOM uint32_t LOADCTRL   : 32;           /*!< Load Control                                                              */
    } LOADCTRL_b;
  } ;
  __IM  uint32_t  RESERVED12[3];

  union {
    __IOM uint32_t C0REG;                       /*!< Shader constant register 0.                                               */

    struct {
      __IOM uint32_t C0SHADER   : 32;           /*!< Shader constant register 0.                                               */
    } C0REG_b;
  } ;

  union {
    __IOM uint32_t C1REG;                       /*!< Shader constant register 1.                                               */

    struct {
      __IOM uint32_t C1SHADER   : 32;           /*!< Shader constant register 1.                                               */
    } C1REG_b;
  } ;

  union {
    __IOM uint32_t C2REG;                       /*!< Shader constant register 2.                                               */

