AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t TXTARGADDR : 32;           /*!< Address bits of the target byte address for source of TX write
                                                     DMA.                                                                      */
    } TXDMAADDR_b;
  } ;

  union {
    __IOM uint32_t TXDMASTAT;                   /*!< Status of the TX DMA operation currently in progress.                     */

    struct {
      __IOM uint32_t TXDMATIP   : 1;            /*!< TX DMA Transfer In Progress indicator. 1 will indicate that
                                                     a DMA transfer is active. The DMA transfer may be waiting
                                                     on data, transferring data, or waiting for priority.All
                                                     of these will be indicated with a 1. A 0 will indicate
                                                     that the DMA is fully complete and no further transactions
                                                     will be done. This bit is read only.                                      */
      __IOM uint32_t TXDMACPL   : 1;            /*!< TX DMA Transfer Complete. This signals the end of the DMA operation.
                                                     This bit can be cleared by writing to 0, and will also
                                                     be cleared when a new DMA is started.                                     */
      __IOM uint32_t TXDMAERR   : 1;            /*!< TX DMA Error. This active high bit signals an error was encountered
                                                     during the DMA operation. The bit can be cleared by writing
                                                     to 0. Once set, this bit will remain set until cleared
                                                     by software.                                                              */
            uint32_t            : 29;
    } TXDMASTAT_b;
  } ;
  __IM  uint32_t  RESERVED4[5];

  union {
    __IOM uint32_t STATUS;                      /*!< I2S Module Status                                                         */

    struct {
      __IOM uint32_t TBD        : 1;            /*!< To Be determined.                                                         */
            uint32_t            : 31;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED5[51];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t IPB        : 1;            /*!< Interrupt from I2S module                                                 */
      __IOM uint32_t RXREQCNT   : 1;            /*!< The I2S module has completed RXREQCNT number of DMA transfers
                                                     of size 8 samples. This interrupt allows servicing of buffers
                                                     at a programmable location within the overall DMA transfer.               */
      __IOM uint32_t TXREQCNT   : 1;            /*!< The I2S module has asserted the dma read request, based on TX
                                                     fifo level.                                                               */
      __IOM uint32_t TXDMACPL   : 1;            /*!< A TX dma operation has completed                                          */
      __IOM uint32_t RXDMACPL   : 1;            /*!< A RX dma operation has completed                                          */
            uint32_t            : 27;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

