AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t FIFORTHR   : 6;            /*!< FIFO read threshold in bytes. A value of 0 will disable the
                                                     read FIFO level from activating the threshold interrupt.
                                                     If this field is non-zero, it will trigger a threshold
                                                     interrupt when the read fifo contains FIFORTHR valid bytes
                                                     of data, as indicated by the FIFO1SIZ field. This is intended
                                                     to signal when a data transfer of FIFORTHR bytes can be
                                                     done from the IOM module to the host via the read fifo
                                                     to support large IOM read operations.                                     */
            uint32_t            : 2;
      __IOM uint32_t FIFOWTHR   : 6;            /*!< FIFO write threshold in bytes. A value of 0 will disable the
                                                     write FIFO level from activating the threshold interrupt.
                                                     If this field is non-zero, it will trigger a threshold
                                                     interrupt when the write fifo contains FIFOWTHR free bytes,
                                                     as indicated by the FIFO0REM field. This is intended to
                                                     signal when a transfer of FIFOWTHR bytes can be done from
                                                     the host to the IOM write fifo to support large IOM write
                                                     operations.                                                               */
            uint32_t            : 18;
    } FIFOTHR_b;
  } ;

  union {
    __IOM uint32_t FIFOPOP;                     /*!< Will advance the internal read pointer of the incoming FIFO
                                                     (FIFO1) when read, if POPWR is not active. If POPWR is
                                                     active, a write to this register is needed to advance the
                                                     internal FIFO pointer.                                                    */

    struct {
      __IOM uint32_t FIFODOUT   : 32;           /*!< This register will return the read data indicated by the current
                                                     read pointer on reads. If the POPWR control bit in the
                                                     FIFOCTRL register is reset (0), the fifo read pointer will
                                                     be advanced by one word as a result of the read.If the
                                                     POPWR bit is set (1), the fifo read pointer will only be
                                                     advanced after a write operation to this register. The
                                                     write data is ignored for this register.If less than a
                                                     even word multiple is available, and the command is completed,
                                                     the module will return the word containing these bytes
                                                     and undetermined data in the unused fields of the word.                   */
    } FIFOPOP_b;
  } ;

  union {
    __IOM uint32_t FIFOPUSH;                    /*!< Will write new data into the outgoing FIFO and advance the internal
                                                     write pointer.                                                            */

    struct {
      __IOM uint32_t FIFODIN    : 32;           /*!< This register is used to write the FIFORAM in FIFO mode and
                                                     will cause a push event to occur to the next open slot
                                                     within the FIFORAM. Writing to this register will cause
                                                     the write point to increment by 1 word(4 bytes).                          */
    } FIFOPUSH_b;
  } ;

  union {
    __IOM uint32_t FIFOCTRL;                    /*!< Provides controls for the operation of the internal FIFOs. Contains
                                                     fields used to control the operation of the POP register,
                                                     and also controls to reset the internal pointers of the
                                                     FIFOs.                                                                    */

    struct {
      __IOM uint32_t POPWR      : 1;            /*!< Selects the mode in which 'pop' events are done for the fifo
                                                     read operations. A value of '1' will prevent a pop event
                                                     on a read operation, and will require a write to the FIFOPOP
                                                     register to create a pop event.A value of '0' in this register
                                                     will allow a pop event to occur on the read of the FIFOPOP
                                                     register, and may cause inadvertant fifo pops when used
                                                     in a debugging mode.                                                      */
      __IOM uint32_t FIFORSTN   : 1;            /*!< Active low manual reset of the fifo. Write to 0 to reset fifo,
                                                     and then write to 1 to remove the reset.                                  */
            uint32_t            : 30;
    } FIFOCTRL_b;
  } ;

  union {
    __IOM uint32_t FIFOLOC;                     /*!< Provides a read only value of the current read and write pointers.
                                                     This register is read only and can be used alogn with the
                                                     FIFO direct access method to determine the next data to
                                                     be used for input and output functions.                                   */

