AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t CORELDOACTIVETRIM : 10;    /*!< CORE LDO active trim                                                      */
      __IOM uint32_t CORELDOTEMPCOTRIM : 4;     /*!< CORE LDO TEMPCO trim                                                      */
      __IOM uint32_t CORELDOLPTRIM : 6;         /*!< CORE LDO Low Power Trim                                                   */
      __IOM uint32_t CORELDOIBIASTRIM : 1;      /*!< CORE LDO IBIAS Trim                                                       */
      __IOM uint32_t CORELDOIBIASSEL : 1;       /*!< Core LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect.                                           */
            uint32_t            : 10;
    } LDOREG1_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t LDOREG2;                     /*!< MEMLDO and MEMLPLDO Trims                                                 */

    struct {
      __IOM uint32_t MEMLDOACTIVETRIM : 6;      /*!< MEM LDO active trim                                                       */
      __IOM uint32_t MEMLDOLPTRIM : 6;          /*!< MEM LDO LP trim                                                           */
      __IOM uint32_t MEMLDOLPALTTRIM : 6;       /*!< MEM LDO TRIM LP ALT SET                                                   */
      __IOM uint32_t MEMLPLDOTRIM : 6;          /*!< MEM LPLDO TRIM                                                            */
      __IOM uint32_t MEMLPLDOIBIASTRIM : 1;     /*!< Mem LPLDO IBIAS trim                                                      */
      __IOM uint32_t MEMLDOIBIASSEL : 1;        /*!< Mem LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect.                                           */
      __IOM uint32_t TRIMANALDO : 4;            /*!< Analog LDO Trim.                                                          */
            uint32_t            : 2;
    } LDOREG2_b;
  } ;
  __IM  uint32_t  RESERVED6[14];

  union {
    __IOM uint32_t HFRC2;                       /*!< HFRC2 Control                                                             */

    struct {
            uint32_t            : 11;
      __IOM uint32_t HF2TUNE    : 11;           /*!< Default HFRC2 frequency tune value                                        */
            uint32_t            : 10;
    } HFRC2_b;
  } ;
  __IM  uint32_t  RESERVED7[6];

  union {
    __IOM uint32_t LFRC;                        /*!< LFRC Control                                                              */

    struct {
      __IOM uint32_t LFRCSWE    : 1;            /*!< LFRC Software Override Enable.                                            */
      __IOM uint32_t TRIMTUNELFRC : 5;          /*!< LFRC Frequency Tune trim bits                                             */
      __IOM uint32_t PWDLFRC    : 1;            /*!< Power Down LFRC.                                                          */
      __IOM uint32_t RESETLFRC  : 1;            /*!< LFRC Reset.                                                               */
      __IOM uint32_t LFRCITAILTRIM : 2;         /*!< LFRC ITAIL trim                                                           */
      __IOM uint32_t LFRCSIMOCLKDIV : 3;        /*!< SIMOBUCK LP mode clock divider                                            */
            uint32_t            : 19;
    } LFRC_b;
  } ;
  __IM  uint32_t  RESERVED8[7];

  union {
    __IOM uint32_t BODCTRL;                     /*!< BOD control                                                               */

    struct {
      __IOM uint32_t BODLPWD    : 1;            /*!< BODL Power Down.                                                          */
      __IOM uint32_t BODHPWD    : 1;            /*!< BODH Power Down.                                                          */
      __IOM uint32_t BODCPWD    : 1;            /*!< BODC Power Down.                                                          */
      __IOM uint32_t BODFPWD    : 1;            /*!< BODF Power Down.                                                          */
      __IOM uint32_t BODSPWD    : 1;            /*!< BODS Power Down.                                                          */
      __IOM uint32_t BODCLVPWD  : 1;            /*!< BODC_LV Power Down.                                                       */
      __IOM uint32_t BODLVREFSEL : 1;           /*!< BODL External Reference Select. Note: the SWE mux select in
                                                     PWRSEQ2SWE must be set for this to take effect.                           */
      __IOM uint32_t BODHVREFSEL : 1;           /*!< BODH External Reference Select. Note: the SWE mux select in
                                                     PWRSEQ2SWE must be set for this to take effect.                           */
            uint32_t            : 24;
    } BODCTRL_b;
  } ;

  union {
    __IOM uint32_t ADCPWRDLY;                   /*!< ADC Power Up Delay Control                                                */

    struct {
      __IOM uint32_t ADCPWR0    : 8;            /*!< Additional delay time for ADC Reference Buffer settling time
                                                     in 64x ADC clock increments. Delay = 64*ADCPWR0*ADC_CLK.                  */
      __IOM uint32_t ADCPWR1    : 8;            /*!< Delay time for ADC Reference Buffer settling time in 64x ADC
                                                     clock increments. Delay = 64*ADCPWR1*ADC_CLK                              */
            uint32_t            : 16;
    } ADCPWRDLY_b;
  } ;

  union {
    __IOM uint32_t ADCPWRCTRL;                  /*!< ADC Power Control                                                         */

    struct {
      __IOM uint32_t ADCPWRCTRLSWE : 1;         /*!< ADC Power Control Software Override Enable                                */
      __IOM uint32_t ADCAPSEN   : 1;            /*!< Enable the Global ADC Power Switch on when set to 1 if the ADCPWRCTRLSWE
                                                     bit is set.                                                               */
      __IOM uint32_t ADCBPSEN   : 1;            /*!< Enable the Analog, IO and SAR Digital logic Power Switch on
                                                     when set to 1 if the ADCPWRCTRLSWE bit is set.                            */
      __IOM uint32_t BGTPEN     : 1;            /*!< Bandgap and Temperature Sensor Power Switch Enable                        */
      __IOM uint32_t BGTLPPEN   : 1;            /*!< Bandgap and Temperature Sensor Power Switch Enable                        */
      __IOM uint32_t REFBUFPEN  : 1;            /*!< Reference Buffer Power Switch Enable                                      */
      __IOM uint32_t REFKEEPPEN : 1;            /*!< Reference Buffer Keeper Power Switch Enable                               */
      __IOM uint32_t VDDADCSARISOLATE : 1;      /*!< ISOLATE signal for Power Switched SAR ( when ADCBPSEN is switched
                                                     off )                                                                     */
      __IOM uint32_t VDDADCDIGISOLATE : 1;      /*!< ISOLATE signal for ADC Digital Contoller ( when ADCAPSEN is
                                                     switched off and if the ADCPWRCTRLSWE bit is set)                         */
      __IOM uint32_t VDDADCRESETN : 1;          /*!< RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the ADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t ADCVBATDIVEN : 1;          /*!< ADC VBAT DIV Power Enable ( if the ADCPWRCTRLSWE bit is set
                                                     )                                                                         */
      __IOM uint32_t ADCINBUFSEL : 2;           /*!< ADC input buffer mux select                                               */
      __IOM uint32_t ADCINBUFEN : 1;            /*!< ADC Input Buffer Power Enable ( if the ADCPWRCTRLSWE bit is
                                                     set )                                                                     */
      __IOM uint32_t ADCRFBUFSLWEN : 1;         /*!< ADC reference buffer slew enable                                          */
      __IOM uint32_t ADCKEEPOUTEN : 1;          /*!< ADC reference keeper out en                                               */
            uint32_t            : 15;
    } ADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t ADCCAL;                      /*!< ADC Calibration Control                                                   */

