AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t SCRATCH1   : 32;           /*!< Scratch register 1.                                                       */
    } SCRATCH1_b;
  } ;
  __IM  uint32_t  RESERVED13[14];

  union {
    __IOM uint32_t DBGR1;                       /*!< Read-only debug 1                                                         */

    struct {
      __IOM uint32_t ONETO8     : 32;           /*!< Read-only register for communication validation                           */
    } DBGR1_b;
  } ;

  union {
    __IOM uint32_t DBGR2;                       /*!< Read-only debug 2                                                         */

    struct {
      __IOM uint32_t COOLCODE   : 32;           /*!< Read-only register for communication validation                           */
    } DBGR2_b;
  } ;
  __IM  uint32_t  RESERVED14[6];

  union {
    __IOM uint32_t PMUENABLE;                   /*!< Control bit to enable/disable the PMU                                     */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< PMU Enable Control bit. When set, the MCU's PMU will place the
                                                     MCU into the lowest power consuming Deep Sleep mode upon
                                                     execution of a WFI instruction (dependent on the setting
                                                     of the SLEEPDEEP bit in the ARM SCR register). When cleared,
                                                     regardless of the requested sleep mode, the PMU will not
                                                     enter the lowest power Deep Sleep mode, instead entering
                                                     the Sleep mode.                                                           */
            uint32_t            : 31;
    } PMUENABLE_b;
  } ;
  __IM  uint32_t  RESERVED15[11];

  union {
    __IOM uint32_t DBGCTRL;                     /*!< Debug subsystem Control. Determines the debug components enable
                                                     and clk frequency.                                                        */

    struct {
      __IOM uint32_t CM4TPIUENABLE : 1;         /*!< TPIU Enable field. When set, the ARM M4 TPIU is enabled and
                                                     data can be streamed out trace data from ARM ITM and ETM
                                                     modules through either SWO or TRACEDATA ports                             */
      __IOM uint32_t CM4CLKSEL  : 3;            /*!< This field selects the frequency of the ARM M4 TPIU port.                 */
            uint32_t            : 4;
      __IOM uint32_t DBGETBENABLE : 1;          /*!< Debug subsystem ETB enable to store the trace data.                       */
      __IOM uint32_t DBGETMTRACEEN : 1;         /*!< Debug subsystem ETM trace enable                                          */
      __IOM uint32_t DBGDSP0TRACEEN : 1;        /*!< Debug subsystem DSP0 trace enable                                         */
      __IOM uint32_t DBGDSP1TRACEEN : 1;        /*!< Debug subsystem DSP1 trace enable                                         */
      __IOM uint32_t DBGTSCLKSEL : 3;           /*!< This field selects the frequency of the ARM M4 dbg ts port.               */
            uint32_t            : 1;
      __IOM uint32_t DBGDSP0OCDHALTONRST : 1;   /*!< Debug subsystem DSP0 OCD Halt on Reset                                    */
      __IOM uint32_t DBGDSP1OCDHALTONRST : 1;   /*!< Debug subsystem DSP1 OCD Halt on Reset                                    */
            uint32_t            : 14;
    } DBGCTRL_b;
  } ;
  __IM  uint32_t  RESERVED16[4];

  union {
    __IOM uint32_t OTAPOINTER;                  /*!< OTA (Over the Air) Update Pointer/Status. Reset only by POA               */

    struct {
      __IOM uint32_t OTAVALID   : 1;            /*!< Indicates that an OTA update is valid                                     */
      __IOM uint32_t OTASBLUPDATE : 1;          /*!< Indicates that the sbl_init has been updated                              */
      __IOM uint32_t OTAPOINTER : 30;           /*!< Flash page pointer with updated OTA image                                 */
    } OTAPOINTER_b;
  } ;
  __IM  uint32_t  RESERVED17[6];

  union {
    __IOM uint32_t APBDMACTRL;                  /*!< DMA Control Register. Determines misc settings for DMA operation          */

    struct {
      __IOM uint32_t DMAENABLE  : 1;            /*!< Enable the DMA controller. When disabled, DMA requests will
                                                     be ignored by the controller                                              */
      __IOM uint32_t DECODEABORT : 1;           /*!< APB Decode Abort. When set, the APB bridge will issue a data
                                                     abort (bus fault) on transactions to peripherals that are
                                                     powered down. When set to 0, writes are quietly discarded
                                                     and reads return 0.                                                       */
            uint32_t            : 6;
      __IOM uint32_t HYSTERESIS : 8;            /*!< This field determines how long the DMA engine of apb/disp/gfx
                                                     will remain active during deep sleep before shutting down
                                                     and returning the system to full deep sleep. Values are
                                                     based on a 94KHz clock and are roughly 10us increments
                                                     for a range of ~10us to 2.55ms                                            */
            uint32_t            : 16;
    } APBDMACTRL_b;
  } ;
  __IM  uint32_t  RESERVED18[45];

  union {
    __IOM uint32_t KEXTCLKSEL;                  /*!< Locks the state of the EXTCLKSEL register from writes. This
                                                     is done to prevent errant writes to the register, as this
                                                     could cause the chip to halt. Write a value of 0x53 to
                                                     unlock write access to the EXTCLKSEL register. Once unlocked,
                                                     the register will read back a 1 to undicate this is unlocked.
                                                     Writing the register with any other value other than 0x53
                                                     will enable the lock.                                                     */

