AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
            uint32_t            : 20;
      __IOM uint32_t ACTTRIMVDDS : 6;           /*!< Active VDDS trim.                                                         */
      __IOM uint32_t LPTRIMVDDS : 6;            /*!< Low power VDDS trim.                                                      */
    } SIMOBUCK13_b;
  } ;
  __IM  uint32_t  RESERVED21;

  union {
    __IOM uint32_t SIMOBUCK15;                  /*!< SIMO Buck Compare, Brown out, Active and Low power Trim Control           */

    struct {
            uint32_t            : 24;
      __IOM uint32_t ZXCOMPOFFSETTRIM : 5;      /*!< Zxcomp offset trim. Feedthrough to analog.                                */
            uint32_t            : 2;
      __IOM uint32_t TRIMLATCHOVER : 1;         /*!< Override / Bypass the simobuck trim latch to enable on-the-fly
                                                     trimming for VDDF and VDDS active and LP trims                            */
    } SIMOBUCK15_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< PWRSW Control 0                                                           */

    struct {
      __IOM uint32_t PWRSWVDDCPUDYNSEL : 2;     /*!< override value for pwrsw_vddcpu_dynsel                                    */
      __IOM uint32_t PWRSWVDDCPUPGN : 1;        /*!< override value for pwrsw_vddcpu_pgn                                       */
      __IOM uint32_t PWRSWVDDCPUOVERRIDE : 1;   /*!< override enable for pwrsw_vddcpu_dynsel and pgn                           */
      __IOM uint32_t PWRSWVDDCAORDYNSEL : 2;    /*!< override value for pwrsw_vddcaor_dynsel                                   */
      __IOM uint32_t PWRSWVDDCAOROVERRIDE : 1;  /*!< override enable for pwrsw_vddcaor_dynsel                                  */
      __IOM uint32_t PWRSWVDDDSP0DYNSEL : 2;    /*!< override value for pwrsw_vdddsp0_dynsel                                   */
      __IOM uint32_t PWRSWVDDDSP0PGN : 1;       /*!< override value for pwrsw_vdddsp0_pgn                                      */
      __IOM uint32_t PWRSWVDDDSP0OVERRIDE : 1;  /*!< override enable for pwrsw_vdddsp0_dynsel and pgn                          */
      __IOM uint32_t PWRSWVDDDSP1DYNSEL : 2;    /*!< override value for pwrsw_vdddsp1_dynsel                                   */
      __IOM uint32_t PWRSWVDDDSP1PGN : 1;       /*!< override value for pwrsw_vdddsp1_pgn                                      */
      __IOM uint32_t PWRSWVDDDSP1OVERRIDE : 1;  /*!< override enable for pwrsw_vdddsp1_dynsel and pgn                          */
      __IOM uint32_t PWRSWVDDMCPUDYNSEL : 1;    /*!< override value for pwrsw_vddmcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDMCPUSTATSEL : 1;   /*!< VDDMCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDMCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddmcpu_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP0DYNSEL : 1;   /*!< override value for pwrsw_vddmdsp0_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP0STATSEL : 1;  /*!< VDDMDSP0 power switch static select                                       */
      __IOM uint32_t PWRSWVDDMDSP0OVERRIDE : 1; /*!< override enable for pwrsw_vddmdsp0_dynsel                                 */
      __IOM uint32_t PWRSWVDDMDSP1DYNSEL : 1;   /*!< override value for pwrsw_vddmdsp1_dynsel                                  */
      __IOM uint32_t PWRSWVDDMDSP1STATSEL : 1;  /*!< VDDMDSP1 power switch static select                                       */
      __IOM uint32_t PWRSWVDDMDSP1OVERRIDE : 1; /*!< override enable for pwrsw_vddmdsp1_dynsel                                 */
      __IOM uint32_t PWRSWVDDMLDYNSEL : 1;      /*!< override value for pwrsw_vddml_dynsel                                     */
      __IOM uint32_t PWRSWVDDMLSTATSEL : 1;     /*!< VDDML power switch static select                                          */
      __IOM uint32_t PWRSWVDDMLOVERRIDE : 1;    /*!< override enable for pwrsw_vddml_dynsel                                    */
      __IOM uint32_t PWRSWVDDRCPUDYNSEL : 2;    /*!< override value for pwrsw_vddrcpu_dynsel                                   */
      __IOM uint32_t PWRSWVDDRCPUPGN : 1;       /*!< override value for pwrsw_vddrcpu_pgn                                      */
      __IOM uint32_t PWRSWVDDRCPUSTATSEL : 1;   /*!< VDDRCPU power switch static select                                        */
      __IOM uint32_t PWRSWVDDRCPUOVERRIDE : 1;  /*!< override enable for pwrsw_vddrcpu_dynsel and pgn                          */
    } PWRSW0_b;
  } ;

  union {
    __IOM uint32_t PWRSW1;                      /*!< PWRSW Control 1                                                           */

    struct {
      __IOM uint32_t PWRSWVDDRDSP0DYNSEL : 2;   /*!< override value for pwrsw_vddrdsp0_dynsel                                  */
      __IOM uint32_t PWRSWVDDRDSP0PGN : 1;      /*!< override value for pwrsw_vddrdsp0_pgn                                     */
      __IOM uint32_t PWRSWVDDRDSP0STATSEL : 1;  /*!< VDDRDSP0 power switch static select                                       */
      __IOM uint32_t PWRSWVDDRDSP0OVERRIDE : 1; /*!< override enable for pwrsw_vddrdsp0_dynsel and pgn                         */
      __IOM uint32_t PWRSWVDDRDSP1DYNSEL : 2;   /*!< override value for pwrsw_vddrdsp1_dynsel                                  */
      __IOM uint32_t PWRSWVDDRDSP1PGN : 1;      /*!< override value for pwrsw_vddrdsp1_pgn                                     */
      __IOM uint32_t PWRSWVDDRDSP1STATSEL : 1;  /*!< VDDRDSP1 power switch static select                                       */
      __IOM uint32_t PWRSWVDDRDSP1OVERRIDE : 1; /*!< override enable for pwrsw_vddrdsp1_dynsel and pgn                         */
      __IOM uint32_t PWRSWVDDRLDYNSEL : 1;      /*!< override value for pwrsw_vddrl_dynsel                                     */
      __IOM uint32_t PWRSWVDDRLPGN : 1;         /*!< override value for pwrsw_vddrl_pgn                                        */
      __IOM uint32_t PWRSWVDDRLSTATSEL : 1;     /*!< VDDRL power switch static select                                          */
      __IOM uint32_t PWRSWVDDRLOVERRIDE : 1;    /*!< override enable for pwrsw_vddrl_dynsel and pgn                            */
      __IOM uint32_t PWRSWVDDRMDYNSEL : 1;      /*!< override value for pwrsw_vddrm_dynsel                                     */
      __IOM uint32_t PWRSWVDDRMPGN : 1;         /*!< override value for pwrsw_vddrm_pgn                                        */
      __IOM uint32_t PWRSWVDDRMSTATSEL : 1;     /*!< VDDRM power switch static select                                          */
      __IOM uint32_t PWRSWVDDRMOVERRIDE : 1;    /*!< override enable for pwrsw_vddrm_dynsel and pgn                            */
      __IOM uint32_t PWRSWVDDLPGN : 1;          /*!< override value for pwrsw_vddl_pgn                                         */
      __IOM uint32_t PWRSWVDDLOVERRIDE : 1;     /*!< override enable for pwrsw_vddl_pgn                                        */
      __IOM uint32_t PWRSWCOMPPDNB : 1;         /*!< pwrsw_comp_pdnb                                                           */
      __IOM uint32_t PWRSWOVRDRVEN : 1;         /*!< pwrsw_ovrdrv_en                                                           */
      __IOM uint32_t DIGPWRSWOVRDRVEN : 1;      /*!< digpwrsw_ovrdrv_en                                                        */
      __IOM uint32_t DIGPWRSWOVRDRVSEL : 2;     /*!< digpwrsw_ovrdrv_sel                                                       */
      __IOM uint32_t USEVDDF4VDDRCPUINHP : 1;   /*!< Setting this bit selects VDDF for VDDRCPU in when MCU is in
                                                     HP mode. This is valid for only normal operational mode
                                                     (i.e without overrides).                                                  */
      __IOM uint32_t FORCEVDDRMVDDS : 1;        /*!< Setting this bit selects VDDS for VDDRM when Flash is off. This
                                                     is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t FORCEVDDRMOFF : 1;         /*!< Setting this bit forces VDDRM to be open when Flash is off.
                                                     This is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t SHORTVDDCVDDCLVOREN : 1;   /*!< pwrsw short override select for vddc/vddclv                               */
      __IOM uint32_t SHORTVDDCVDDCLVORVAL : 1;  /*!< pwrsw short override value for vddc/vddclv                                */
      __IOM uint32_t SHORTVDDFVDDSOREN : 1;     /*!< pwrsw short override select for vddf/vdds                                 */
      __IOM uint32_t SHORTVDDFVDDSORVAL : 1;    /*!< pwrsw short override value for vddf/vdds                                  */
    } PWRSW1_b;
  } ;
  __IM  uint32_t  RESERVED22;

  union {
    __IOM uint32_t USBRSTCTRL;                  /*!< USB Reset Startup Control                                                 */

