AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t AUDADCPWRCTRLSWE : 1;      /*!< Audio ADC Power Control Software Override Enable                          */
      __IOM uint32_t AUDADCAPSEN : 1;           /*!< Enable the Global audio ADC Power Switch on when set to 1 if
                                                     the AUDADCPWRCTRLSWE bit is set.                                          */
      __IOM uint32_t AUDADCBPSEN : 1;           /*!< Enable the Analog, IO and SAR Digital logic Power Switch on
                                                     when set to 1 if the AUDADCPWRCTRLSWE bit is set.                         */
      __IOM uint32_t AUDBGTPEN  : 1;            /*!< Bandgap and Temperature Sensor Power Switch Enable                        */
      __IOM uint32_t AUDREFBUFPEN : 1;          /*!< Reference Buffer Power Switch Enable                                      */
      __IOM uint32_t AUDREFKEEPPEN : 1;         /*!< Reference Buffer Keeper Power Switch Enable                               */
            uint32_t            : 2;
      __IOM uint32_t VDDAUDADCSARISOLATE : 1;   /*!< ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN is
                                                     switched off )                                                            */
      __IOM uint32_t VDDAUDADCDIGISOLATE : 1;   /*!< ISOLATE signal for audio ADC Digital Contoller ( when AUDADCAPSEN
                                                     is switched off and if the AUDADCPWRCTRLSWE bit is set)                   */
      __IOM uint32_t VDDAUDADCRESETN : 1;       /*!< RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t AUDADCVBATDIVEN : 1;       /*!< Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE bit
                                                     is set )                                                                  */
            uint32_t            : 1;
      __IOM uint32_t AUDADCINBUFSEL : 2;        /*!< Audio ADC input buffer mux select                                         */
      __IOM uint32_t AUDADCINBUFEN : 1;         /*!< Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
      __IOM uint32_t AUDADCRFBUFSLWEN : 1;      /*!< Audio ADC reference buffer slew enable                                    */
      __IOM uint32_t AUDADCKEEPOUTEN : 1;       /*!< Audio ADC reference keeper out en                                         */
            uint32_t            : 13;
    } AUDADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t AUDIO1;                      /*!< Audio trims 1                                                             */

    struct {
            uint32_t            : 6;
      __IOM uint32_t MICBIASVOLTAGETRIM : 6;    /*!< Output voltage trim                                                       */
      __IOM uint32_t MICBIASPDNB : 1;           /*!< Power down control for the block                                          */
            uint32_t            : 19;
    } AUDIO1_b;
  } ;
  __IM  uint32_t  RESERVED26;

  union {
    __IOM uint32_t PGAADCIFCTRL;                /*!< PGA ADCIF control                                                         */

    struct {
      __IOM uint32_t PGAADCIFCHAACTIVE : 2;     /*!< PGAADCIF active signal for channels A0 and A1. Starts and stops
                                                     2 clocks after demultiplexed SOC signal.                                  */
      __IOM uint32_t PGAADCIFCHAPDNB : 2;       /*!< Power down for channels A0 and A1 (0 = powered down; 1 = standby)         */
      __IOM uint32_t PGAADCIFCHBACTIVE : 2;     /*!< PGAADCIF active signal for channels B0 and B1. Starts and stops
                                                     2 clocks after demultiplexed SOC signal.                                  */
      __IOM uint32_t PGAADCIFCHBPDNB : 2;       /*!< Power down for channels B0 and B1 (0 = powered down; 1 = standby)         */
            uint32_t            : 4;
      __IOM uint32_t PGAADCIFVCOMPEN : 1;       /*!< Enable for VCOMP output                                                   */
      __IOM uint32_t PGAADCIFVCOMPSEL : 2;      /*!< Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)                      */
            uint32_t            : 17;
    } PGAADCIFCTRL_b;
  } ;

  union {
    __IOM uint32_t PGACTRL1;                    /*!< PGA control 1                                                             */

    struct {
      __IOM uint32_t PGACHA0GAIN1SEL : 3;       /*!< Channel A0 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)              */
      __IOM uint32_t PGACHA0GAIN2DIV2SEL : 1;   /*!< Channel A0 PGA divide by two select (0: 0 dB, 1: -6dB), needed
                                                     for fully differential inputs                                             */
      __IOM uint32_t PGACHA0GAIN2SEL : 5;       /*!< Channel A0 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)             */
      __IOM uint32_t PGACHA1GAIN1SEL : 3;       /*!< Channel A1 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)              */
      __IOM uint32_t PGACHA1GAIN2DIV2SEL : 1;   /*!< Channel A1 PGA divide by two select (0: 0 dB, 1: -6dB), needed
                                                     for fully differential inputs                                             */
      __IOM uint32_t PGACHA1GAIN2SEL : 5;       /*!< Channel A1 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)             */
      __IOM uint32_t PGACHABYPASSEN : 2;        /*!< Bypass enable for Channels A0 and A1 (1: bypass, when gain LT
                                                     12 dB; 0: otherwise)                                                      */
      __IOM uint32_t PGACHAOPAMPINPDNB : 2;     /*!< Channels A0 and A1 input stage opamp power down (0: powered
                                                     down, 1: powered up). Must be 1 when respective PGACHABYPASSEN
                                                     = 0.                                                                      */
      __IOM uint32_t PGACHAOPAMPOUTPDNB : 2;    /*!< Channels A0 and A1 output stage opamp power down (0: powered
                                                     down, 1: powered up)                                                      */
      __IOM uint32_t PGACHAVCMGENPDNB : 1;      /*!< Channel A VCMGEN power down (0: powered down, 1: powered up)              */
      __IOM uint32_t PGACHAVCMGENQCHARGEEN : 1; /*!< Channel A VCMGEN quick charge enable (pulsed during channel
                                                     powerup)                                                                  */
      __IOM uint32_t PGAIREFGENPDNB : 1;        /*!< IREFGEN power down (0: powered down, 1: powered up)                       */
      __IOM uint32_t PGAVREFGENPDNB : 1;        /*!< VREFGEN power down (0: powered down, 1: powered up)                       */
      __IOM uint32_t PGAVREFGENQUICKSTARTEN : 1;/*!< VREFGEN quick start enable (pulsed during startup)                        */
      __IOM uint32_t VCOMPSELPGA : 1;           /*!< Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)                      */
            uint32_t            : 1;
      __IOM uint32_t PGAGAINAOVRD : 1;          /*!< Apply BYPASS and GAIN bits from this register (for channel A)
                                                     instead of automatically via audio ADC. Note that audio
                                                     ADC FIFO meta data will not reflect dB gain as used when
                                                     configuring audio ADC.                                                    */
    } PGACTRL1_b;
  } ;

  union {
    __IOM uint32_t PGACTRL2;                    /*!< PGA control 2                                                             */

