AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t OVERRIDEEN : 20;           /*!< Output pad override enable. Bit mask for pad outputs. When set
                                                     to 1, the values in the OVERRIDE field are driven on the
                                                     pad (output enable is implicitly set in this mode). [7:0]=data
                                                     [8]=clock [9]=DM                                                          */
            uint32_t            : 12;
    } PADOVEREN_b;
  } ;

  union {
    __IOM uint32_t PADOVER;                     /*!< Override data value                                                       */

    struct {
      __IOM uint32_t OVERRIDE   : 20;           /*!< Output pad override value. [7:0]=data [8]=clock [9]=DM                    */
            uint32_t            : 12;
    } PADOVER_b;
  } ;
  __IM  uint32_t  RESERVED2[12];

  union {
    __IOM uint32_t DEV0AXI;                     /*!< Specifies the base address and aperture range of the device
                                                     as mapped onto the AXI bus                                                */

    struct {
      __IOM uint32_t SIZE0      : 4;            /*!< Indicates the AXI aperture size                                           */
      __IOM uint32_t READONLY0  : 1;            /*!< Indicates the AXI aperture is read-only                                   */
            uint32_t            : 11;
      __IOM uint32_t BASE0      : 10;           /*!< XIPEN has to be enabled to enable aperture. The BASE address
                                                     needs to be SIZE aligned.                                                 */
            uint32_t            : 6;
    } DEV0AXI_b;
  } ;

  union {
    __IOM uint32_t DEV0CFG;                     /*!< Command formatting for PIO based transactions (initiated by
                                                     writes to CTRL register)                                                  */

    struct {
      __IOM uint32_t DEVCFG0    : 5;            /*!< Flash configuration for XIP and AUTO DMA operations. Controls
                                                     value for SER (Slave Enable) for XIP operations and address
                                                     generation for DMA/XIP modes. Also used to configure SPIFRF
                                                     (frame format).                                                           */
      __IOM uint32_t ASIZE0     : 2;            /*!< Address Size. Address bytes to send from ADDR register                    */
      __IOM uint32_t ISIZE0     : 1;            /*!< Instruction Size                                                          */
      __IOM uint32_t TURNAROUND0 : 6;           /*!< Number of turnaound cycles (for TX->RX transitions). Qualified
                                                     by ENTURN bit field.                                                      */
      __IOM uint32_t CPHA0      : 1;            /*!< Serial clock phase.                                                       */
      __IOM uint32_t CPOL0      : 1;            /*!< Serial clock polarity.                                                    */
      __IOM uint32_t CLKDIV0    : 6;            /*!< Clock Divider. Allows dividing 96 MHz base clock by integer
                                                     multiples. Enumerations are provided for common frequency,
                                                     but any integer divide from 96 MHz is allowed. Odd divide
                                                     ratios will result in a 33/66 percent duty cycle with a
                                                     long low clock pulse (to allow longer round-trip for read
                                                     data).                                                                    */
      __IOM uint32_t RXCAP0     : 1;            /*!< Controls RX data capture phase. A setting of 0 (NORMAL) captures
                                                     read data at the normal capture point relative to the internal
                                                     clock launch point. However, to accomodate chip/pad/board
                                                     delays, a setting of RXCAP of 1 is expected to be used
                                                     to align the capture point with the return data window.
                                                     This bit is used in conjunction with RXNEG to provide 4
                                                     unique capture points, all about 10ns apart.                              */
      __IOM uint32_t RXNEG0     : 1;            /*!< Adjusts the RX capture phase to the negedge of the 48MHz internal
                                                     clock (~10ns early). For normal operation, it is expected
                                                     that RXNEG will be set to 0.                                              */
      __IOM uint32_t TXNEG0     : 1;            /*!< Launches TX data a half clock cycle (~10ns) early. This should
                                                     normally be programmed to zero (NORMAL).                                  */
      __IOM uint32_t SEPIO0     : 1;            /*!< Separate IO configuration. This bit should be set when the target
                                                     device has separate MOSI and MISO pins. Respective IN/OUT
                                                     bits below should be set to map pins.                                     */
      __IOM uint32_t WRITELATENCY0 : 6;         /*!< Number of write Latency cycles. Qualified by ENTURN bit field.            */
    } DEV0CFG_b;
  } ;

  union {
    __IOM uint32_t DEV0DDR;                     /*!< Timing configuration bits for DDR operation of the MSPI module.           */

