AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< Target byte address for source of DMA (either read or write).
                                                     In cases of non-word aligned addresses, the DMA logic will
                                                     take care for ensuring only the target bytes are read/written.            */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMADEVADDR;                  /*!< DMA Device Address                                                        */

    struct {
      __IOM uint32_t DEVADDR    : 32;           /*!< SPI Device address for automated DMA transactions (both read
                                                     and write).                                                               */
    } DMADEVADDR_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< DMA Total Transfer Count                                                  */

    struct {
      __IOM uint32_t TOTCOUNT   : 24;           /*!< Total Transfer Count in bytes.                                            */
            uint32_t            : 8;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMABCOUNT;                   /*!< DMA BYTE Transfer Count                                                   */

    struct {
      __IOM uint32_t BCOUNT     : 8;            /*!< Burst transfer size in bytes. This is the number of bytes transferred
                                                     when a FIFO trigger event occurs. Recommended value is
                                                     32.                                                                       */
            uint32_t            : 24;
    } DMABCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATHRESH;                   /*!< Indicates FIFO level at which a DMA should be triggered. For
                                                     most configurations, a setting of 8 is recommended for
                                                     both read and write operations.                                           */

    struct {
      __IOM uint32_t DMATXTHRESH : 5;           /*!< DMA transfer FIFO level trigger. For read operations, DMA is
                                                     triggered when the FIFO level is greater than this value.
                                                     For write operations, DMA is triggered when the FIFO level
                                                     is less than this level. Each DMA operation will consist
                                                     of BCOUNT bytes.                                                          */
            uint32_t            : 3;
      __IOM uint32_t DMARXTHRESH : 5;           /*!< DMA transfer FIFO level trigger. For read operations, DMA is
                                                     triggered when the FIFO level is greater than this value.
                                                     For write operations, DMA is triggered when the FIFO level
                                                     is less than this level. Each DMA operation will consist
                                                     of BCOUNT bytes. This value should not be set more than
                                                     ALTRXFIFOFULL.                                                            */
            uint32_t            : 19;
    } DMATHRESH_b;
  } ;
  __IM  uint32_t  RESERVED4[57];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< Transfer complete. Note that DMA and CQ operations are layered,
                                                     so CMDCMP, DCMP, and CQ* can all be signaled simultaneously.              */
      __IOM uint32_t TXE        : 1;            /*!< Transmit FIFO empty.                                                      */
      __IOM uint32_t TXO        : 1;            /*!< Transmit FIFO Overflow (only occurs when SW writes to a full
                                                     FIFO).                                                                    */
      __IOM uint32_t RXU        : 1;            /*!< Receive FIFO underflow (only occurs when SW reads from an empty
                                                     FIFO)                                                                     */
      __IOM uint32_t RXO        : 1;            /*!< Receive FIFO overflow (cannot happen in MSPI design -- MSPI
                                                     bus pins will stall)                                                      */
      __IOM uint32_t RXF        : 1;            /*!< Receive FIFO full                                                         */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Interrupt                                                       */
      __IOM uint32_t CQCMP      : 1;            /*!< Command Queue Complete Interrupt                                          */
      __IOM uint32_t CQUPD      : 1;            /*!< Command Queue Update Interrupt. Issued whenever the CQ performs
                                                     an operation where address bit[0] is set. Useful for triggering
                                                     CURIDX interrupts.                                                        */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command Queue is Paused.                                                  */
      __IOM uint32_t CQERR      : 1;            /*!< Command Queue Error Interrupt                                             */
      __IOM uint32_t SCRERR     : 1;            /*!< Scrambling Alignment Error. Scrambling operations must be aligned
                                                     to word (4-byte) start address.                                           */
      __IOM uint32_t APBDMAERR  : 1;            /*!< MSPI is dma target as well as dma source, which may result in
                                                     deadlock.                                                                 */
            uint32_t            : 18;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

