AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< Transfer complete. Note that DMA and CQ operations are layered,
                                                     so CMDCMP, DCMP, and CQ* can all be signaled simultaneously.              */
      __IOM uint32_t TXE        : 1;            /*!< Transmit FIFO empty.                                                      */
      __IOM uint32_t TXO        : 1;            /*!< Transmit FIFO Overflow (only occurs when SW writes to a full
                                                     FIFO).                                                                    */
      __IOM uint32_t RXU        : 1;            /*!< Receive FIFO underflow (only occurs when SW reads from an empty
                                                     FIFO)                                                                     */
      __IOM uint32_t RXO        : 1;            /*!< Receive FIFO overflow (cannot happen in MSPI design -- MSPI
                                                     bus pins will stall)                                                      */
      __IOM uint32_t RXF        : 1;            /*!< Receive FIFO full                                                         */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Interrupt                                                       */
      __IOM uint32_t CQCMP      : 1;            /*!< Command Queue Complete Interrupt                                          */
      __IOM uint32_t CQUPD      : 1;            /*!< Command Queue Update Interrupt. Issued whenever the CQ performs
                                                     an operation where address bit[0] is set. Useful for triggering
                                                     CURIDX interrupts.                                                        */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command Queue is Paused.                                                  */
      __IOM uint32_t CQERR      : 1;            /*!< Command Queue Error Interrupt                                             */
      __IOM uint32_t SCRERR     : 1;            /*!< Scrambling Alignment Error. Scrambling operations must be aligned
                                                     to word (4-byte) start address.                                           */
      __IOM uint32_t APBDMAERR  : 1;            /*!< MSPI is dma target as well as dma source, which may result in
                                                     deadlock.                                                                 */
            uint32_t            : 18;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t CMDCMP     : 1;            /*!< Transfer complete. Note that DMA and CQ operations are layered,
                                                     so CMDCMP, DCMP, and CQ* can all be signaled simultaneously.              */
      __IOM uint32_t TXE        : 1;            /*!< Transmit FIFO empty.                                                      */
      __IOM uint32_t TXO        : 1;            /*!< Transmit FIFO Overflow (only occurs when SW writes to a full
                                                     FIFO).                                                                    */
      __IOM uint32_t RXU        : 1;            /*!< Receive FIFO underflow (only occurs when SW reads from an empty
                                                     FIFO)                                                                     */
      __IOM uint32_t RXO        : 1;            /*!< Receive FIFO overflow (cannot happen in MSPI design -- MSPI
                                                     bus pins will stall)                                                      */
      __IOM uint32_t RXF        : 1;            /*!< Receive FIFO full                                                         */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete Interrupt                                                    */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error Interrupt                                                       */
      __IOM uint32_t CQCMP      : 1;            /*!< Command Queue Complete Interrupt                                          */
      __IOM uint32_t CQUPD      : 1;            /*!< Command Queue Update Interrupt. Issued whenever the CQ performs
                                                     an operation where address bit[0] is set. Useful for triggering
                                                     CURIDX interrupts.                                                        */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command Queue is Paused.                                                  */
      __IOM uint32_t CQERR      : 1;            /*!< Command Queue Error Interrupt                                             */
      __IOM uint32_t SCRERR     : 1;            /*!< Scrambling Alignment Error. Scrambling operations must be aligned
                                                     to word (4-byte) start address.                                           */
      __IOM uint32_t APBDMAERR  : 1;            /*!< MSPI is dma target as well as dma source, which may result in
                                                     deadlock.                                                                 */
            uint32_t            : 18;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

