AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t DTCMEN     : 3;            /*!< Enable DTCM power-on status event                                         */
      __IOM uint32_t NVM0EN     : 1;            /*!< Control NVM power-on status event                                         */
      __IOM uint32_t CACHEB0EN  : 1;            /*!< Control CACHE BANK 0 power-on status event                                */
      __IOM uint32_t CACHEB2EN  : 1;            /*!< Control CACHEB2 power-on status event                                     */
            uint32_t            : 26;
    } MEMPWREVENTEN_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t MMSOVERRIDE;                 /*!< Power domain behavior overrides related to MMS ( Multimedia
                                                     System ).                                                                 */

    struct {
      __IOM uint32_t MMSOVRMCULDISP : 1;        /*!< MMS override for MCUL on by PD_DISP setting.                              */
      __IOM uint32_t MMSOVRMCULGFX : 1;         /*!< MMS override for MCUL on by PD_GFX setting.                               */
      __IOM uint32_t MMSOVRSSRAMDISP : 1;       /*!< MMS override for SSRAM power state by PD_DISP power setting.              */
      __IOM uint32_t MMSOVRSSRAMGFX : 1;        /*!< MMS override for SSRAM power state by PD_GFX power setting.               */
      __IOM uint32_t MMSOVRDSPRAMRETDISP : 2;   /*!< If set, retention equation doesn't consider DISP. Each bit corresponds
                                                     to a domain.                                                              */
      __IOM uint32_t MMSOVRDSPRAMRETGFX : 2;    /*!< If set, retention equation doesn't consider GFX. Each bit corresponds
                                                     to a domain.                                                              */
      __IOM uint32_t MMSOVRSSRAMRETDISP : 2;    /*!< If set, retention equation doesn't consider DISP. Each bit corresponds
                                                     to a domain.                                                              */
      __IOM uint32_t MMSOVRSSRAMRETGFX : 2;     /*!< If set, retention equation doesn't consider GFX. Each bit corresponds
                                                     to a domain.                                                              */
            uint32_t            : 20;
    } MMSOVERRIDE_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t DSP0PWRCTRL;                 /*!< Power and RST controls for DSP0                                           */

    struct {
      __IOM uint32_t DSP0PCMRSTDLY : 4;         /*!< PCM Reset delay in number of 24MHz clocks.                                */
      __IOM uint32_t DSP0PCMRSTOR : 1;          /*!< PCM Reset override. If this is disabled, then h/w will handle
                                                     the de-assertion of pcm reset.                                            */
            uint32_t            : 27;
    } DSP0PWRCTRL_b;
  } ;

  union {
    __IOM uint32_t DSP0PERFREQ;                 /*!< This register provides the performance mode knobs for DSP0.
                                                     S/w should write the *PERFREQ field to desired mode and
                                                     wait for the *PERFACK and check for the *PERFSTATUS. Some
                                                     times system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

    struct {
      __IOM uint32_t DSP0PERFREQ : 2;           /*!< DSP0 Performance mode request                                             */
      __IOM uint32_t DSP0PERFACK : 1;           /*!< Indicates the DSP0 performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t DSP0PERFSTATUS : 2;        /*!< DSP0 Performance mode request                                             */
            uint32_t            : 27;
    } DSP0PERFREQ_b;
  } ;

  union {
    __IOM uint32_t DSP0MEMPWREN;                /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the DSP0MEMRETCFG register when
                                                     DSP0 is OFF.                                                              */

    struct {
      __IOM uint32_t PWRENDSP0RAM : 1;          /*!< Power up DSP0 IRAM and DRAM                                               */
      __IOM uint32_t PWRENDSP0ICACHE : 1;       /*!< Power up DSP0 ICACHE banks                                                */
            uint32_t            : 30;
    } DSP0MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t DSP0MEMPWRST;                /*!< It provides the power status for all the memories of DSP0 subsystem       */

    struct {
      __IOM uint32_t PWRSTDSP0RAM : 1;          /*!< Status- 1:ON, 0:OFF                                                       */
      __IOM uint32_t PWRSTDSP0ICACHE : 1;       /*!< Power Status- 1:ON, 0:OFF                                                 */
            uint32_t            : 30;
    } DSP0MEMPWRST_b;
  } ;

  union {
    __IOM uint32_t DSP0MEMRETCFG;               /*!< This controls the power down of the DRAM/IRAM/CACHE banks when
                                                     DSP0 is powered off. If this is set, then the power for
                                                     that corresponding SRAM bank will be gated when the DSP0
                                                     is powered off and data is erased. If this is not set,
                                                     retention voltage will be applied when DSP0 is powered
                                                     off. Do not set this if the SRAM bank is used as the target
                                                     for DMA transfer while DSP0 is powered off.                               */

