AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t PWRACKOVERRIDEADC : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEAUD : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEAUDADC : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDECRYPTO : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDBG : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDISP : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDISPPHY : 1; /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEGFX : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPA : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPB : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEHCPC : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEIOS : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMCUL : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEMSPI : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDESDIO : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEUSB : 1;     /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEUSBPHY : 1;  /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
      __IOM uint32_t PWRACKOVERRIDEDSPA : 1;    /*!< Power switch acknowledgement override from Power switch to power
                                                     control ST MC                                                             */
            uint32_t            : 14;
    } PWRACKOVR_b;
  } ;

  union {
    __IOM uint32_t PWRCNTDEFVAL;                /*!< This register contains programmble dealy values for various
                                                     state michines. Fields contain dev st machine default value,
                                                     SIMOBUCK state machine wait delay counter etc.                            */

    struct {
      __IOM uint32_t PWRDEFVALDEVSTMC : 6;      /*!< Default count max value for dev ST MC                                     */
      __IOM uint32_t PWRACKWAITDELSIMOSTMC : 10;/*!< Default counter max for buck ST MC                                        */
            uint32_t            : 16;
    } PWRCNTDEFVAL_b;
  } ;
  __IM  uint32_t  RESERVED3[29];

  union {
    __IOM uint32_t VRCTRL;                      /*!< This register includes additional debug control bits. This is
                                                     an internal Ambiq-only register. Customers should not attempt
                                                     to change this or else functionality cannot be guaranteed.                */

    struct {
      __IOM uint32_t SIMOBUCKEN : 1;            /*!< Enables and Selects the SIMO Buck as the supply for the low-voltage
                                                     power domains. It takes the initial value from the bit
                                                     set in Customer INFO space.                                               */
            uint32_t            : 31;
    } VRCTRL_b;
  } ;

  union {
    __IOM uint32_t LEGACYVRLPOVR;               /*!< When an override is set for a power domain, VR logic will ignore
                                                     that power domain state in making a decision to go into
                                                     lp state.                                                                 */

