AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t IGNOREIOS  : 1;            /*!< Ignore IOS                                                                */
      __IOM uint32_t IGNOREHCPA : 1;            /*!< Ignore HCPA                                                               */
      __IOM uint32_t IGNOREHCPB : 1;            /*!< Ignore HCPB                                                               */
      __IOM uint32_t IGNOREHCPC : 1;            /*!< Ignore HCPC                                                               */
      __IOM uint32_t IGNOREHCPD : 1;            /*!< Ignore HCPD                                                               */
      __IOM uint32_t IGNOREHCPE : 1;            /*!< Ignore HCPE                                                               */
      __IOM uint32_t IGNOREMSPI : 1;            /*!< Ignore MSPI                                                               */
      __IOM uint32_t IGNOREGFX  : 1;            /*!< Ignore GFX                                                                */
      __IOM uint32_t IGNOREDISP : 1;            /*!< Ignore DISP Control                                                       */
      __IOM uint32_t IGNOREDISPPHY : 1;         /*!< Ignore DISP PHY                                                           */
      __IOM uint32_t IGNORECRYPTO : 1;          /*!< Ignore CRYPTO                                                             */
      __IOM uint32_t IGNORESDIO : 1;            /*!< Ignore SDIO                                                               */
      __IOM uint32_t IGNOREUSB  : 1;            /*!< Ignore USB Control                                                        */
      __IOM uint32_t IGNOREUSBPHY : 1;          /*!< Ignore USB PHY                                                            */
      __IOM uint32_t IGNOREAUD  : 1;            /*!< Ignore AUD                                                                */
      __IOM uint32_t IGNOREDSPA : 1;            /*!< Ignore DSPA                                                               */
      __IOM uint32_t IGNOREDSP0H : 1;           /*!< Ignore DSP0H                                                              */
      __IOM uint32_t IGNOREDSP1H : 1;           /*!< Ignore DSP1H                                                              */
      __IOM uint32_t IGNOREDBG  : 1;            /*!< Ignore DBG                                                                */
            uint32_t            : 13;
    } LEGACYVRLPOVR_b;
  } ;

  union {
    __IOM uint32_t VRSTATUS;                    /*!< Provides BUCK and LDOs status.                                            */

    struct {
      __IOM uint32_t CORELDOST  : 2;            /*!< Indicates CORELDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t MEMLDOST   : 2;            /*!< Indicates MEMLDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t SIMOBUCKST : 2;            /*!< Indicates SIMO BUCK status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP                                                          */
            uint32_t            : 26;
    } VRSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED4[13];

  union {
    __IOM uint32_t PWRWEIGHTULP0;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTULPMCU   : 4;            /*!< Weight used for ULP mode MCU                                              */
      __IOM uint32_t WTULPDSP0  : 4;            /*!< Weight used for ULP mode DSP0                                             */
      __IOM uint32_t WTULPDSP1  : 4;            /*!< Weight used for ULP mode DSP1                                             */
      __IOM uint32_t WTULPIOS   : 4;            /*!< Weight used for ULP mode IOS                                              */
      __IOM uint32_t WTULPUART0 : 4;            /*!< Weight used for ULP mode UART0                                            */
      __IOM uint32_t WTULPUART1 : 4;            /*!< Weight used for ULP mode UART1                                            */
      __IOM uint32_t WTULPUART2 : 4;            /*!< Weight used for ULP mode UART2                                            */
      __IOM uint32_t WTULPUART3 : 4;            /*!< Weight used for ULP mode UART3                                            */
    } PWRWEIGHTULP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP1;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTULPIOM0  : 4;            /*!< Weight used for ULP mode IOM0                                             */
      __IOM uint32_t WTULPIOM1  : 4;            /*!< Weight used for ULP mode IOM1                                             */
      __IOM uint32_t WTULPIOM2  : 4;            /*!< Weight used for ULP mode IOM2                                             */
      __IOM uint32_t WTULPIOM3  : 4;            /*!< Weight used for ULP mode IOM3                                             */
      __IOM uint32_t WTULPIOM4  : 4;            /*!< Weight used for ULP mode IOM4                                             */
      __IOM uint32_t WTULPIOM5  : 4;            /*!< Weight used for ULP mode IOM5                                             */
      __IOM uint32_t WTULPIOM6  : 4;            /*!< Weight used for ULP mode IOM6                                             */
      __IOM uint32_t WTULPIOM7  : 4;            /*!< Weight used for ULP mode IOM7                                             */
    } PWRWEIGHTULP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP2;               /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

