AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t WTLPIOM0   : 4;            /*!< Weight used for LP mode IOM0                                              */
      __IOM uint32_t WTLPIOM1   : 4;            /*!< Weight used for LP mode IOM1                                              */
      __IOM uint32_t WTLPIOM2   : 4;            /*!< Weight used for LP mode IOM2                                              */
      __IOM uint32_t WTLPIOM3   : 4;            /*!< Weight used for LP mode IOM3                                              */
      __IOM uint32_t WTLPIOM4   : 4;            /*!< Weight used for LP mode IOM4                                              */
      __IOM uint32_t WTLPIOM5   : 4;            /*!< Weight used for LP mode IOM5                                              */
      __IOM uint32_t WTLPIOM6   : 4;            /*!< Weight used for LP mode IOM6                                              */
      __IOM uint32_t WTLPIOM7   : 4;            /*!< Weight used for LP mode IOM7                                              */
    } PWRWEIGHTLP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP2;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPADC    : 4;            /*!< Weight used for LP mode ADC                                               */
      __IOM uint32_t WTLPMSPI0  : 4;            /*!< Weight used for LP mode MSPI0                                             */
      __IOM uint32_t WTLPMSPI1  : 4;            /*!< Weight used for LP mode MSPI1                                             */
      __IOM uint32_t WTLPGFX    : 4;            /*!< Weight used for LP mode GFX                                               */
      __IOM uint32_t WTLPDISP   : 4;            /*!< Weight used for LP mode DISP                                              */
      __IOM uint32_t WTLPCRYPTO : 4;            /*!< Weight used for LP mode CRYPTO                                            */
      __IOM uint32_t WTLPSDIO   : 4;            /*!< Weight used for LP mode SDIO                                              */
      __IOM uint32_t WTLPUSB    : 4;            /*!< Weight used for LP mode USB                                               */
    } PWRWEIGHTLP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP3;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPDSPA   : 4;            /*!< Weight used for LP mode DSPA                                              */
      __IOM uint32_t WTLPDBG    : 4;            /*!< Weight used for LP mode DBG                                               */
      __IOM uint32_t WTLPAUDREC : 4;            /*!< Weight used for LP mode AUDREC                                            */
      __IOM uint32_t WTLPAUDPB  : 4;            /*!< Weight used for LP mode AUDPB                                             */
      __IOM uint32_t WTLPAUDADC : 4;            /*!< Weight used for LP mode AUDADC                                            */
            uint32_t            : 8;
      __IOM uint32_t WTLPMSPI2  : 4;            /*!< Weight used for LP mode MSPI2                                             */
    } PWRWEIGHTLP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP4;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPI2S0   : 4;            /*!< Weight used for LP mode I2S0                                              */
      __IOM uint32_t WTLPI2S1   : 4;            /*!< Weight used for LP mode I2S1                                              */
            uint32_t            : 8;
      __IOM uint32_t WTLPPDM0   : 4;            /*!< Weight used for LP mode PDM0                                              */
      __IOM uint32_t WTLPPDM1   : 4;            /*!< Weight used for LP mode PDM1                                              */
      __IOM uint32_t WTLPPDM2   : 4;            /*!< Weight used for LP mode PDM2                                              */
      __IOM uint32_t WTLPPDM3   : 4;            /*!< Weight used for LP mode PDM3                                              */
    } PWRWEIGHTLP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP5;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTLPDISPPHY : 4;           /*!< Weight used for LP mode DISP PHY                                          */
      __IOM uint32_t WTLPUSBPHY : 4;            /*!< Weight used for LP mode USB PHY                                           */
            uint32_t            : 24;
    } PWRWEIGHTLP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP0;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

