AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t WTHPI2S0   : 4;            /*!< Weight used for HP mode I2S0                                              */
      __IOM uint32_t WTHPI2S1   : 4;            /*!< Weight used for HP mode I2S1                                              */
            uint32_t            : 8;
      __IOM uint32_t WTHPPDM0   : 4;            /*!< Weight used for HP mode PDM0                                              */
      __IOM uint32_t WTHPPDM1   : 4;            /*!< Weight used for HP mode PDM1                                              */
      __IOM uint32_t WTHPPDM2   : 4;            /*!< Weight used for HP mode PDM2                                              */
      __IOM uint32_t WTHPPDM3   : 4;            /*!< Weight used for HP mode PDM3                                              */
    } PWRWEIGHTHP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTHP5;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTHPDISPPHY : 4;           /*!< Weight used for HP mode DISP PHY                                          */
      __IOM uint32_t WTHPUSBPHY : 4;            /*!< Weight used for HP mode USB PHY                                           */
            uint32_t            : 24;
    } PWRWEIGHTHP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTSLP;                /*!< Weights specified in this register are applied to each of the
                                                     masters active requests. The aggregate of all the masters
                                                     is compared against the allowed value to change the buck
                                                     from active to inactive mode.                                             */

    struct {
      __IOM uint32_t WTDSMCU    : 4;            /*!< Weight used for Deep Sleep mode MCU                                       */
            uint32_t            : 28;
    } PWRWEIGHTSLP_b;
  } ;

  union {
    __IOM uint32_t VRDEMOTIONTHR;               /*!< Weights specified in PWRWEIGHT* registers are applied to each
                                                     of the masters active requests. The aggregate of all the
                                                     masters is compared against the this threshold value to
                                                     change the buck from active to inactive mode.                             */

    struct {
      __IOM uint32_t VRDEMOTIONTHR : 32;        /*!< VR Demotion Threshold                                                     */
    } VRDEMOTIONTHR_b;
  } ;

  union {
    __IOM uint32_t SRAMCTRL;                    /*!< This register provides additional fine-tune power management
                                                     controls for the SRAMs and the SRAM controller. This includes
                                                     enabling light sleep for the SRAM and TCM banks, and clock
                                                     gating for reduced dynamic power.                                         */

    struct {
            uint32_t            : 1;
      __IOM uint32_t SRAMCLKGATE : 1;           /*!< This bit is 1 if clock gating is allowed for individual system
                                                     SRAMs                                                                     */
      __IOM uint32_t SRAMMASTERCLKGATE : 1;     /*!< This bit is 1 when the master clock gate is enabled (top-level
                                                     clock gate for entire SRAM block)                                         */
            uint32_t            : 5;
      __IOM uint32_t SRAMLIGHTSLEEP : 12;       /*!< Light Sleep enable for each TCM/SRAM bank. When 1, corresponding
                                                     bank will be put into light sleep. For optimal power, banks
                                                     should be put into light sleep while the system is active
                                                     but the bank has minimal or no accesses.                                  */
            uint32_t            : 12;
    } SRAMCTRL_b;
  } ;

  union {
    __IOM uint32_t ADCSTATUS;                   /*!< This provides the power status for various blocks within the
                                                     ADC. These status comes directly from the ADC module and
                                                     is captured through this interface.                                       */

    struct {
      __IOM uint32_t ADCPWD     : 1;            /*!< This bit indicates that the ADC is powered down                           */
      __IOM uint32_t BGTPWD     : 1;            /*!< This bit indicates that the ADC Band Gap is powered down                  */
      __IOM uint32_t VPTATPWD   : 1;            /*!< This bit indicates that the ADC temperature sensor input buffer
                                                     is powered down                                                           */
      __IOM uint32_t VBATPWD    : 1;            /*!< This bit indicates that the ADC VBAT resistor divider is powered
                                                     down                                                                      */
      __IOM uint32_t REFKEEPPWD : 1;            /*!< This bit indicates that the ADC REFKEEP is powered down                   */
      __IOM uint32_t REFBUFPWD  : 1;            /*!< This bit indicates that the ADC REFBUF is powered down                    */
            uint32_t            : 26;
    } ADCSTATUS_b;
  } ;

  union {
    __IOM uint32_t AUDADCSTATUS;                /*!< This provides the power status for various blocks within the
                                                     audio ADC. These status comes directly from the audio ADC
                                                     module and is captured through this interface.                            */

