AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t EMONCOUNT1 : 32;           /*!< Energy Monitor count value counter 1                                      */
    } EMONCOUNT1_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT2;                  /*!< Energy Monitor count value for counter 2                                  */

    struct {
      __IOM uint32_t EMONCOUNT2 : 32;           /*!< Energy Monitor count value counter 2                                      */
    } EMONCOUNT2_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT3;                  /*!< Energy Monitor count value for counter 3                                  */

    struct {
      __IOM uint32_t EMONCOUNT3 : 32;           /*!< Energy Monitor count value counter 3                                      */
    } EMONCOUNT3_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT4;                  /*!< Energy Monitor count value for counter 4                                  */

    struct {
      __IOM uint32_t EMONCOUNT4 : 32;           /*!< Energy Monitor count value counter 4                                      */
    } EMONCOUNT4_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT5;                  /*!< Energy Monitor count value for counter 5                                  */

    struct {
      __IOM uint32_t EMONCOUNT5 : 32;           /*!< Energy Monitor count value counter 5                                      */
    } EMONCOUNT5_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT6;                  /*!< Energy Monitor count value for counter 6                                  */

    struct {
      __IOM uint32_t EMONCOUNT6 : 32;           /*!< Energy Monitor count value counter 6                                      */
    } EMONCOUNT6_b;
  } ;

  union {
    __IOM uint32_t EMONCOUNT7;                  /*!< Energy Monitor count value for counter 7                                  */

    struct {
      __IOM uint32_t EMONCOUNT7 : 32;           /*!< Energy Monitor count value counter 7                                      */
    } EMONCOUNT7_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t EMONSTATUS;                  /*!< Energy Monitor status                                                     */

    struct {
      __IOM uint32_t EMONOVERFLOW0 : 1;         /*!< Energy Monitor counter0 overflow                                          */
      __IOM uint32_t EMONOVERFLOW1 : 1;         /*!< Energy Monitor counter1 overflow                                          */
      __IOM uint32_t EMONOVERFLOW2 : 1;         /*!< Energy Monitor counter2 overflow                                          */
      __IOM uint32_t EMONOVERFLOW3 : 1;         /*!< Energy Monitor counter3 overflow                                          */
      __IOM uint32_t EMONOVERFLOW4 : 1;         /*!< Energy Monitor counter4 overflow                                          */
      __IOM uint32_t EMONOVERFLOW5 : 1;         /*!< Energy Monitor counter5 overflow                                          */
      __IOM uint32_t EMONOVERFLOW6 : 1;         /*!< Energy Monitor counter6 overflow                                          */
      __IOM uint32_t EMONOVERFLOW7 : 1;         /*!< Energy Monitor counter7 overflow                                          */
            uint32_t            : 24;
    } EMONSTATUS_b;
  } ;
} PWRCTRL_Type;                                 /*!< Size = 592 (0x250)                                                        */



/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Reset Generator (RSTGEN)
  */

typedef struct {                                /*!< RSTGEN Structure                                                          */

  union {
    __IOM uint32_t CFG;                         /*!< Reset configuration register. This controls the reset enables
                                                     for brownout condition, choice of brownout method and for
                                                     the expiration of the watch dog timer.                                    */

    struct {
      __IOM uint32_t BODHREN    : 1;            /*!< Brown out high (2.1v) reset enable. Note - Enabling this bit
                                                     for Apollo4, which operates at 1.8v/1.9v, will cause a
                                                     continual reset loop.                                                     */
      __IOM uint32_t WDREN      : 1;            /*!< Watchdog Timer Reset Enable. NOTE: The WDT module must also
                                                     be configured for WDT reset. This includes enabling the
                                                     RESEN bit in WDTCFG register in Watch dog timer block.                    */
            uint32_t            : 30;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t SWPOI;                       /*!< This is the software POI reset. writing the key value to this
                                                     register will trigger a POI to the system. This will cause
                                                     a reset to all blocks except for registers in clock gen,
                                                     RTC and the stimer.                                                       */

    struct {
      __IOM uint32_t SWPOIKEY   : 8;            /*!< 0x1B generates a software POI reset. This is a write-only register.
                                                     Reading from this register will yield only all 0s.                        */
            uint32_t            : 24;
    } SWPOI_b;
  } ;

  union {
    __IOM uint32_t SWPOR;                       /*!< This is the software POR reset. Writing the key value to this
                                                     register will trigger a POR to the system. This will cause
                                                     a reset to all blocks except for registers in clock gen,
                                                     RTC, power management unit, the stimer, and the power management
                                                     unit.                                                                     */

