AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t BODH       : 1;            /*!< Enables an interrupt that triggers when VCC is below BODH level.          */
      __IOM uint32_t BODDIGC    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC                                                        */
      __IOM uint32_t BODDIGF    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDF                                                        */
      __IOM uint32_t BODDIGS    : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDS                                                        */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< Enables an interrupt that triggers when simobuck digital detects
                                                     inactivity on VDDC_LV                                                     */
            uint32_t            : 27;
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED2[8595];

  union {
    __IOM uint32_t STAT;                        /*!< This register contains the status for brownout events and the
                                                     causes for resets.
                                                     NOTE 1: All bits in this register, including reserved bits,
                                                     are writable. Therefore care should be taken not to write
                                                     this register.
                                                     NOTE 2: This register is only reset by POI not by HRESETn.
                                                     Its contents are intended to survive all reset level except
                                                     POI and full power cycles.                                                */

    struct {
      __IOM uint32_t EXRSTAT    : 1;            /*!< Reset was initiated by an External Reset.                                 */
      __IOM uint32_t PORSTAT    : 1;            /*!< Reset was initiated by a Power-On Reset.                                  */
      __IOM uint32_t BORSTAT    : 1;            /*!< Reset was initiated by a Brown-Out Reset.                                 */
      __IOM uint32_t SWRSTAT    : 1;            /*!< Reset was a initiated by SW POR or AIRCR Reset.                           */
      __IOM uint32_t POIRSTAT   : 1;            /*!< Reset was a initiated by Software POI Reset.                              */
      __IOM uint32_t DBGRSTAT   : 1;            /*!< Reset was a initiated by Debugger Reset.                                  */
      __IOM uint32_t WDRSTAT    : 1;            /*!< Reset was initiated by a Watchdog Timer Reset.                            */
      __IOM uint32_t BOUSTAT    : 1;            /*!< An Unregulated Supply Brownout Event occured.                             */
      __IOM uint32_t BOCSTAT    : 1;            /*!< VDDC Analog Brownout Event occured.                                       */
      __IOM uint32_t BOFSTAT    : 1;            /*!< VDDF Analog Brownout Event occured.                                       */
      __IOM uint32_t BOSSTAT    : 1;            /*!< VDDS Analog Brownout Event occured.                                       */
            uint32_t            : 21;
    } STAT_b;
  } ;
} RSTGEN_Type;                                  /*!< Size = 34912 (0x8860)                                                     */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real Time Clock (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */

  union {
    __IOM uint32_t RTCCTL;                      /*!< This is the register control for the RTC module. It enables
                                                     counter writes and sets the alarm repeat interval.                        */

    struct {
      __IOM uint32_t WRTC       : 1;            /*!< Counter write control                                                     */
      __IOM uint32_t RPT        : 3;            /*!< Alarm repeat interval                                                     */
      __IOM uint32_t RSTOP      : 1;            /*!< RTC input clock control                                                   */
      __IOM uint32_t HR1224     : 1;            /*!< Hours Counter mode Only 24HR mode supported                               */
            uint32_t            : 26;
    } RTCCTL_b;
  } ;

  union {
    __IOM uint32_t RTCSTAT;                     /*!< This is the register status for the RTC module.                           */

    struct {
      __IOM uint32_t WRITEBUSY  : 1;            /*!< Indicates that an RTC update (write) is still in progress. Writes
                                                     are initiated by writing the CTTLOW register - CTRUP must
                                                     be written before CTRLOW to be updated (otherwise it will
                                                     retain its current value)                                                 */
            uint32_t            : 31;
    } RTCSTAT_b;
  } ;
  __IM  uint32_t  RESERVED[6];

  union {
    __IOM uint32_t CTRLOW;                      /*!< This counter contains the values for hour, minutes, seconds
                                                     and 100ths of a second Counter.                                           */

