AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTSET_b;
  } ;
} RTC_Type;                                     /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                           SDIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SDIO Control Registers (SDIO)
  */

typedef struct {                                /*!< SDIO Structure                                                            */

  union {
    __IOM uint32_t SDMA;                        /*!< SDMA system address                                                       */

    struct {
      __IOM uint32_t SDMASYSTEMADDRESS : 32;    /*!< This register contains the physical system memory address used
                                                     for DMA transfers or the second argument for the Auto CMD23.
                                                     (1) SDMA System Address This register contains the system
                                                     memory address for a SDMA transfer. When the Host Controller
                                                     stops a SDMA transfer, this register shall point to the
                                                     system address of the next contiguous data position. It
                                                     can be accessed only if no transaction is executing (i.e.,
                                                     after a transaction has stopped). Read operations during
                                                     transfers may return an invalid value. The Host Driver
                                                     shall initialize this register before starting a SDMA transaction.
                                                     After SDMA has stopped, the next system address of the
                                                     next contiguous data position can be read from this register.
                                                     The SDMA transfer waits at the every boundary specified
                                                     by the Host SDMA Buffer Boundary in the Block Size register.
                                                     The Host Controller generates DMA Interrupt to request
                                                     the Host Driver to update this register. The Host Driver
                                                     sets the next system address of the next data position
                                                     to this register. When the most upper byte of this register
                                                     (003h) is written, the Host Controller restarts the SDMA
                                                     transfer. When restarting SDMA by the Resume command or
                                                     by setting Continue Request in the Block Gap Control register,
                                                     the Host Controller shall start at the next contiguous
                                                     address stored here in the SDMA System Address register.
                                                     ADMA does not use this register (2) Argument 2 This register
                                                     is used with the Auto CMD23 to set a 32-bit block count
                                                     value to the argument of the CMD23 while executing Auto
                                                     CMD23. If Auto CMD23 is used with ADMA, the full 32-bit
                                                     block count value can be used. If Auto CMD23 is used without
                                                     AMDA, the available block count value is limited by the
                                                     Block Count register. 65535 blocks is the maximum value
                                                     in this case.                                                             */
    } SDMA_b;
  } ;

  union {
    __IOM uint32_t BLOCK;                       /*!< Block size                                                                */

    struct {
      __IOM uint32_t TRANSFERBLOCKSIZE : 12;    /*!< This register specifies the block size for block data transfers
                                                     for CMD17, CMD18, CMD24, CMD25, and CMD53. It can be accessed
                                                     only if no transaction is executing (i.e after a transaction
                                                     has stopped). Read operations during transfer return an
                                                     invalid value and write operations shall be ignored.                      */
      __IOM uint32_t HOSTSDMABUFSZ : 3;         /*!< To perform long DMA transfer, System Address register shall
                                                     be updated at every system boundary during DMA transfer.
                                                     These bits specify the size of contiguous buffer in the
                                                     system memory. The DMA transfer shall wait at the every
                                                     boundary specified by these fields and the HC generates
                                                     the DMA Interrupt to request the HD to update the System
                                                     Address register. These bits shall support when the DMA
                                                     Support in the Capabilities register is set to 1 and this
                                                     function is active when the DMA Enable in the Transfer
                                                     Mode register is set to 1.                                                */
            uint32_t            : 1;
      __IOM uint32_t BLKCNT     : 16;           /*!< This register is enabled when Block Count Enable in the Transfer
                                                     Mode register is set to 1 and is valid only for multiple
                                                     block transfers. The HC decrements the block count after
                                                     each block transfer and stops when the count reaches zero.
                                                     It can be accessed only if no transaction is executing
                                                     (i.e. after a transaction has stopped). Read operations
                                                     during transfer return an invalid value and write operations
                                                     shall be ignored. When saving transfer context as a result
                                                     of Suspend command, the number of blocks yet to be transferred
                                                     can be determined by reading this register. When restoring
                                                     transfer context prior to issuing a Resume command, the
                                                     HD shall restore the previously save block count.                         */
    } BLOCK_b;
  } ;

  union {
    __IOM uint32_t ARGUMENT1;                   /*!< Argument1                                                                 */

