AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t CMDRESP0   : 32;           /*!< R[] refers to a bit range within the response data as transmitted
                                                     on the SD Bus, REP[] refers to a bit range within the Response
                                                     register.                                                                 */
    } RESPONSE0_b;
  } ;

  union {
    __IOM uint32_t RESPONSE1;                   /*!< Response1                                                                 */

    struct {
      __IOM uint32_t CMDRESP1   : 32;           /*!< R[] refers to a bit range within the response data as transmitted
                                                     on the SD Bus, REP[] refers to a bit range within the Response
                                                     register.                                                                 */
    } RESPONSE1_b;
  } ;

  union {
    __IOM uint32_t RESPONSE2;                   /*!< Response2                                                                 */

    struct {
      __IOM uint32_t CMDRESP2   : 32;           /*!< R[] refers to a bit range within the response data as transmitted
                                                     on the SD Bus, REP[] refers to a bit range within the Response
                                                     register.                                                                 */
    } RESPONSE2_b;
  } ;

  union {
    __IOM uint32_t RESPONSE3;                   /*!< Response3                                                                 */

    struct {
      __IOM uint32_t CMDRESP3   : 32;           /*!< R[] refers to a bit range within the response data as transmitted
                                                     on the SD Bus, REP[] refers to a bit range within the Response
                                                     register.                                                                 */
    } RESPONSE3_b;
  } ;

  union {
    __IOM uint32_t BUFFER;                      /*!< Buffer data port                                                          */

    struct {
      __IOM uint32_t BUFFERDATA : 32;           /*!< The Host Controller Buffer can be accessed through this 32-bit
                                                     Data Port Register.                                                       */
    } BUFFER_b;
  } ;

  union {
    __IOM uint32_t PRESENT;                     /*!< Present state                                                             */

    struct {
      __IOM uint32_t CMDINHCMD  : 1;            /*!< If this bit is 0, it indicates the CMD line is not in use and
                                                     the HC can issue a SD command using the CMD line. This
                                                     bit is set immediately after the Command register (00Fh)
                                                     is written. This bit is cleared when the command response
                                                     is received. Even if the Command Inhibit (DAT) is set to
                                                     1, Commands using only the CMD line can be issued if this
                                                     bit is 0. Changing from 1 to 0 generates a Command complete
                                                     interrupt in the Normal Interrupt Status register. If the
                                                     HC cannot issue the command because of a command conflict
                                                     error or because of Command Not Issued By Auto CMD12 Error,
                                                     this bit shall remain 1 and the Command Complete is not
                                                     set. Status issuing Auto CMD12 is not read from this bit.
                                                     Auto CMD12 and Auto CMD23 consist of two responses. In
                                                     this case, this bit is not cleared by the response of CMD12
                                                     or CMD23 but cleared by the response of a read/write command.
                                                     Status issuing Auto CMD12 is not read from this bit. So
                                                     if a command is issued during Auto CMD12 operation, Host
                                                     Controller shall manage to issue two commands: CMD12 and
                                                     a command set by Command register. Note: DAT line active
                                                     indicates whether one of the DAT line is on SD bus is in
                                                     use. (a) In the case of read transactions This status indicates
                                                     whether a read transfer is executing on the SD Bus. Changing
                                                     this value from 1 to 0 generates a Block Gap Event interrupt
                                                     in the Normal Interrupt Status register, as the result
                                                     of the Stop At Block Gap Request being set. This bit shall
                                                     be set in either of the following cases: (1) After the
                                                     end bit of the read command. (2) When writing a 1 to Continue
                                                     Request in the Block Gap Control register to restart a
                                                     read transfer. This bit shall be cleared in either of the
                                                     following cases: (1) When the end bit of the last data
                                                     block is sent from the SD Bus to the Host Controller. In
                                                     case of ADMA2, the last block is designated by the last
                                                     transfer of Descriptor Table. (2) When a read transfer
                                                     is stopped at the block gap initiated by a Stop At Block
                                                     Gap Request. The Host Controller shall stop read operation
                                                     at the start of the interrupt cycle of the next block gap
                                                     by driving Read Wait or stopping SD clock. If the Read
                                                     Wait signal is already driven (due to data buffer cannot
                                                     receive data), the Host Controller can continue to stop
                                                     read operation by driving the Read Wait signal. It is necessary
                                                     to support Read Wait in order to use suspend / resume function.
                                                     (b) In the case of write transactions This status indicates
                                                     that a write transfer is executing on the SD Bus. Changing
                                                     this value from 1 to 0 generate a Transfer Complete interrupt
                                                     in the Normal Interrupt Status register. This bit shall
                                                     be set in either of the following cases: (1) After the
                                                     end bit of the write command. (2) When writing to 1 to
                                                     Continue Request in the Block Gap Control register to continue
                                                     a write transfer. This bit shall be cleared in either of
                                                     the following cases: (1) When the SD card releases write
                                                     busy of the last data block. If SD card does not drive
                                                     busy signal for 8 SD Clocks, the Host Controller shall
                                                     consider the card drive Not Busy. In case of ADMA2, the
                                                     last block is designated by the last transfer of Descriptor
                                                     Table. (2) When the SD card releases write busy prior to
                                                     waiting for write transfer as a result of a Stop At Block
                                                     Gap Request. (c) Command with busy This status indicates
                                                     whether a command indicates busy (ex. erase command for
                                                     memory) is executing on the SD Bus. This bit is set after
                                                     the end bit of the command with busy and cleared when busy
                                                     is de-asserted. Changing this bit from 1 to 0 generate
                                                     a Transfer Complete interrupt in the Normal Interrupt Status
                                                     register. Note: The HD can issue cmd0, cmd12, cmd13 (for
                                                     memory) and cmd52 (for SDIO) when the DAT lines are busy
                                                     during data transfer. These commands can be issued when
                                                     Command Inhibit (CMD) is set to zero. Other commands shall
                                                     be issued when Command Inhibit (DAT) is set to zero.                      */
      __IOM uint32_t CMDINHDAT  : 1;            /*!< This status bit is generated if either the DAT Line Active or
                                                     the Read transfer Active is set to 1. If this bit is 0,
                                                     it indicates the HC can issue the next SD command. Commands
                                                     with busy signal belong to Command Inhibit (DAT) (ex. R1b,
                                                     R5b type). Changing from 1 to 0 generates a Transfer Complete
                                                     interrupt in the Normal interrupt status register. Note:
                                                     The SD Host Driver can save registers in the range of 000-00Dh
                                                     for a suspend transaction after this bit has changed from
                                                     1 to 0.                                                                   */
      __IOM uint32_t DLINEACT   : 1;            /*!< This bit indicates whether one of the DAT line on SD bus is
                                                     in use.                                                                   */
      __IOM uint32_t RETUNINGREQUEST : 1;       /*!< Re-Tuning Request Host Controller may request Host Driver to
                                                     execute re-tuning sequence by setting this bit when the
                                                     data window is shifted by temperature drift and a tuned
                                                     sampling point does not have a good margin to receive correct
                                                     data. This bit is cleared when a command is issued with
                                                     setting Execute Tuning in the Host Control 2 register.
                                                     Changing of this bit from 0 to 1 generates Re-Tuning Event.
                                                     Refer to Normal Interrupt registers for more detail. This
                                                     bit isn't set to 1 if Sampling Clock Select in the Host
                                                     Control 2 register is set to 0 (using fixed sampling clock).              */
            uint32_t            : 4;
      __IOM uint32_t WRXFERACT  : 1;            /*!< This status indicates a write transfer is active. If this bit
                                                     is 0, it means no valid write data exists in the HC. This
                                                     bit is set in either of the following cases: After the
                                                     end bit of the write command. When writing a 1 to Continue
                                                     Request in the Block Gap Control register to restart a
                                                     write transfer. This bit is cleared in either of the following
                                                     cases: After getting the CRC status of the last data block
                                                     as specified by the transfer count (Single or Multiple)
                                                     After getting a CRC status of any block where data transmission
                                                     is about to be stopped by a Stop At Block Gap Request.
                                                     During a write transaction, a Block Gap Event interrupt
                                                     is generated when this bit is changed to 0, as a result
                                                     of the Stop At Block Gap Request being set. This status
                                                     is useful for the HD in determining when to issue commands
                                                     during write busy.                                                        */
      __IOM uint32_t RDXFERACT  : 1;            /*!< This status is used for detecting completion of a read transfer.
                                                     This bit is set to 1 for either of the following conditions:
                                                     After the end bit of the read command When writing a 1
                                                     to continue Request in the Block Gap Control register to
                                                     restart a read transfer This bit is cleared to 0 for either
                                                     of the following conditions: When the last data block as
                                                     specified by block length is transferred to the system.
                                                     When all valid data blocks have been transferred to the
                                                     system and no current block transfers are being sent as
                                                     a result of the Stop At Block Gap Request set to 1. A transfer
                                                     complete interrupt is generated when this bit changes to
                                                     0.                                                                        */
      __IOM uint32_t BUFWREN    : 1;            /*!< This status is used for non-DMA write transfers. This read only
                                                     flag indicates if space is available for write data. If
                                                     this bit is 1, data can be written to the buffer. A change
                                                     of this bit from 1 to 0 occurs when all the block data
                                                     is written to the buffer. A change of this bit from 0 to
                                                     1 occurs when top of block data can be written to the buffer
                                                     and generates the Buffer Write Ready Interrupt.                           */
      __IOM uint32_t BUFRDEN    : 1;            /*!< This status is used for non-DMA read transfers. This read only
                                                     flag indicates that valid data exists in the host side
                                                     buffer status. If this bit is 1, readable data exists in
                                                     the buffer. A change of this bit from 1 to 0 occurs when
                                                     all the block data is read from the buffer. A change of
                                                     this bit from 0 to 1 occurs when all the block data is
                                                     ready in the buffer and generates the Buffer Read Ready
                                                     Interrupt.                                                                */
            uint32_t            : 4;
      __IOM uint32_t CARDINSERTED : 1;          /*!< This bit indicates whether a card has been inserted. Changing
                                                     from 0 to 1 generates a Card Insertion interrupt in the
                                                     Normal Interrupt Status register and changing from 1 to
                                                     0 generates a Card Removal Interrupt in the Normal Interrupt
                                                     Status register. The Software Reset For All in the Software
                                                     Reset register shall not affect this bit. If a Card is
                                                     removed while its power is on and its clock is oscillating,
                                                     the HC shall clear SD Bus Power in the Power Control register
                                                     and SD Clock Enable in the Clock control register. In addition
                                                     the HD should clear the HC by the Software Reset For All
                                                     in Software register. The card detect is active regardless
                                                     of the SD Bus Power.                                                      */
      __IOM uint32_t CARDSTABLE : 1;            /*!< This bit is used for testing. If it is 0, the Card Detect Pin
                                                     Level is not stable. If this bit is set to 1, it means
                                                     the Card Detect Pin Level is stable. The Software Reset
                                                     For All in the Software Reset Register shall not affect
                                                     this bit.                                                                 */
      __IOM uint32_t CARDDET    : 1;            /*!< This bit reflects the inverse value of the SDCD# pin.                     */
      __IOM uint32_t WRPROTSW   : 1;            /*!< The Write Protect Switch is supported for memory and combo cards.
                                                     This bit reflects the SDWP# pin.                                          */
      __IOM uint32_t DAT30LINE  : 4;            /*!< This status is used to check DAT line level to recover from
                                                     errors, and for debugging. This is especially useful in
                                                     detecting the busy signal level from DAT[0].                              */
      __IOM uint32_t CMDLINE    : 1;            /*!< This status is used to check CMD line level to recover from
                                                     errors, and for debugging.                                                */
      __IOM uint32_t DAT74LINE  : 4;            /*!< This status is used to check DAT line level to recover from
                                                     errors, and for debugging.                                                */
            uint32_t            : 3;
    } PRESENT_b;
  } ;

  union {
    __IOM uint32_t HOSTCTRL1;                   /*!< Host control 1                                                            */

