AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t LEDCONTROL : 1;            /*!< This bit is used to caution the user not to remove the card
                                                     while the SD card is being accessed. If the software is
                                                     going to issue multiple SD commands, this bit can be set
                                                     during all transactions. It is not necessary to change
                                                     for each transaction.                                                     */
      __IOM uint32_t DATATRANSFERWIDTH : 1;     /*!< (SD1 or SD4) This bit selects the data width of the HC. The
                                                     HD shall select it to match the data width of the SD card.                */
      __IOM uint32_t HISPEEDEN  : 1;            /*!< This bit is optional. Before setting this bit, the HD shall
                                                     check the High Speed Support in the capabilities register.
                                                     If this bit is set to 0 (default), the HC outputs CMD line
                                                     and DAT lines at the falling edge of the SD clock (up to
                                                     25 MHz/ 20MHz for MMC). If this bit is set to 1, the HC
                                                     outputs CMD line and DAT lines at the rising edge of the
                                                     SD clock (up to 50 MHz for SD/52MHz for MMC)/ 208Mhz (for
                                                     SD3.0) If Preset Value Enable in the Host Control 2 register
                                                     is set to 1, Host Driver needs to reset SD Clock Enable
                                                     before changing this field to avoid generating clock glitches.
                                                     After setting this field, the Host Driver sets SD Clock
                                                     Enable again                                                              */
      __IOM uint32_t DMASELECT  : 2;            /*!< One of supported DMA modes can be selected. The host driver
                                                     shall check support of DMA modes by referring the Capabilities
                                                     register.                                                                 */
      __IOM uint32_t XFERWIDTH  : 1;            /*!< This bit controls 8-bit bus width mode for embedded device.
                                                     Support of this function is indicated in 8-bit Support
                                                     for Embedded Device in the Capabilities register. If a
                                                     device supports 8-bit bus mode, this bit may be set to
                                                     1. If this bit is 0, bus width is controlled by Data Transfer
                                                     Width in the Host Control 1 register.This bit is not effective
                                                     when multiple devices are installed on a bus slot (Slot
                                                     Type is set to 10b in the Capabilities register). In this
                                                     case, each device bus width is controlled by Bus Width
                                                     Preset field in the Shared Bus register.                                  */
      __IOM uint32_t TESTLEVEL  : 1;            /*!< This bit is enabled while the Card Detect Signal Selection is
                                                     set to 1 and it indicates card inserted or not. Generates
                                                     (card ins or card removal) interrupt when the normal int
                                                     sts enable bit is set.                                                    */
      __IOM uint32_t CARDSRC    : 1;            /*!< This bit selects source for card detection.                               */
      __IOM uint32_t SDBUSPOWER : 1;            /*!< Before setting this bit, the SD host driver shall set SD Bus
                                                     Voltage Select. If the HC detects the No Card State, this
                                                     bit shall be cleared.                                                     */
      __IOM uint32_t VOLTSELECT : 3;            /*!< By setting these bits, the HD selects the voltage level for
                                                     the SD card. Before setting this register, the HD shall
                                                     check the voltage support bits in the capabilities register.
                                                     If an unsupported voltage is selected, the Host System
                                                     shall not supply SD bus voltage. All voltage select values
                                                     not enumerated here are reserved.                                         */
      __IOM uint32_t HWRESET    : 1;            /*!< Hardware reset signal is generated for eMMC card when this bit
                                                     is set                                                                    */
            uint32_t            : 3;
      __IOM uint32_t STOPATBLOCKGAPREQUEST : 1; /*!< This bit is used to stop executing a transaction at the next
                                                     block gap for non- DMA,SDMA and ADMA transfers. Until the
                                                     transfer complete is set to 1, indicating a transfer completion
                                                     the HD shall leave this bit set to 1. Clearing both the
                                                     Stop At Block Gap Request and Continue Request shall not
                                                     cause the transaction to restart. Read Wait is used to
                                                     stop the read transaction at the block gap. The HC shall
                                                     honour Stop At Block Gap Request for write transfers, but
                                                     for read transfers it requires that the SD card support
                                                     Read Wait. Therefore the HD shall not set this bit during
                                                     read transfers unless the SD card supports Read Wait and
                                                     has set Read Wait Control to 1. In case of write transfers
                                                     in which the HD writes data to the Buffer Data Port register,
                                                     the HD shall set this bit after all block data is written.
                                                     If this bit is set to 1, the HD shall not write data to
                                                     Buffer data port register. This bit affects Read Transfer
                                                     Active, Write Transfer Active, DAT line active and Command
                                                     Inhibit (DAT) in the Present State register.                              */
      __IOM uint32_t CONTREQ    : 1;            /*!< This bit is used to restart a transaction which was stopped
                                                     using the Stop At Block Gap Request. To cancel stop at
                                                     the block gap, set Stop At block Gap Request to 0 and set
                                                     this bit to restart the transfer. The HC automatically
                                                     clears this bit in either of the following cases: 1) In
                                                     the case of a read transaction, the DAT Line Active changes
                                                     from 0 to 1 as a read transaction restarts. 2) In the case
                                                     of a write transaction, the Write transfer active changes
                                                     from 0 to 1 as the write transaction restarts. Therefore
                                                     it is not necessary for Host driver to set this bit to
                                                     0. If Stop At Block Gap Request is set to 1, any write
                                                     to this bit is ignored.                                                   */
      __IOM uint32_t READWAITCTRL : 1;          /*!< The read wait function is optional for SDIO cards. If the card
                                                     supports read wait, set this bit to enable use of the read
                                                     wait protocol to stop read data using DAT[2] line. Otherwise
                                                     the HC has to stop the SD clock to hold read data, which
                                                     restricts commands generation. When the HD detects an SD
                                                     card insertion, it shall set this bit according to the
                                                     CCCR of the SDIO card. If the card does not support read
                                                     wait, this bit shall never be set to 1 otherwise DAT line
                                                     conflict may occur. If this bit is set to 0, Suspend /
                                                     Resume cannot be supported                                                */
      __IOM uint32_t GAP        : 1;            /*!< This bit is valid only in 4-bit mode of the SDIO card and selects
                                                     a sample point in the interrupt cycle. Setting to 1 enables
                                                     interrupt detection at the block gap for a multiple block
                                                     transfer. If the SD card cannot signal an interrupt during
                                                     a multiple block transfer, this bit should be set to 0.
                                                     When the HD detects an SD card insertion, it shall set
                                                     this bit according to the CCCR of the SDIO card.                          */
      __IOM uint32_t SPIMODE    : 1;            /*!< SPI mode enable bit.                                                      */
      __IOM uint32_t BOOTEN     : 1;            /*!< To start boot code access                                                 */
      __IOM uint32_t ALTBOOTEN  : 1;            /*!< To start boot code access in alternative mode.                            */
      __IOM uint32_t BOOTACKCHK : 1;            /*!< To check for the boot acknowledge in boot operation.                      */
      __IOM uint32_t WUENCARDINT : 1;           /*!< This bit enables wakeup event via Card Interrupt assertion in
                                                     the Normal Interrupt Status register. This bit can be set
                                                     to 1 if FN_WUS (Wake Up Support) in CIS is set to 1.                      */
      __IOM uint32_t WUENCARDINSERT : 1;        /*!< This bit enables wakeup event via Card Insertion assertion in
                                                     the Normal Interrupt Status register. FN_WUS (Wake up Support)
                                                     in CIS does not affect this bit.                                          */
      __IOM uint32_t WUENCARDREMOVL : 1;        /*!< This bit enables wakeup event via Card Removal assertion in
                                                     the Normal Interrupt Status register. FN_WUS (Wake up Support)
                                                     in CIS does not affect this bit.                                          */
            uint32_t            : 5;
    } HOSTCTRL1_b;
  } ;

  union {
    __IOM uint32_t CLOCKCTRL;                   /*!< Clock control                                                             */

