AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t COMMANDCOMPLETE : 1;       /*!< This bit is set when we get the end bit of the command response
                                                     (Except Auto CMD12 and Auto CMD23) Note: Command Time-out
                                                     Error has higher priority than Command Complete. If both
                                                     are set to 1, it can be considered that the response was
                                                     not received correctly.                                                   */
      __IOM uint32_t TRANSFERCOMPLETE : 1;      /*!< This bit is set when a read / write transaction is completed.
                                                     Read Transaction: This bit is set at the falling edge of
                                                     Read Transfer Active Status. There are two cases in which
                                                     the Interrupt is generated. The first is when a data transfer
                                                     is completed as specified by data length (After the last
                                                     data has been read to the Host System). The second is when
                                                     data has stopped at the block gap and completed the data
                                                     transfer by setting the Stop At Block Gap Request in the
                                                     Block Gap Control Register (After valid data has been read
                                                     to the Host System). Write Transaction: This bit is set
                                                     at the falling edge of the DAT Line Active Status. There
                                                     are two cases in which the Interrupt is generated. The
                                                     first is when the last data is written to the card as specified
                                                     by data length and Busy signal is released. The second
                                                     is when data transfers are stopped at the block gap by
                                                     setting Stop At Block Gap Request in the Block Gap Control
                                                     Register and data transfers completed. (After valid data
                                                     is written to the SD card and the busy signal is released).
                                                     Note: Transfer Complete has higher priority than Data Time-out
                                                     Error. If both bits are set to 1, the data transfer can
                                                     be considered complete Note: While performing tuning procedure
                                                     (Execute Tuning is set to 1), Transfer Complete is not
                                                     set to 1                                                                  */
      __IOM uint32_t BLOCKGAPEVENT : 1;         /*!< If the Stop At Block Gap Request in the Block Gap Control Register
                                                     is set, this bit is set. Read Transaction: This bit is
                                                     set at the falling edge of the DAT Line Active Status (When
                                                     the transaction is stopped at SD Bus timing. The Read Wait
                                                     must be supported inorder to use this function). Write
                                                     Transaction: This bit is set at the falling edge of Write
                                                     Transfer Active Status (After getting CRC status at SD
                                                     Bus timing).                                                              */
      __IOM uint32_t DMAINTERRUPT : 1;          /*!< This status is set if the HC detects the Host DMA Buffer Boundary
                                                     in the Block Size regiser.                                                */
      __IOM uint32_t BUFFERWRITEREADY : 1;      /*!< This status is set if the Buffer Write Enable changes from 0
                                                     to 1.                                                                     */
      __IOM uint32_t BUFFERREADREADY : 1;       /*!< This status is set if the Buffer Read Enable changes from 0
                                                     to 1. Buffer Read Ready is set to 1 for every CMD19 execution
                                                     in tuning procedure.                                                      */
      __IOM uint32_t CARDINSERTION : 1;         /*!< This status is set if the Card Inserted in the Present State
                                                     register changes from 0 to 1. When the HD writes this bit
                                                     to 1 to clear this status the status of the Card Inserted
                                                     in the Present State register should be confirmed. Because
                                                     the card detect may possibly be changed when the HD clear
                                                     this bit an Interrupt event may not be generated.                         */
      __IOM uint32_t CARDREMOVAL : 1;           /*!< This status is set if the Card Inserted in the Present State
                                                     register changes from 1 to 0. When the HD writes this bit
                                                     to 1 to clear this status the status of the Card Inserted
                                                     in the Present State register should be confirmed. Because
                                                     the card detect may possibly be changed when the HD clear
                                                     this bit an Interrupt event may not be generated.                         */
      __IOM uint32_t CARDINTERRUPT : 1;         /*!< Writing this bit to 1 does not clear this bit. It is cleared
                                                     by resetting the SD card interrupt factor. In 1-bit mode,
                                                     the HC shall detect the Card Interrupt without SD Clock
                                                     to support wakeup. In 4-bit mode, the card interrupt signal
                                                     is sampled during the interrupt cycle, so there are some
                                                     sample delays between the interrupt signal from the card
                                                     and the interrupt to the Host system. when this status
                                                     has been set and the HD needs to start this interrupt service,
                                                     Card Interrupt Status Enable in the Normal Interrupt Status
                                                     register shall be set to 0 in order to clear the card interrupt
                                                     statuses latched in the HC and stop driving the Host System.
                                                     After completion of the card interrupt service (the reset
                                                     factor in the SD card and the interrupt signal may not
                                                     be asserted), set Card Interrupt Status Enable to 1 and
                                                     start sampling the interrupt signal again. Interrupt detected
                                                     by DAT[1] is supported when there is a card per slot. In
                                                     case of shared bus, interrupt pins are used to detect interrupts.
                                                     If 000b is set to Interrupt Pin Select in the Shared Bus
                                                     Control register, this status is effective. Non-zero value
                                                     is set to Interrupt Pin Select, INT_A, INT_B or INT_C is
                                                     then used to device interrupts.                                           */
      __IOM uint32_t INTA       : 1;            /*!< This status is set if INT_A is enabled and INT_A# pin is in
                                                     low level. Writing this bit to 1 does not clear this bit.
                                                     It is cleared by resetting the INT_A interrupt factor                     */
      __IOM uint32_t INTB       : 1;            /*!< This status is set if INT_B is enabled and INT_B# pin is in
                                                     low level. Writing this bit to 1 does not clear this bit.
                                                     It is cleared by resetting the INT_B interrupt factor                     */
      __IOM uint32_t INTC       : 1;            /*!< This status is set if INT_C is enabled and INT_C# pin is in
                                                     low level. Writing this bit to 1 does not clear this bit.
                                                     It is cleared by resetting the INT_C interrupt factor                     */
      __IOM uint32_t RETUNINGEVENT : 1;         /*!< This status is set if Re-Tuning Request in the Present State
                                                     register changes from 0 to 1. Host Controller requests
                                                     Host Driver to perform re-tuning for next data transfer.
                                                     Current data transfer (not large block count) can be completed
                                                     without re-tuning.                                                        */
      __IOM uint32_t BOOTACKRCV : 1;            /*!< This status is set if the boot acknowledge is received from
                                                     device.                                                                   */
      __IOM uint32_t BOOTTERMINATE : 1;         /*!< Interrupt This status is set if the boot operation get terminated         */
      __IOM uint32_t ERRORINTERRUPT : 1;        /*!< If any of the bits in the Error Interrupt Status Register are
                                                     set, then this bit is set. Therefore the HD can test for
                                                     an error by checking this bit first.                                      */
      __IOM uint32_t COMMANDTIMEOUTERROR : 1;   /*!< Command CRC Error is generated in two cases. 1. If a response
                                                     is returned and the Command Time-out Error is set to 0,
                                                     this bit is set to 1 when detecting a CRT error in the
                                                     command response 2. The HC detects a CMD line conflict
                                                     by monitoring the CMD line when a command is issued. If
                                                     the HC drives the CMD line to 1 level, but detects 0 level
                                                     on the CMD line at the next SDCLK edge, then the HC shall
                                                     abort the command (Stop driving CMD line) and set this
                                                     bit to 1. The Command Timeout Error shall also be set to
                                                     1 to distinguish CMD line conflict.                                       */
      __IOM uint32_t COMMANDCRCERROR : 1;       /*!< Occurs when detecting that the end bit of a command response
                                                     is 0.                                                                     */
      __IOM uint32_t COMMANDENDBITERROR : 1;    /*!< Occurs only if the no response is returned within 64 SDCLK cycles
                                                     from the end bit of the command. If the HC detects a CMD
                                                     line conflict, in which case Command CRC Error shall also
                                                     be set. This bit shall be set without waiting for 64 SDCLK
                                                     cycles because the command will be aborted by the HC.                     */
      __IOM uint32_t COMMANDINDEXERROR : 1;     /*!< Occurs if a Command Index error occurs in the Command Response.           */
      __IOM uint32_t DATATIMEOUTERROR : 1;      /*!< Occurs when detecting one of following timeout conditions. 1.
                                                     Busy Timeout for R1b, R5b type. 2. Busy Timeout after Write
                                                     CRC status 3. Write CRC status Timeout 4. Read Data Timeout               */
      __IOM uint32_t DATACRCERROR : 1;          /*!< Occurs when detecting CRC error when transferring read data
                                                     which uses the DAT line or when detecting the Write CRC
                                                     Status having a value of other than 0.                                    */
      __IOM uint32_t DATAENDBITERROR : 1;       /*!< Occurs when detecting 0 at the end bit position of read data
                                                     which uses the DAT line or the end bit position of the
                                                     CRC status.                                                               */
      __IOM uint32_t CURRENTLIMITERROR : 1;     /*!< By setting the SD Bus Power bit in the Power Control Register,
                                                     the HC is requested to supply power for the SD Bus. If
                                                     the HC supports the Current Limit Function, it can be protected
                                                     from an Illegal card by stopping power supply to the card
                                                     in which case this bit indicates a failure status. Reading
                                                     1 means the HC is not supplying power to SD card due to
                                                     some failure. Reading 0 means that the HC is supplying
                                                     power and no error has occurred. This bit shall always
                                                     set to be 0, if the HC does not support this function.                    */
      __IOM uint32_t AUTOCMDERROR : 1;          /*!< Auto CMD12 and Auto CMD23 use this error status. This bit is
                                                     set when detecting that one of the bits D00-D04 in Auto
                                                     CMD Error Status register has changed from 0 to 1. In case
                                                     of Auto CMD12, this bit is set to 1, not only when the
                                                     errors in Auto CMD12 occur but also when Auto CMD12 is
                                                     not executed due to the previous command error.                           */
      __IOM uint32_t ADMAERROR  : 1;            /*!< This bit is set when the Host Controller detects errors during
                                                     ADMA based data transfer. The state of the ADMA at an error
                                                     occurrence is saved in the ADMA Error Status Register.                    */
            uint32_t            : 2;
      __IOM uint32_t TGTRESPERR : 1;            /*!< Occurs when detecting error in aximst_bresp or aximst_rresp               */
      __IOM uint32_t VNDERRSTAT : 3;            /*!< Vendor specific error status.                                             */
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTENABLE;                   /*!< Normal interrupt status enable                                            */

