AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t HSSDCLKFREQSEL : 10;       /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t HSCLKGENSEL : 1;           /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t HSDRVRSTRSEL : 2;          /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
      __IOM uint32_t SDR12SDCLKFREQSEL : 10;    /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t SDR12CLKGENSEL : 1;        /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t SDR12DRVRSTRSEL : 2;       /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
    } PRESET1_b;
  } ;

  union {
    __IOM uint32_t PRESET2;                     /*!< Preset Value for SDR25 and SDR50                                          */

    struct {
      __IOM uint32_t SDR25SDCLKFREQSEL : 10;    /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t SDR25CLKGENSEL : 1;        /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t SDR25DRVRSTRSEL : 2;       /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
      __IOM uint32_t SDR50SDCLKFREQSEL : 10;    /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t SDR50CLKGENSEL : 1;        /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t SDR50DRVRSTRSEL : 2;       /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
    } PRESET2_b;
  } ;

  union {
    __IOM uint32_t PRESET3;                     /*!< Preset Value for SDR104 and DDR50                                         */

    struct {
      __IOM uint32_t SDR104SDCLKFREQSEL : 10;   /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t SDR104CLKGENSEL : 1;       /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t SDR104DRVRSTRSEL : 2;      /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
      __IOM uint32_t DDR50SDCLKFREQSEL : 10;    /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t DDR50CLKGENSEL : 1;        /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t DDR50DRVRSTRSEL : 2;       /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
    } PRESET3_b;
  } ;

  union {
    __IOM uint32_t BOOTTOCTRL;                  /*!< Boot Data Timeout control                                                 */

