AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t TMR00INT   : 1;            /*!< Counter/Timer 0 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR01INT   : 1;            /*!< Counter/Timer 0 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR10INT   : 1;            /*!< Counter/Timer 1 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR11INT   : 1;            /*!< Counter/Timer 1 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR20INT   : 1;            /*!< Counter/Timer 2 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR21INT   : 1;            /*!< Counter/Timer 2 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR30INT   : 1;            /*!< Counter/Timer 3 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR31INT   : 1;            /*!< Counter/Timer 3 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR40INT   : 1;            /*!< Counter/Timer 4 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR41INT   : 1;            /*!< Counter/Timer 4 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR50INT   : 1;            /*!< Counter/Timer 5 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR51INT   : 1;            /*!< Counter/Timer 5 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR60INT   : 1;            /*!< Counter/Timer 6 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR61INT   : 1;            /*!< Counter/Timer 6 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR70INT   : 1;            /*!< Counter/Timer 7 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR71INT   : 1;            /*!< Counter/Timer 7 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR80INT   : 1;            /*!< Counter/Timer 8 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR81INT   : 1;            /*!< Counter/Timer 8 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR90INT   : 1;            /*!< Counter/Timer 9 interrupt based on CMP0.                                  */
      __IOM uint32_t TMR91INT   : 1;            /*!< Counter/Timer 9 interrupt based on CMP1.                                  */
      __IOM uint32_t TMR100INT  : 1;            /*!< Counter/Timer 10 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR101INT  : 1;            /*!< Counter/Timer 10 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR110INT  : 1;            /*!< Counter/Timer 11 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR111INT  : 1;            /*!< Counter/Timer 11 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR120INT  : 1;            /*!< Counter/Timer 12 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR121INT  : 1;            /*!< Counter/Timer 12 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR130INT  : 1;            /*!< Counter/Timer 13 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR131INT  : 1;            /*!< Counter/Timer 13 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR140INT  : 1;            /*!< Counter/Timer 14 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR141INT  : 1;            /*!< Counter/Timer 14 interrupt based on CMP1.                                 */
      __IOM uint32_t TMR150INT  : 1;            /*!< Counter/Timer 15 interrupt based on CMP0.                                 */
      __IOM uint32_t TMR151INT  : 1;            /*!< Counter/Timer 15 interrupt based on CMP1.                                 */
    } INTSET_b;
  } ;
  __IM  uint32_t  RESERVED2[4];

  union {
    __IOM uint32_t OUTCFG0;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG0    : 6;            /*!< Pad output 0 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG1    : 6;            /*!< Pad output 1 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG2    : 6;            /*!< Pad output 2 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG3    : 6;            /*!< Pad output 3 configuration                                                */
            uint32_t            : 2;
    } OUTCFG0_b;
  } ;

  union {
    __IOM uint32_t OUTCFG1;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG4    : 6;            /*!< Pad output 4 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG5    : 6;            /*!< Pad output 5 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG6    : 6;            /*!< Pad output 6 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG7    : 6;            /*!< Pad output 7 configuration                                                */
            uint32_t            : 2;
    } OUTCFG1_b;
  } ;

  union {
    __IOM uint32_t OUTCFG2;                     /*!< Pad output configuration 0.                                               */

