AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t OUTCFG8    : 6;            /*!< Pad output 8 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG9    : 6;            /*!< Pad output 9 configuration                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG10   : 6;            /*!< Pad output 10 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG11   : 6;            /*!< Pad output 11 configuration                                               */
            uint32_t            : 2;
    } OUTCFG2_b;
  } ;

  union {
    __IOM uint32_t OUTCFG3;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG12   : 6;            /*!< Pad output 12 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG13   : 6;            /*!< Pad output 13 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG14   : 6;            /*!< Pad output 14 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG15   : 6;            /*!< Pad output 15 configuration                                               */
            uint32_t            : 2;
    } OUTCFG3_b;
  } ;

  union {
    __IOM uint32_t OUTCFG4;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG16   : 6;            /*!< Pad output 16 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG17   : 6;            /*!< Pad output 17 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG18   : 6;            /*!< Pad output 18 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG19   : 6;            /*!< Pad output 19 configuration                                               */
            uint32_t            : 2;
    } OUTCFG4_b;
  } ;

  union {
    __IOM uint32_t OUTCFG5;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG20   : 6;            /*!< Pad output 20 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG21   : 6;            /*!< Pad output 21 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG22   : 6;            /*!< Pad output 22 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG23   : 6;            /*!< Pad output 23 configuration                                               */
            uint32_t            : 2;
    } OUTCFG5_b;
  } ;

  union {
    __IOM uint32_t OUTCFG6;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG24   : 6;            /*!< Pad output 24 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG25   : 6;            /*!< Pad output 25 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG26   : 6;            /*!< Pad output 26 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG27   : 6;            /*!< Pad output 27 configuration                                               */
            uint32_t            : 2;
    } OUTCFG6_b;
  } ;

  union {
    __IOM uint32_t OUTCFG7;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG28   : 6;            /*!< Pad output 28 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG29   : 6;            /*!< Pad output 29 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG30   : 6;            /*!< Pad output 30 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG31   : 6;            /*!< Pad output 31 configuration                                               */
            uint32_t            : 2;
    } OUTCFG7_b;
  } ;

  union {
    __IOM uint32_t OUTCFG8;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG32   : 6;            /*!< Pad output 32 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG33   : 6;            /*!< Pad output 33 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG34   : 6;            /*!< Pad output 34 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG35   : 6;            /*!< Pad output 35 configuration                                               */
            uint32_t            : 2;
    } OUTCFG8_b;
  } ;

  union {
    __IOM uint32_t OUTCFG9;                     /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG36   : 6;            /*!< Pad output 36 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG37   : 6;            /*!< Pad output 37 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG38   : 6;            /*!< Pad output 38 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG39   : 6;            /*!< Pad output 39 configuration                                               */
            uint32_t            : 2;
    } OUTCFG9_b;
  } ;

  union {
    __IOM uint32_t OUTCFG10;                    /*!< Pad output configuration 0.                                               */

