AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t OUTCFG104  : 6;            /*!< Pad output 104 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG105  : 6;            /*!< Pad output 105 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG106  : 6;            /*!< Pad output 106 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG107  : 6;            /*!< Pad output 107 configuration                                              */
            uint32_t            : 2;
    } OUTCFG26_b;
  } ;

  union {
    __IOM uint32_t OUTCFG27;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG108  : 6;            /*!< Pad output 108 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG109  : 6;            /*!< Pad output 109 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG110  : 6;            /*!< Pad output 110 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG111  : 6;            /*!< Pad output 111 configuration                                              */
            uint32_t            : 2;
    } OUTCFG27_b;
  } ;

  union {
    __IOM uint32_t OUTCFG28;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG112  : 6;            /*!< Pad output 112 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG113  : 6;            /*!< Pad output 113 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG114  : 6;            /*!< Pad output 114 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG115  : 6;            /*!< Pad output 115 configuration                                              */
            uint32_t            : 2;
    } OUTCFG28_b;
  } ;

  union {
    __IOM uint32_t OUTCFG29;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG116  : 6;            /*!< Pad output 116 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG117  : 6;            /*!< Pad output 117 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG118  : 6;            /*!< Pad output 118 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG119  : 6;            /*!< Pad output 119 configuration                                              */
            uint32_t            : 2;
    } OUTCFG29_b;
  } ;

  union {
    __IOM uint32_t OUTCFG30;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG120  : 6;            /*!< Pad output 120 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG121  : 6;            /*!< Pad output 121 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG122  : 6;            /*!< Pad output 122 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG123  : 6;            /*!< Pad output 123 configuration                                              */
            uint32_t            : 2;
    } OUTCFG30_b;
  } ;

  union {
    __IOM uint32_t OUTCFG31;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG124  : 6;            /*!< Pad output 124 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG125  : 6;            /*!< Pad output 125 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG126  : 6;            /*!< Pad output 126 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG127  : 6;            /*!< Pad output 127 configuration                                              */
            uint32_t            : 2;
    } OUTCFG31_b;
  } ;
  __IM  uint32_t  RESERVED3[64];

  union {
    __IOM uint32_t CTRL0;                       /*!< This includes the Control bit fields for timer 0.                         */

    struct {
      __IOM uint32_t TMR0EN     : 1;            /*!< Counter/Timer 0 Enable bit.                                               */
      __IOM uint32_t TMR0CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR0POL0   : 1;            /*!< Counter/Timer 0 output 0 polarity.                                        */
      __IOM uint32_t TMR0POL1   : 1;            /*!< Counter/Timer 0 output 1 polarity.                                        */
      __IOM uint32_t TMR0FN     : 4;            /*!< Counter/Timer 0 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR0CLK    : 8;            /*!< Counter/Timer 0 Clock Select.                                             */
      __IOM uint32_t TMR0TMODE  : 2;            /*!< Counter/Timer 0 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR0LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     0. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL0_b;
  } ;

  union {
    __IOM uint32_t TIMER0;                      /*!< This register holds the running time or event count for timer
                                                     0.                                                                        */

