AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t TIMER3     : 32;           /*!< Counter/Timer 3                                                           */
    } TIMER3_b;
  } ;

  union {
    __IOM uint32_t TMR3CMP0;                    /*!< This contains the Compare limits for timer 3. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR3CMP0   : 32;           /*!< Counter/Timer 3 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR3CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR3CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR3CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR3CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE3;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR3TRIGSEL : 8;           /*!< Counter/Timer 3 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE3_b;
  } ;

  union {
    __IOM uint32_t TMR3LMTVAL;                  /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR3LMTVAL : 8;            /*!< Counter/Timer 3 Limit Readback                                            */
            uint32_t            : 24;
    } TMR3LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED7[2];

  union {
    __IOM uint32_t CTRL4;                       /*!< This includes the Control bit fields for timer 4.                         */

    struct {
      __IOM uint32_t TMR4EN     : 1;            /*!< Counter/Timer 4 Enable bit.                                               */
      __IOM uint32_t TMR4CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR4POL0   : 1;            /*!< Counter/Timer 4 output 0 polarity.                                        */
      __IOM uint32_t TMR4POL1   : 1;            /*!< Counter/Timer 4 output 1 polarity.                                        */
      __IOM uint32_t TMR4FN     : 4;            /*!< Counter/Timer 4 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR4CLK    : 8;            /*!< Counter/Timer 4 Clock Select.                                             */
      __IOM uint32_t TMR4TMODE  : 2;            /*!< Counter/Timer 4 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR4LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     4. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL4_b;
  } ;

  union {
    __IOM uint32_t TIMER4;                      /*!< This register holds the running time or event count for timer
                                                     4.                                                                        */

    struct {
      __IOM uint32_t TIMER4     : 32;           /*!< Counter/Timer 4                                                           */
    } TIMER4_b;
  } ;

  union {
    __IOM uint32_t TMR4CMP0;                    /*!< This contains the Compare limits for timer 4. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR4CMP0   : 32;           /*!< Counter/Timer 4 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR4CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR4CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR4CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR4CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE4;                       /*!< The mode register contains optional mode controls for the timer           */

