AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR4TRIGSEL : 8;           /*!< Counter/Timer 4 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE4_b;
  } ;

  union {
    __IOM uint32_t TMR4LMTVAL;                  /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR4LMTVAL : 8;            /*!< Counter/Timer 4 Limit Readback                                            */
            uint32_t            : 24;
    } TMR4LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED8[2];

  union {
    __IOM uint32_t CTRL5;                       /*!< This includes the Control bit fields for timer 5.                         */

    struct {
      __IOM uint32_t TMR5EN     : 1;            /*!< Counter/Timer 5 Enable bit.                                               */
      __IOM uint32_t TMR5CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR5POL0   : 1;            /*!< Counter/Timer 5 output 0 polarity.                                        */
      __IOM uint32_t TMR5POL1   : 1;            /*!< Counter/Timer 5 output 1 polarity.                                        */
      __IOM uint32_t TMR5FN     : 4;            /*!< Counter/Timer 5 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR5CLK    : 8;            /*!< Counter/Timer 5 Clock Select.                                             */
      __IOM uint32_t TMR5TMODE  : 2;            /*!< Counter/Timer 5 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR5LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     5. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL5_b;
  } ;

  union {
    __IOM uint32_t TIMER5;                      /*!< This register holds the running time or event count for timer
                                                     5.                                                                        */

    struct {
      __IOM uint32_t TIMER5     : 32;           /*!< Counter/Timer 5                                                           */
    } TIMER5_b;
  } ;

  union {
    __IOM uint32_t TMR5CMP0;                    /*!< This contains the Compare limits for timer 5. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR5CMP0   : 32;           /*!< Counter/Timer 5 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR5CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR5CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR5CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR5CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE5;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR5TRIGSEL : 8;           /*!< Counter/Timer 5 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE5_b;
  } ;

  union {
    __IOM uint32_t TMR5LMTVAL;                  /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR5LMTVAL : 8;            /*!< Counter/Timer 5 Limit Readback                                            */
            uint32_t            : 24;
    } TMR5LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED9[2];

  union {
    __IOM uint32_t CTRL6;                       /*!< This includes the Control bit fields for timer 6.                         */

    struct {
      __IOM uint32_t TMR6EN     : 1;            /*!< Counter/Timer 6 Enable bit.                                               */
      __IOM uint32_t TMR6CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR6POL0   : 1;            /*!< Counter/Timer 6 output 0 polarity.                                        */
      __IOM uint32_t TMR6POL1   : 1;            /*!< Counter/Timer 6 output 1 polarity.                                        */
      __IOM uint32_t TMR6FN     : 4;            /*!< Counter/Timer 6 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR6CLK    : 8;            /*!< Counter/Timer 6 Clock Select.                                             */
      __IOM uint32_t TMR6TMODE  : 2;            /*!< Counter/Timer 6 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR6LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     6. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL6_b;
  } ;

  union {
    __IOM uint32_t TIMER6;                      /*!< This register holds the running time or event count for timer
                                                     6.                                                                        */

