AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t BF00       : 1;            /*!< Set IO high-Z state. Active high                                          */
      __IOM uint32_t BF11       : 1;            /*!< Tx power down in suspend state. Active low.                               */
      __IOM uint32_t BF22       : 1;            /*!< PLL enable bypass from suspend module. 1'b1: bypass enable 1'b0:bypass
                                                     disable                                                                   */
      __IOM uint32_t BF33       : 1;            /*!< PLL enable value from suspend module. 1'b1:pll enable                     */
      __IOM uint32_t BF44       : 1;            /*!< 480M clock out enable. 1'b0:pll disable 1'b1: 480M clock out
                                                     enable 1'b0: 480M clock out disable                                       */
      __IOM uint32_t BF55       : 1;            /*!< BG power down control bit, active high 1: power down band-gap
                                                     0: normal operation mode                                                  */
      __IOM uint32_t BF66       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG1C_b;
  } ;

  union {
    __IOM uint32_t REG20;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< Rx enable delay select. 3'b000: 4 clocks (480Mhz clock) 3'b001:
                                                     5 clocks 3'b010: 6 clocks 3'b011: 7 clocks 3'b100: 8 clocks
                                                     3'b101: 9 clocks 3'b110: 10 clocks 3'b111: 12 clocks                      */
      __IOM uint32_t BF33       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF54       : 2;            /*!< Analog observation port select. for detailed information, please
                                                     refer to section 10.3 , Table 30 : Debug and OBS port                     */
      __IOM uint32_t BF76       : 2;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG20_b;
  } ;

  union {
    __IOM uint32_t REG24;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< it0                                                                       */
      __IOM uint32_t BF71       : 7;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG24_b;
  } ;

  union {
    __IOM uint32_t REG28;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG28_b;
  } ;

  union {
    __IOM uint32_t REG2C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< All port z bypass value. 1'b1: bypass enable 1'b0:bypass disable          */
      __IOM uint32_t BF11       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF22       : 1;            /*!< HS keep alive enable. 1'b1: HS keep alive enable 1'b0: HS keep
                                                     alive disable                                                             */
      __IOM uint32_t BF33       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF44       : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF75       : 3;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG2C_b;
  } ;

  union {
    __IOM uint32_t REG30;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG30_b;
  } ;

  union {
    __IOM uint32_t REG34;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< BF70 field description needed.                                            */
            uint32_t            : 24;
    } REG34_b;
  } ;

  union {
    __IOM uint32_t REG38;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG38_b;
  } ;

  union {
    __IOM uint32_t REG3C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< BF10 field description needed.                                            */
      __IOM uint32_t BF42       : 3;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF75       : 3;            /*!< Host disconnect filter select. 3'b100:6 clocks(480M clock) 3'b101:8
                                                     clocks 3'b111:disconnect disable Other: invalid                           */
            uint32_t            : 24;
    } REG3C_b;
  } ;

  union {
    __IOM uint32_t REG40;                       /*!< Register description here                                                 */

