AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t BF60       : 7;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG40_b;
  } ;

  union {
    __IOM uint32_t REG44;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< 1: DP/DM will be sampled in HS Tx or Rx state 0: DP/DM will
                                                     be sampled only in Hs Rx state                                            */
      __IOM uint32_t BF11       : 1;            /*!< Disconnect squelch and comparator calibration bypass, active
                                                     high                                                                      */
      __IOM uint32_t BF42       : 3;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF65       : 2;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG44_b;
  } ;

  union {
    __IOM uint32_t REG48;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Enable TX shutdown, active LOW. This bit is only used for debug
                                                     purpose , nothing to do with the normal operation and signal
                                                     quality, keeping the default value is strongly recommended.               */
      __IOM uint32_t BF71       : 7;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG48_b;
  } ;

  union {
    __IOM uint32_t REG4C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG4C_b;
  } ;

  union {
    __IOM uint32_t REG50;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG50_b;
  } ;

  union {
    __IOM uint32_t REG54;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG54_b;
  } ;

  union {
    __IOM uint32_t REG58;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG58_b;
  } ;

  union {
    __IOM uint32_t REG5C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG5C_b;
  } ;

  union {
    __IOM uint32_t REG60;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG60_b;
  } ;

  union {
    __IOM uint32_t REG64;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 31;
    } REG64_b;
  } ;

  union {
    __IOM uint32_t REG68;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG68_b;
  } ;

  union {
    __IOM uint32_t REG6C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG6C_b;
  } ;

  union {
    __IOM uint32_t REG70;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< BF70 field description needed.                                            */
            uint32_t            : 24;
    } REG70_b;
  } ;

  union {
    __IOM uint32_t REG74;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Disconnect detection block input res load sel. 1'b0: disconnect
                                                     detection block input res load bypass 1'b1: disconnect
                                                     detection block input res load enable                                     */
      __IOM uint32_t BF31       : 3;            /*!< HS driver slew rate tuning 001:SR is weakest 111:SR is strongest.000
                                                     is forbidden.                                                             */
      __IOM uint32_t BF74       : 4;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG74_b;
  } ;

  union {
    __IOM uint32_t REG78;                       /*!< Register description here                                                 */

