AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t FRMNUM     : 16;           /*!< Frame Number. Read-only field containing the last received frame
                                                     number in bits 10:0, 15:11 read 0.                                        */
      __IOM uint32_t ENDPOINT   : 4;            /*!< Index selected endpoint.                                                  */
            uint32_t            : 4;
      __IOM uint32_t TestSE0NAK : 1;            /*!< Test_SE0_NAK Test Mode. The CPU sets this bit to enter the Test_SE0_NAK
                                                     test mode. In this mode, the USB Controller remains in
                                                     high-speed mode and responds to any valid IN token with
                                                     a NAK.                                                                    */
      __IOM uint32_t TestJ      : 1;            /*!< Test_J Test Mode. The CPU sets this bit to enter the Test_J
                                                     test mode. In this mode, the USB Controller - in high-speed
                                                     mode - transmits a continuous J on the bus.                               */
      __IOM uint32_t TestK      : 1;            /*!< Test_K Test Mode. The CPU sets this bit to enter the Test_K
                                                     test mode. In this mode, the USB Controller - in high-speed
                                                     mode - transmits a continuous K on the bus.                               */
      __IOM uint32_t TestPacket : 1;            /*!< Test Packet Test Mode. The CPU sets this bit to enter the Test_Packet
                                                     test mode. In this mode, the USB Controller - in high-speed
                                                     mode - repetitively transmits on the bus a 53-byte test
                                                     packet. Note: The 53-byte test packet must be loaded into
                                                     the Endpoint 0 FIFO before the test mode is entered.                      */
      __IOM uint32_t ForceHS    : 1;            /*!< Force High-speed Mode. The CPU sets this bit to force the USB
                                                     Controller into High-speed mode when it receives a USB
                                                     reset.                                                                    */
      __IOM uint32_t ForceFS    : 1;            /*!< Force Full-speed Mode. The CPU sets this bit to force the USB
                                                     Controller into Full-speed mode when it receives a USB
                                                     reset.                                                                    */
            uint32_t            : 2;
    } CFG3_b;
  } ;

  union {
    __IOM uint32_t IDX0;                        /*!< Provides additional control and status for IN transactions through
                                                     the currently-selected endpoint. (To avoid CMSIS conflicts,
                                                     the address here includes an additional offset of 0x1000.
                                                     Access to this register must take this into account.) The
                                                     value returned when this register is read reflects the
                                                     status of an endpoint specified by setting the endpoint
                                                     index in the CFG3_ENDPOINT field. When the endpoint index
                                                     (CFG3_ENDPOINT) = 0, this field provides status and control
                                                     of Endpoint 0. Also, the MAXPAYLOAD field defines the maximum
                                                     amount of data that can be transferred through the selected
                                                     IN endpoint in a single operation. There is a MAXPAYLOAD
                                                     for each IN endpoint (except Endpoint 0). Note that the
                                                     action initiated by setting a field in one of the IDXn
                                                     registers when the selected endpoint has not been configured
                                                     is undefined.                                                             */

    struct {
      __IOM uint32_t MAXPAYLOAD : 11;           /*!< Maximum Payload transmitted in a single transaction. The total
                                                     amount of data represented by MAXPAYLOAD x (PKTSPLITOPTION
                                                     + 1) must not exceed the FIFO size for the IN endpoint,
                                                     and should not exceed half the FIFO size if double-buffering
                                                     is required. Note: The value written here (multiplied by
                                                     PKTSPLITOPTION + 1 in the case of high-bandwidth Isochronous
                                                     transfers) must match the value given in the wMaxPacketSize
                                                     field of the Standard Endpoint Descriptor for the associated
                                                     endpoint (see USB Specification Revision 2.0, Chapter 9).
                                                     A mismatch could cause unexpected results.                                */
      __IOM uint32_t PKTSPLITOPTION : 5;        /*!< Packet Split Option. When IDX0_ISO = 1, this bit serves as the
                                                     MAXPAYLOAD multiplier for Isochronous IN transfers. When
                                                     IDX0_ISO = 0, this bit serves as the MAXPAYLOAD multiplier
                                                     for Bulk IN transfers.If IDX0_ISO = 0x1, this field sets
                                                     the multiplier for Isochronous transfers. For Isochronous
                                                     endpoints operating in High-Speed mode and with the High-bandwidth
                                                     option enabled, PKTSPLITOPTION may be either 2 or 3 (corresponding
                                                     to this field's bit 0 set or bit 1 set, respectively, and
                                                     bits[4:2] are ignored) and it specifies the maximum number
                                                     of such transactions that can take place in a single microframe.
                                                     If either bit 0 or bit 1 is non-zero, the USB Controller
                                                     will automatically split any data packet written to the
                                                     FIFO into up to 2 or 3 'USB' packets, each containing the
                                                     specified MAXPAYLOAD (or less). The maximum payload for
                                                     each transaction is 1024 bytes, so this allows up to 3072
                                                     bytes to be transmitted in each microframe. (For Isochronous
                                                     transfers in full-speed mode or if High-bandwidth is not
                                                     enabled, bits 0 and 1 are ignored.)If IDX0_ISO = 0x0, this
                                                     field sets the multiplier for Bulk transfers. The field
                                                     setting can be up to 31, and the multiplier, m, is (field
                                                     setting + 1). The multiplier defines the maximum number
                                                     of 'USB' packets of the specified MAXPAYLOAD data bytes
                                                     into which a single data packet placed in the FIFO should
                                                     be split prior to transfer. The data packet is required
                                                     to be an exact multiple of the MAXPAYLOAD, which is itself
                                                     required to be either 8, 16, 32, 64 or (in the case of
                                                     High Speed transfers) 512 bytes.                                          */
      __IOM uint32_t InPktRdyOutPktRdy : 1;     /*!< IN Packet Ready / OUT Packet Ready. When CFG3_ENDPOINT > 0,
                                                     this bit serves as the InPktRdy field. When CFG3_ENDPOINT
                                                     = 0, this bit serves as the OutPkyRdy bit.If CFG3_ENDPOINT
                                                     = 0x1-0x5, this bit serves as the InPktRdy field. Set this
                                                     bit after loading a data packet into the FIFO. It is cleared
                                                     automatically when a data packet has been transmitted.
                                                     If the FIFO is double-buffered, it is also automatically
                                                     cleared when there is space for a second packet in the
                                                     FIFO. An interrupt is generate (if enabled) when the bit
                                                     is cleared.If CFG3_ENDPOINT = 0x0, this bit serves as the
                                                     OutPkyRdy bit. This bit is set when a data packet has been
                                                     received. An interrupt is generate when this bit is set
                                                     (if enabled). The CPU clears this bit by setting the ServicedOutPktRdy
                                                     bit.                                                                      */
      __IOM uint32_t FIFONotEmptyInPktRdy : 1;  /*!< FIFO Not Empty / IN Packet Ready. When CFG3_ENDPOINT = 1 to
                                                     5, this bit serves as the FIFONotEmpty field. When CFG3_ENDPOINT
                                                     = 0, this bit serves as the InPktRdy bit.If CFG3_ENDPOINT
                                                     = 0x1-0x5, this bit serves as the FIFONotEmpty field. It
                                                     is set when there is at least 1 packet in the IN FIFO.If
                                                     CFG3_ENDPOINT = 0x0, this bit serves as the InPktRdy bit.
                                                     Set this bit after loading a data packet into the FIFO.
                                                     It is cleared automatically when the data packet has been
                                                     transmitted. An interrupt is generated when this bit is
                                                     cleared (if enabled).                                                     */
      __IOM uint32_t UnderRunSentStall : 1;     /*!< Under Run / Sent Stall. When CFG3_ENDPOINT = 1 to 5, this bit
                                                     serves as the UnderRun field. When CFG3_ENDPOINT = 0, this
                                                     bit serves as the SentStall field.If CFG3_ENDPOINT = 0x1-0x5,
                                                     this bit serves as the UnderRun field. In ISO mode this
                                                     bit is set when a zero length data packet is sent after
                                                     receiving an IN token with the InPktRdy bit not set. In
                                                     Bulk/Interrupt mode, this bit is set when a NAK is returned
                                                     in response to an IN token. The CPU should clear this bit.If
                                                     CFG3_ENDPOINT = 0x0, this bit serves as the SentStall field.
                                                     This bit is set when a STALL handshake is transmitted.
                                                     The CPU should clear this bit.                                            */
      __IOM uint32_t FlushFIFODataEnd : 1;      /*!< When CFG3_ENDPOINT = 1 to 5, this bit serves as the FlushFIFO
                                                     field. When CFG3_ENDPOINT = 0, this bit serves as the DataEnd
                                                     bit.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the
                                                     FlushFIFO field. Setting this bit flushes the next packet
                                                     to be transmitted from the endpoint IN FIFO. The FIFO pointer
                                                     is reset and the InPktRdy bit is cleared. May be set simultaneously
                                                     with InPktRdy to abort the packet that has just been loaded
                                                     into the FIFO.Note 1: FlushFIFO should only be set when
                                                     InPktRdy is set (at other times, it may cause data corruption).Note
                                                     2: If the FIFO contains two packets, FlushFIFO may need
                                                     to be set twice to completely clear the FIFO.If CFG3_ENDPOINT
                                                     = 0x0, this bit serves as the DataEnd bit. Set this bit
                                                     when (1) setting InPktRdy for the last data packet, (2)
                                                     clearing OutPktRdy after unloading the last data packet,
                                                     or (3) setting InPktRdy for a zero length data packet.It
                                                     is cleared automatically.                                                 */
      __IOM uint32_t SendStallSetupEnd : 1;     /*!< When CFG3_ENDPOINT = 1 to 5, this bit serves as the SendStall
                                                     field. When CFG3_ENDPOINT = 0, this bit serves as the SetupEnd
                                                     field.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the
                                                     SendStall field. Setting this bit issues a STALL handshake
                                                     to an IN token. The CPU clears this bit to terminate the
                                                     stall condition.Note: This bit has no effect when the endpoint
                                                     is being used for Isochronous transfers.If CFG3_ENDPOINT
                                                     = 0x0, this bit serves as the SetupEnd field. It is set
                                                     when a control transaction ends before the DataEnd bit
                                                     has been set. An interrupt will be generated and the FIFO
                                                     flushed at this time. The bit is cleared by the CPU writing
                                                     a 1 to the ServicedSetupEnd bit.                                          */
      __IOM uint32_t SentStallSendStall : 1;    /*!< Sent Stall / Send Stall. When CFG3_ENDPOINT = 1 to 5, this bit
                                                     serves as the SentStall field. When CFG3_ENDPOINT = 0,
                                                     this bit serves as the SendStall function.If CFG3_ENDPOINT
                                                     = 0x1-0x5, this bit serves as the SentStall field. It is
                                                     set when a STALL handshake is transmitted. The FIFO is
                                                     flushed and the InPktRdy bit is cleared. The CPU should
                                                     clear this bit.If CFG3_ENDPOINT = 0x0, this bit serves
                                                     as the SendStall field. The CPU sets this bit to terminate
                                                     the current transaction. The STALL handshake will be transmitted
                                                     and then this bit will be cleared automatically. Note:
                                                     This behavior differs from that of the SendStall bits associated
                                                     with additional IN/OUT endpoints, which need to be cleared
                                                     by the CPU.                                                               */
      __IOM uint32_t ClrDataTogServicedOutPktRdy : 1;/*!< Clear Data Toggle / Serviced OUT Packet Ready. When CFG3_ENDPOINT
                                                     = 1 to 5, this bit serves as the ClrDataTog field. When
                                                     CFG3_ENDPOINT = 0, this bit serves as the ServicedOutPktReady
                                                     field.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the
                                                     ClrDataTog field. Setting this bit resets the endpoint
                                                     IN data toggle to 0.If CFG3_ENDPOINT = 0x0, this bit serves
                                                     as the ServicedOutPktReady field. The CPU writes a 1 to
                                                     this bit to clear the OutPktRdy bit. This bit is cleared
                                                     automatically.                                                            */
      __IOM uint32_t IncompTxServiceSetupEnd : 1;/*!< Incomplete Transmission / Service Setup End. When CFG3_ENDPOINT
                                                     = 1 to 5, this bit serves as the IncompTx field. When CFG3_ENDPOINT
                                                     = 0, this bit serves as the ServiceSetupEnd field.If CFG3_ENDPOINT
                                                     = 0x1-0x5, then this bit serves as the IncompTx field.
                                                     If the endpoint is being used for high-bandwidth Isochronous
                                                     transfers, this bit is set to indicate when a large packet
                                                     has been split into 2 or 3 packets for transmission but
                                                     insufficient IN tokens have been received to send all the
                                                     parts. The remainder of the current packet is then flushed
                                                     from the FIFO (but any second packet in the FIFO will remain).
                                                     Note: In anything other than a high bandwidth Isochronous
                                                     transfer, this bit will always return 0.                                  */
      __IOM uint32_t D0         : 1;            /*!< Unused, always return 0.                                                  */
      __IOM uint32_t DPktBufDis : 1;            /*!< Double Packet Buffer Disable. This bit is used to control the
                                                     use of Double Packet Buffering. It is ignored when Dynamic
                                                     FIFO sizing is enabled. Clearing this bit does NOT necessarily
                                                     enable Double Packet Buffering but rather allows Double
                                                     Packet Buffering to be determined by the Endpoint's IDX2_INFIFOSZ
                                                     setting and MAXPAYLOAD size relationship. Default is enabled.             */
            uint32_t            : 1;
      __IOM uint32_t FrcDataTog : 1;            /*!< Force Data Toggle. The CPU sets this bit to force the endpoint's
                                                     IN data toggle to switch after each data packet is sent
                                                     regardless of whether an ACK was received. This can be
                                                     used by Interrupt IN endpoints that are used to communicate
                                                     rate feedback for Isochronous endpoints.                                  */
            uint32_t            : 1;
      __IOM uint32_t Mode       : 1;            /*!< OUT/IN Mode. The CPU sets this bit to enable the endpoint direction
                                                     as IN or OUT. Note: Only valid where the endpoint FIFO
                                                     is used for both IN and OUT transactions, otherwise ignored.              */
      __IOM uint32_t ISO        : 1;            /*!< Isochronous Transfers. The CPU sets this bit to enable the IN
                                                     endpoint for Isochronous transfers (ISO mode) or for Bulk/Interrupt
                                                     transfers.                                                                */
      __IOM uint32_t AutoSet    : 1;            /*!< Automatically Set InPktRdy. When set, the FIFONotEmptyInPktRdy
                                                     field (for IN Endpoint 0) or InPktRdyOutPktRdy field (for
                                                     IN Endpoint 1-5) in this register will be automatically
                                                     set when data of the maximum packet size (set in MAXPAYLOAD
                                                     field) is loaded into the IN FIFO.                                        */
    } IDX0_b;
  } ;

  union {
    __IOM uint32_t IDX1;                        /*!< Provides control and status bits for OUT transactions through
                                                     the currently-selected endpoint. It is reset to 0. The
                                                     value returned when this register is read reflects the
                                                     status of an endpoint specified by setting the endpoint
                                                     index in the CFG3_ENDPOINT field. Also, the MAXPAYLOAD
                                                     field defines the maximum amount of data that can be transferred
                                                     through the selected OUT endpoint in a single operation.
                                                     There is a MAXPAYLOAD for each OUT endpoint (except Endpoint
                                                     0). Note that the action initiated by setting a field in
                                                     one of the IDXn registers when the selected endpoint has
                                                     not been configured is undefined.                                         */

