AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t MAXPAYLOAD : 11;           /*!< Maximum Payload transmitted in a single transaction. The value
                                                     set can be up to 1024 bytes but is subject to the constraints
                                                     placed by the USB Specification on packet sizes for Bulk,
                                                     Interrupt and Isochronous transfers in Fullspeed and High-speed
                                                     operations. The total amount of data represented by MAXPAYLOAD
                                                     x (PKTSPLITOPTION + 1) must not exceed the FIFO size for
                                                     the OUT endpoint, and should not exceed half the FIFO size
                                                     if double-buffering is required. Note: The value written
                                                     here (multiplied by m in the case of high-bandwidth Isochronous
                                                     transfers) must match the value given in the wMaxPacketSize
                                                     field of the Standard Endpoint Descriptor for the associated
                                                     endpoint (see USB Specification Revision 2.0, Chapter 9).
                                                     A mismatch could cause nexpected results.                                 */
      __IOM uint32_t PKTSPLITOPTION : 5;        /*!< Packet Split Option. When IDX1_ISO = 1, this bit serves as the
                                                     MAXPAYLOAD multiplier for Isochronous OUT transfers. When
                                                     IDX1_ISO = 0, this bit serves as the MAXPAYLOAD multiplier
                                                     for Bulk IN transfers.If IDX1_ISO = 0x1, this field sets
                                                     the multiplier for Isochronous transfers. For Isochronous
                                                     endpoints operating in High-Speed mode and with the High-bandwidth
                                                     option enabled, PKTSPLITOPTION may be either 2 or 3 (corresponding
                                                     to this field's bit 0 set or bit 1 set, respectively, and
                                                     bits[4:2] are ignored) and it specifies the maximum number
                                                     of such transactions that can take place in a single microframe.
                                                     If either bit 0 or bit 1 is non-zero, the USB Controller
                                                     will automatically combine the separate USB packets received
                                                     in any microframe into a single packet within the OUT FIFO.
                                                     The maximum payload for each transaction is 1024 bytes,
                                                     so this allows up to 3072 bytes to be received in each
                                                     microframe. (For Isochronous transfers in full-speed mode
                                                     or if high-bandwidth is not enabled, bits 0 and 1 are ignored.)If
                                                     IDX1_ISO = 0x0, this field sets the multiplier for Bulk
                                                     transfers. The field setting can be up to 31, and the multiplier,
                                                     m, is (field setting + 1). The multiplier defines the number
                                                     of USB packets of the specified payload which are to be
                                                     combined into a single data packet within the FIFO.                       */
      __IOM uint32_t OutPktRdy  : 1;            /*!< OUT Packet Ready. This bit is set when a data packet has been
                                                     received. Clear this bit when the packet has been unloaded
                                                     from the OUT FIFO. An interrupt is generated (if enabled)
                                                     when the bit is set.                                                      */
      __IOM uint32_t FIFOFull   : 1;            /*!< FIFO Full. When set, this bit indicates that no more packets
                                                     can be loaded into the OUT FIFO.                                          */
      __IOM uint32_t OverRun    : 1;            /*!< Overrun Condition. Indicates an overrun.If IDX1_ISO = 0x1 (ISO
                                                     mode), this bit is set if an OUT packet arrives while FIFOFull
                                                     is set, i.e., the OUT packet cannot be loaded into the
                                                     OUT FIFO. The CPU should clear this bit.If IDX1_ISO = 0x0
                                                     (Bulk mode), this field always returns zero. This field
                                                     is only valid when the endpoint is operating in ISO mode.                 */
      __IOM uint32_t DataError  : 1;            /*!< Data Error. Indicates a CRC error.If IDX1_ISO = 0x1 (ISO mode),
                                                     this bit is set at the same time that OutPktRdy is set
                                                     if the data packet has a CRC error. It is cleared when
                                                     OutPktRdy is cleared.If IDX1_ISO = 0x0 (Bulk mode), this
                                                     field always returns zero. This field is only valid when
                                                     the endpoint is operating in ISO mode.                                    */
      __IOM uint32_t FlushFIFO  : 1;            /*!< Flush FIFO. Set this bit to flush the next packet to be read
                                                     from the endpoint OUT FIFO. The FIFO pointer is reset and
                                                     the OutPktRdy bit is cleared. FlushFIFO should only be
                                                     used when OutPktRdy is set. At other times, it may cause
                                                     data to be corrupted. If the FIFO is double-buffered, FlushFIFO
                                                     may need to be set twice to completely clear the FIFO.                    */
      __IOM uint32_t SendStall  : 1;            /*!< Send Stall. Issues a STALL handshake to a DATA packet.If IDX1_ISO
                                                     = 0x1, this bit has no effect when the endpoint is being
                                                     used for Isochronous transfers.If IDX1_ISO = 0x0, this
                                                     field enables Stall Handshakes for Bulk/Interrupt transactions.
                                                     Set this bit to issue a STALL handshake to a DATA packet.
                                                     Clear this bit to terminate the stall condition.                          */
      __IOM uint32_t SentStall  : 1;            /*!< Sent Stall. This bit is set when a STALL handshake is transmitted.
                                                     The CPU should clear this bit.                                            */
      __IOM uint32_t ClrDataTog : 1;            /*!< Clear Data Toggle. Set this bit to reset the endpoint data toggle
                                                     to 0.                                                                     */
      __IOM uint32_t IncompRx   : 1;            /*!< Incomplete Receive. This bit is set in a high-bandwidth Isochronous
                                                     transfer if the packet in the OUT FIFO is incomplete because
                                                     parts of the data were not received. It is cleared when
                                                     OutPktRdy is cleared. Note: In anything other than a high-bandwidth
                                                     Isochronous transfer, this bit will always return 0.                      */
      __IOM uint32_t DPktBufDis : 1;            /*!< Double Packet Buffer Disable. This bit is used to control the
                                                     use of Double Packet Buffering. It is ignored when Dynamic
                                                     FIFO sizing is enabled. Clearing this bit does NOT necessarily
                                                     enable Double Packet Buffering but rather allows Double
                                                     Packet Buffering to be determined by the Endpoint's IDX2_OUTFIFOSZ
                                                     setting and MAXPAYLOAD size relationship. Default is enabled.             */
            uint32_t            : 2;
      __IOM uint32_t DisNye     : 1;            /*!< Disable NYET Handshakes / PID Error. For Bulk/Interrupt transactions,
                                                     this bit disable the sending of NYET handshakes. For Bulk/Interrupt
                                                     transactions, indicates PID errors.If IDX1_ISO = 0x1, this
                                                     field is read-only and, when set, indicates a PID error
                                                     in the received packet for Isochronous transfers.If IDX1_ISO
                                                     = 0x0, this field disables NYET Handshakes for Bulk/Interrupt
                                                     transactions. Set this bit to disable the sending of NYET
                                                     handshakes. When set, all successfully received OUT packets
                                                     are ACK'd including at the point at which the FIFO becomes
                                                     full.Note: This bit has an effect only in High-speed mode,
                                                     when it should be set for all Interrupt endpoints.                        */
            uint32_t            : 1;
      __IOM uint32_t ISO        : 1;            /*!< Isochronous Transfers. The CPU sets this bit to enable the OUT
                                                     endpoint for either Isochronous transfers (ISO mode) or
                                                     for Bulk/Interrupt transfers.                                             */
      __IOM uint32_t AutoClear  : 1;            /*!< Automatically Clear OutPktRdy.                                            */
    } IDX1_b;
  } ;

  union {
    __IOM uint32_t IDX2;                        /*!< Contains the outcount value for number of received bytes in
                                                     the packet in the OUT FIFO, and the configurable IN and
                                                     OUT Endpoint FIFO size.                                                   */

