AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
    struct {
      __IOM uint32_t RET1N      : 1;            /*!< Retention mode 1 enable, active-LOW                                       */
      __IOM uint32_t EMA        : 3;            /*!< Extra margin adjustment                                                   */
      __IOM uint32_t EMAS       : 1;            /*!< Extra margin adjustment sense amplifier pulse                             */
      __IOM uint32_t EMAW       : 2;            /*!< Extra margin adjustment for write operations                              */
      __IOM uint32_t RAWLM      : 2;            /*!< SRAM Adjustment for margin for this read assist scheme                    */
      __IOM uint32_t RAWL       : 1;            /*!< SRAM Read assist enable                                                   */
      __IOM uint32_t WABLM      : 3;            /*!< SRAM No margin adjustment                                                 */
      __IOM uint32_t WABL       : 1;            /*!< SRAM write assist enable                                                  */
      __IOM uint32_t STOV       : 1;            /*!< SRAM self-timed override                                                  */
            uint32_t            : 17;
    } SRAMCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[3];

  union {
    __IOM uint32_t UTMISTICKYSTATUS;            /*!< This read only register provides the results from the PHY OBS
                                                     port controlled by reg 0x20[5:4]. IF any bits are set,
                                                     the bits are sticky. Clear this register using the OBSCLRSTAT
                                                     register.                                                                 */

    struct {
      __IOM uint32_t obsportstciky : 2;         /*!< These bits are read only status bits from the PHY OBS port                */
            uint32_t            : 30;
    } UTMISTICKYSTATUS_b;
  } ;

  union {
    __IOM uint32_t OBSCLRSTAT;                  /*!< Clears all bits in the sticky obs status register.                        */

    struct {
      __IOM uint32_t CLRSTAT    : 1;            /*!< Writing a 1 to this bit clears all bits in the UTMISTICKYSTATUS
                                                     register.                                                                 */
            uint32_t            : 31;
    } OBSCLRSTAT_b;
  } ;

  union {
    __IOM uint32_t DPDMPULLDOWN;                /*!< Enables a pulldown resistor(15K) on D+ or D-                              */

    struct {
      __IOM uint32_t DMPULLDOWN : 1;            /*!< Enables a pulldown resistor(15K) on D-                                    */
      __IOM uint32_t DPPULLDOWN : 1;            /*!< Enables a pulldown resistor(15K) on D+                                    */
            uint32_t            : 30;
    } DPDMPULLDOWN_b;
  } ;

  union {
    __IOM uint32_t BCDETSTATUS;                 /*!< USB Battery Charge Detenction Registers                                   */

    struct {
      __IOM uint32_t DPATTACHED : 1;            /*!< Data pin attachment detected                                              */
      __IOM uint32_t CPDETECTED : 1;            /*!< Charging port detected                                                    */
      __IOM uint32_t DCPDETECTED : 1;           /*!< Dedicated charging port detected                                          */
            uint32_t            : 1;
      __IOM uint32_t DPCOMPOUT  : 1;            /*!< DP comparator output                                                      */
      __IOM uint32_t DMCOMPOUT  : 1;            /*!< DM comparator output                                                      */
            uint32_t            : 26;
    } BCDETSTATUS_b;
  } ;

  union {
    __IOM uint32_t BCDETCRTL1;                  /*!< Battery Charging detection main control register                          */

    struct {
      __IOM uint32_t BCWEAKPULLUPEN : 1;        /*!< Enables weak source current to DP and DM                                  */
      __IOM uint32_t BCWEAKPULLDOWNEN : 1;      /*!< Enables weak sink current on DP and DM                                    */
      __IOM uint32_t IDMSINKEN  : 1;            /*!< Enables DM current sink                                                   */
      __IOM uint32_t IDPSRCEN   : 1;            /*!< Enables DP current source                                                 */
      __IOM uint32_t VDPSRCEN   : 1;            /*!< Enables DP voltage source                                                 */
      __IOM uint32_t RDMPDWNEN  : 1;            /*!< Enables DM BC 1.2 pull-down resistor                                      */
      __IOM uint32_t VDMSRCEN   : 1;            /*!< Enables DM voltage source                                                 */
      __IOM uint32_t IDPSINKEN  : 1;            /*!< Enables DP current sink                                                   */
      __IOM uint32_t USBDCOMPREF : 2;           /*!< Sets DP/DM vendor-specific comparator ref voltage                         */
            uint32_t            : 1;
      __IOM uint32_t USBDCOMPEN : 1;            /*!< Enables DP/DM vendor-specific detection comparator                        */
            uint32_t            : 19;
      __IOM uint32_t USBSWRESET : 1;            /*!< Holds a USB controller and PHY in the reset for BC detection              */
    } BCDETCRTL1_b;
  } ;

  union {
    __IOM uint32_t BCDETCRTL2;                  /*!< Battery Charging auxillary detection control register                     */

    struct {
      __IOM uint32_t CHARGEDETBYP : 1;          /*!< BC detection bypass                                                       */
      __IOM uint32_t FORCEDPATTACHED : 1;       /*!< Force output dp_attached                                                  */
      __IOM uint32_t FORCECPDET : 1;            /*!< Force output charging port detected                                       */
      __IOM uint32_t FORCEDCPDET : 1;           /*!< Force output dedicated charging port detected                             */
            uint32_t            : 4;
      __IOM uint32_t BCWEAKPULLUPTUNE : 2;      /*!< Weak source resistor to both DP and DM tuning. Trimmable.                 */
      __IOM uint32_t BCWEAKPULLDOWNTUNE : 2;    /*!< Weak sink resistor to both DP and DM tuning. Trimmable.                   */
            uint32_t            : 20;
    } BCDETCRTL2_b;
  } ;
} USB_Type;                                     /*!< Size = 8236 (0x202c)                                                      */



/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Voltage Comparator (VCOMP)
  */

