AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDSP0H_Msk (0x10000UL)           /*!< IGNOREDSP0H (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDSPA_Pos (15UL)                 /*!< IGNOREDSPA (Bit 15)                                   */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDSPA_Msk (0x8000UL)             /*!< IGNOREDSPA (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREAUD_Pos (14UL)                  /*!< IGNOREAUD (Bit 14)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREAUD_Msk (0x4000UL)              /*!< IGNOREAUD (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREUSBPHY_Pos (13UL)               /*!< IGNOREUSBPHY (Bit 13)                                 */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREUSBPHY_Msk (0x2000UL)           /*!< IGNOREUSBPHY (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREUSB_Pos (12UL)                  /*!< IGNOREUSB (Bit 12)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREUSB_Msk (0x1000UL)              /*!< IGNOREUSB (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_LEGACYVRLPOVR_IGNORESDIO_Pos (11UL)                 /*!< IGNORESDIO (Bit 11)                                   */
#define PWRCTRL_LEGACYVRLPOVR_IGNORESDIO_Msk (0x800UL)              /*!< IGNORESDIO (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNORECRYPTO_Pos (10UL)               /*!< IGNORECRYPTO (Bit 10)                                 */
#define PWRCTRL_LEGACYVRLPOVR_IGNORECRYPTO_Msk (0x400UL)            /*!< IGNORECRYPTO (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISPPHY_Pos (9UL)               /*!< IGNOREDISPPHY (Bit 9)                                 */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISPPHY_Msk (0x200UL)           /*!< IGNOREDISPPHY (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISP_Pos (8UL)                  /*!< IGNOREDISP (Bit 8)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISP_Msk (0x100UL)              /*!< IGNOREDISP (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREGFX_Pos (7UL)                   /*!< IGNOREGFX (Bit 7)                                     */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREGFX_Msk (0x80UL)                /*!< IGNOREGFX (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREMSPI_Pos (6UL)                  /*!< IGNOREMSPI (Bit 6)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREMSPI_Msk (0x40UL)               /*!< IGNOREMSPI (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPE_Pos (5UL)                  /*!< IGNOREHCPE (Bit 5)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPE_Msk (0x20UL)               /*!< IGNOREHCPE (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPD_Pos (4UL)                  /*!< IGNOREHCPD (Bit 4)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPD_Msk (0x10UL)               /*!< IGNOREHCPD (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPC_Pos (3UL)                  /*!< IGNOREHCPC (Bit 3)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPC_Msk (0x8UL)                /*!< IGNOREHCPC (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPB_Pos (2UL)                  /*!< IGNOREHCPB (Bit 2)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPB_Msk (0x4UL)                /*!< IGNOREHCPB (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPA_Pos (1UL)                  /*!< IGNOREHCPA (Bit 1)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREHCPA_Msk (0x2UL)                /*!< IGNOREHCPA (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREIOS_Pos (0UL)                   /*!< IGNOREIOS (Bit 0)                                     */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREIOS_Msk (0x1UL)                 /*!< IGNOREIOS (Bitfield-Mask: 0x01)                       */
/* =======================================================  VRSTATUS  ======================================================== */
#define PWRCTRL_VRSTATUS_SIMOBUCKST_Pos   (4UL)                     /*!< SIMOBUCKST (Bit 4)                                    */
#define PWRCTRL_VRSTATUS_SIMOBUCKST_Msk   (0x30UL)                  /*!< SIMOBUCKST (Bitfield-Mask: 0x03)                      */
#define PWRCTRL_VRSTATUS_MEMLDOST_Pos     (2UL)                     /*!< MEMLDOST (Bit 2)                                      */
#define PWRCTRL_VRSTATUS_MEMLDOST_Msk     (0xcUL)                   /*!< MEMLDOST (Bitfield-Mask: 0x03)                        */
#define PWRCTRL_VRSTATUS_CORELDOST_Pos    (0UL)                     /*!< CORELDOST (Bit 0)                                     */
#define PWRCTRL_VRSTATUS_CORELDOST_Msk    (0x3UL)                   /*!< CORELDOST (Bitfield-Mask: 0x03)                       */
/* =====================================================  PWRWEIGHTULP0  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART3_Pos (28UL)                 /*!< WTULPUART3 (Bit 28)                                   */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART3_Msk (0xf0000000UL)         /*!< WTULPUART3 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART2_Pos (24UL)                 /*!< WTULPUART2 (Bit 24)                                   */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART2_Msk (0xf000000UL)          /*!< WTULPUART2 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART1_Pos (20UL)                 /*!< WTULPUART1 (Bit 20)                                   */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART1_Msk (0xf00000UL)           /*!< WTULPUART1 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART0_Pos (16UL)                 /*!< WTULPUART0 (Bit 16)                                   */
#define PWRCTRL_PWRWEIGHTULP0_WTULPUART0_Msk (0xf0000UL)            /*!< WTULPUART0 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP0_WTULPIOS_Pos (12UL)                   /*!< WTULPIOS (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTULP0_WTULPIOS_Msk (0xf000UL)               /*!< WTULPIOS (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTULP0_WTULPDSP1_Pos (8UL)                   /*!< WTULPDSP1 (Bit 8)                                     */
#define PWRCTRL_PWRWEIGHTULP0_WTULPDSP1_Msk (0xf00UL)               /*!< WTULPDSP1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP0_WTULPDSP0_Pos (4UL)                   /*!< WTULPDSP0 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTULP0_WTULPDSP0_Msk (0xf0UL)                /*!< WTULPDSP0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP0_WTULPMCU_Pos (0UL)                    /*!< WTULPMCU (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTULP0_WTULPMCU_Msk (0xfUL)                  /*!< WTULPMCU (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTULP1  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM7_Pos (28UL)                  /*!< WTULPIOM7 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM7_Msk (0xf0000000UL)          /*!< WTULPIOM7 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM6_Pos (24UL)                  /*!< WTULPIOM6 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM6_Msk (0xf000000UL)           /*!< WTULPIOM6 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM5_Pos (20UL)                  /*!< WTULPIOM5 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM5_Msk (0xf00000UL)            /*!< WTULPIOM5 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM4_Pos (16UL)                  /*!< WTULPIOM4 (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM4_Msk (0xf0000UL)             /*!< WTULPIOM4 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM3_Pos (12UL)                  /*!< WTULPIOM3 (Bit 12)                                    */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM3_Msk (0xf000UL)              /*!< WTULPIOM3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM2_Pos (8UL)                   /*!< WTULPIOM2 (Bit 8)                                     */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM2_Msk (0xf00UL)               /*!< WTULPIOM2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM1_Pos (4UL)                   /*!< WTULPIOM1 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM1_Msk (0xf0UL)                /*!< WTULPIOM1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM0_Pos (0UL)                   /*!< WTULPIOM0 (Bit 0)                                     */
#define PWRCTRL_PWRWEIGHTULP1_WTULPIOM0_Msk (0xfUL)                 /*!< WTULPIOM0 (Bitfield-Mask: 0x0f)                       */
/* =====================================================  PWRWEIGHTULP2  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP2_WTULPUSB_Pos (28UL)                   /*!< WTULPUSB (Bit 28)                                     */
#define PWRCTRL_PWRWEIGHTULP2_WTULPUSB_Msk (0xf0000000UL)           /*!< WTULPUSB (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTULP2_WTULPSDIO_Pos (24UL)                  /*!< WTULPSDIO (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPSDIO_Msk (0xf000000UL)           /*!< WTULPSDIO (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP2_WTULPCRYPTO_Pos (20UL)                /*!< WTULPCRYPTO (Bit 20)                                  */
#define PWRCTRL_PWRWEIGHTULP2_WTULPCRYPTO_Msk (0xf00000UL)          /*!< WTULPCRYPTO (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP2_WTULPDISP_Pos (16UL)                  /*!< WTULPDISP (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPDISP_Msk (0xf0000UL)             /*!< WTULPDISP (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP2_WTULPGFX_Pos (12UL)                   /*!< WTULPGFX (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTULP2_WTULPGFX_Msk (0xf000UL)               /*!< WTULPGFX (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI1_Pos (8UL)                  /*!< WTULPMSPI1 (Bit 8)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI1_Msk (0xf00UL)              /*!< WTULPMSPI1 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI0_Pos (4UL)                  /*!< WTULPMSPI0 (Bit 4)                                    */
#define PWRCTRL_PWRWEIGHTULP2_WTULPMSPI0_Msk (0xf0UL)               /*!< WTULPMSPI0 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP2_WTULPADC_Pos (0UL)                    /*!< WTULPADC (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTULP2_WTULPADC_Msk (0xfUL)                  /*!< WTULPADC (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTULP3  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP3_WTULPMSPI2_Pos (28UL)                 /*!< WTULPMSPI2 (Bit 28)                                   */
#define PWRCTRL_PWRWEIGHTULP3_WTULPMSPI2_Msk (0xf0000000UL)         /*!< WTULPMSPI2 (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDADC_Pos (16UL)                /*!< WTULPAUDADC (Bit 16)                                  */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDADC_Msk (0xf0000UL)           /*!< WTULPAUDADC (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDPB_Pos (12UL)                 /*!< WTULPAUDPB (Bit 12)                                   */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDPB_Msk (0xf000UL)             /*!< WTULPAUDPB (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDREC_Pos (8UL)                 /*!< WTULPAUDREC (Bit 8)                                   */
#define PWRCTRL_PWRWEIGHTULP3_WTULPAUDREC_Msk (0xf00UL)             /*!< WTULPAUDREC (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDBG_Pos (4UL)                    /*!< WTULPDBG (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDBG_Msk (0xf0UL)                 /*!< WTULPDBG (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDSPA_Pos (0UL)                   /*!< WTULPDSPA (Bit 0)                                     */
#define PWRCTRL_PWRWEIGHTULP3_WTULPDSPA_Msk (0xfUL)                 /*!< WTULPDSPA (Bitfield-Mask: 0x0f)                       */
/* =====================================================  PWRWEIGHTULP4  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM3_Pos (28UL)                  /*!< WTULPPDM3 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM3_Msk (0xf0000000UL)          /*!< WTULPPDM3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM2_Pos (24UL)                  /*!< WTULPPDM2 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM2_Msk (0xf000000UL)           /*!< WTULPPDM2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM1_Pos (20UL)                  /*!< WTULPPDM1 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM1_Msk (0xf00000UL)            /*!< WTULPPDM1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM0_Pos (16UL)                  /*!< WTULPPDM0 (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTULP4_WTULPPDM0_Msk (0xf0000UL)             /*!< WTULPPDM0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S1_Pos (4UL)                   /*!< WTULPI2S1 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S1_Msk (0xf0UL)                /*!< WTULPI2S1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S0_Pos (0UL)                   /*!< WTULPI2S0 (Bit 0)                                     */
#define PWRCTRL_PWRWEIGHTULP4_WTULPI2S0_Msk (0xfUL)                 /*!< WTULPI2S0 (Bitfield-Mask: 0x0f)                       */
/* =====================================================  PWRWEIGHTULP5  ===================================================== */
#define PWRCTRL_PWRWEIGHTULP5_WTULPUSBPHY_Pos (4UL)                 /*!< WTULPUSBPHY (Bit 4)                                   */
#define PWRCTRL_PWRWEIGHTULP5_WTULPUSBPHY_Msk (0xf0UL)              /*!< WTULPUSBPHY (Bitfield-Mask: 0x0f)                     */
#define PWRCTRL_PWRWEIGHTULP5_WTULPDISPPHY_Pos (0UL)                /*!< WTULPDISPPHY (Bit 0)                                  */
#define PWRCTRL_PWRWEIGHTULP5_WTULPDISPPHY_Msk (0xfUL)              /*!< WTULPDISPPHY (Bitfield-Mask: 0x0f)                    */
/* =====================================================  PWRWEIGHTLP0  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART3_Pos (28UL)                   /*!< WTLPUART3 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART3_Msk (0xf0000000UL)           /*!< WTLPUART3 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART2_Pos (24UL)                   /*!< WTLPUART2 (Bit 24)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART2_Msk (0xf000000UL)            /*!< WTLPUART2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART1_Pos (20UL)                   /*!< WTLPUART1 (Bit 20)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART1_Msk (0xf00000UL)             /*!< WTLPUART1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART0_Pos (16UL)                   /*!< WTLPUART0 (Bit 16)                                    */
#define PWRCTRL_PWRWEIGHTLP0_WTLPUART0_Msk (0xf0000UL)              /*!< WTLPUART0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPIOS_Pos  (12UL)                    /*!< WTLPIOS (Bit 12)                                      */
#define PWRCTRL_PWRWEIGHTLP0_WTLPIOS_Msk  (0xf000UL)                /*!< WTLPIOS (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP1_Pos (8UL)                     /*!< WTLPDSP1 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP1_Msk (0xf00UL)                 /*!< WTLPDSP1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP0_Pos (4UL)                     /*!< WTLPDSP0 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTLP0_WTLPDSP0_Msk (0xf0UL)                  /*!< WTLPDSP0 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP0_WTLPMCU_Pos  (0UL)                     /*!< WTLPMCU (Bit 0)                                       */
#define PWRCTRL_PWRWEIGHTLP0_WTLPMCU_Msk  (0xfUL)                   /*!< WTLPMCU (Bitfield-Mask: 0x0f)                         */
/* =====================================================  PWRWEIGHTLP1  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM7_Pos (28UL)                    /*!< WTLPIOM7 (Bit 28)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM7_Msk (0xf0000000UL)            /*!< WTLPIOM7 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM6_Pos (24UL)                    /*!< WTLPIOM6 (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM6_Msk (0xf000000UL)             /*!< WTLPIOM6 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM5_Pos (20UL)                    /*!< WTLPIOM5 (Bit 20)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM5_Msk (0xf00000UL)              /*!< WTLPIOM5 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM4_Pos (16UL)                    /*!< WTLPIOM4 (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM4_Msk (0xf0000UL)               /*!< WTLPIOM4 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM3_Pos (12UL)                    /*!< WTLPIOM3 (Bit 12)                                     */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM3_Msk (0xf000UL)                /*!< WTLPIOM3 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM2_Pos (8UL)                     /*!< WTLPIOM2 (Bit 8)                                      */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM2_Msk (0xf00UL)                 /*!< WTLPIOM2 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM1_Pos (4UL)                     /*!< WTLPIOM1 (Bit 4)                                      */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM1_Msk (0xf0UL)                  /*!< WTLPIOM1 (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM0_Pos (0UL)                     /*!< WTLPIOM0 (Bit 0)                                      */
#define PWRCTRL_PWRWEIGHTLP1_WTLPIOM0_Msk (0xfUL)                   /*!< WTLPIOM0 (Bitfield-Mask: 0x0f)                        */
/* =====================================================  PWRWEIGHTLP2  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP2_WTLPUSB_Pos  (28UL)                    /*!< WTLPUSB (Bit 28)                                      */
#define PWRCTRL_PWRWEIGHTLP2_WTLPUSB_Msk  (0xf0000000UL)            /*!< WTLPUSB (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTLP2_WTLPSDIO_Pos (24UL)                    /*!< WTLPSDIO (Bit 24)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPSDIO_Msk (0xf000000UL)             /*!< WTLPSDIO (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP2_WTLPCRYPTO_Pos (20UL)                  /*!< WTLPCRYPTO (Bit 20)                                   */
#define PWRCTRL_PWRWEIGHTLP2_WTLPCRYPTO_Msk (0xf00000UL)            /*!< WTLPCRYPTO (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTLP2_WTLPDISP_Pos (16UL)                    /*!< WTLPDISP (Bit 16)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPDISP_Msk (0xf0000UL)               /*!< WTLPDISP (Bitfield-Mask: 0x0f)                        */
#define PWRCTRL_PWRWEIGHTLP2_WTLPGFX_Pos  (12UL)                    /*!< WTLPGFX (Bit 12)                                      */
#define PWRCTRL_PWRWEIGHTLP2_WTLPGFX_Msk  (0xf000UL)                /*!< WTLPGFX (Bitfield-Mask: 0x0f)                         */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI1_Pos (8UL)                    /*!< WTLPMSPI1 (Bit 8)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI1_Msk (0xf00UL)                /*!< WTLPMSPI1 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI0_Pos (4UL)                    /*!< WTLPMSPI0 (Bit 4)                                     */
#define PWRCTRL_PWRWEIGHTLP2_WTLPMSPI0_Msk (0xf0UL)                 /*!< WTLPMSPI0 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP2_WTLPADC_Pos  (0UL)                     /*!< WTLPADC (Bit 0)                                       */
#define PWRCTRL_PWRWEIGHTLP2_WTLPADC_Msk  (0xfUL)                   /*!< WTLPADC (Bitfield-Mask: 0x0f)                         */
/* =====================================================  PWRWEIGHTLP3  ====================================================== */
#define PWRCTRL_PWRWEIGHTLP3_WTLPMSPI2_Pos (28UL)                   /*!< WTLPMSPI2 (Bit 28)                                    */
#define PWRCTRL_PWRWEIGHTLP3_WTLPMSPI2_Msk (0xf0000000UL)           /*!< WTLPMSPI2 (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDADC_Pos (16UL)                  /*!< WTLPAUDADC (Bit 16)                                   */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDADC_Msk (0xf0000UL)             /*!< WTLPAUDADC (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDPB_Pos (12UL)                   /*!< WTLPAUDPB (Bit 12)                                    */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDPB_Msk (0xf000UL)               /*!< WTLPAUDPB (Bitfield-Mask: 0x0f)                       */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDREC_Pos (8UL)                   /*!< WTLPAUDREC (Bit 8)                                    */
#define PWRCTRL_PWRWEIGHTLP3_WTLPAUDREC_Msk (0xf00UL)               /*!< WTLPAUDREC (Bitfield-Mask: 0x0f)                      */
#define PWRCTRL_PWRWEIGHTLP3_WTLPDBG_Pos  (4UL)                     /*!< WTLPDBG (Bit 4)                                       */
#define PWRCTRL_PWRWEIGHTLP3_WTLPDBG_Msk  (0xf0UL)                  /*!< WTLPDBG (Bitfield-Mask: 0x0f)                         */
