AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* ==============================================  AUDADC SL6CFG WCEN6 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL6CFG_WCEN6                                                       */
  AUDADC_SL6CFG_WCEN6_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 6.                              */
  AUDADC_SL6CFG_WCEN6_WCDIS            = 0,     /*!< WCDIS : Disable the window compare for slot 6.                            */
} AUDADC_SL6CFG_WCEN6_Enum;

/* ==============================================  AUDADC SL6CFG SLEN6 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL6CFG_SLEN6                                                       */
  AUDADC_SL6CFG_SLEN6_SLEN             = 1,     /*!< SLEN : Enable slot 6 for AUDADC conversions.                              */
  AUDADC_SL6CFG_SLEN6_SLDIS            = 0,     /*!< SLDIS : Disable slot 6 for AUDADC conversions.                            */
} AUDADC_SL6CFG_SLEN6_Enum;

/* ========================================================  SL7CFG  ========================================================= */
/* =============================================  AUDADC SL7CFG ADSEL7 [24..26]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL7CFG_ADSEL7                                                      */
  AUDADC_SL7CFG_ADSEL7_AVG_1_MSRMT     = 0,     /*!< AVG_1_MSRMT : Average in 1 measurement in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL7CFG_ADSEL7_AVG_2_MSRMTS    = 1,     /*!< AVG_2_MSRMTS : Average in 2 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL7CFG_ADSEL7_AVG_4_MSRMTS    = 2,     /*!< AVG_4_MSRMTS : Average in 4 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL7CFG_ADSEL7_AVG_8_MSRMT     = 3,     /*!< AVG_8_MSRMT : Average in 8 measurements in the accumulate divide
                                                     module for this slot.                                                     */
  AUDADC_SL7CFG_ADSEL7_AVG_16_MSRMTS   = 4,     /*!< AVG_16_MSRMTS : Average in 16 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL7CFG_ADSEL7_AVG_32_MSRMTS   = 5,     /*!< AVG_32_MSRMTS : Average in 32 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL7CFG_ADSEL7_AVG_64_MSRMTS   = 6,     /*!< AVG_64_MSRMTS : Average in 64 measurements in the accumulate
                                                     divide module for this slot.                                              */
  AUDADC_SL7CFG_ADSEL7_AVG_128_MSRMTS  = 7,     /*!< AVG_128_MSRMTS : Average in 128 measurements in the accumulate
                                                     divide module for this slot.                                              */
} AUDADC_SL7CFG_ADSEL7_Enum;

/* ============================================  AUDADC SL7CFG PRMODE7 [16..17]  ============================================= */
typedef enum {                                  /*!< AUDADC_SL7CFG_PRMODE7                                                     */
  AUDADC_SL7CFG_PRMODE7_P12B0          = 0,     /*!< P12B0 : 12-bit precision mode                                             */
  AUDADC_SL7CFG_PRMODE7_P12B1          = 1,     /*!< P12B1 : 12-bit precision mode                                             */
  AUDADC_SL7CFG_PRMODE7_P10B           = 2,     /*!< P10B : 10-bit precision mode                                              */
  AUDADC_SL7CFG_PRMODE7_P8B            = 3,     /*!< P8B : 8-bit precision mode                                                */
} AUDADC_SL7CFG_PRMODE7_Enum;

/* =============================================  AUDADC SL7CFG CHSEL7 [8..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_SL7CFG_CHSEL7                                                      */
  AUDADC_SL7CFG_CHSEL7_SE0             = 0,     /*!< SE0 : PGA channel A0 output                                               */
  AUDADC_SL7CFG_CHSEL7_SE1             = 1,     /*!< SE1 : PGA channel A1 output                                               */
  AUDADC_SL7CFG_CHSEL7_SE2             = 2,     /*!< SE2 : PGA channel B0 output                                               */
  AUDADC_SL7CFG_CHSEL7_SE3             = 3,     /*!< SE3 : PGA channel B1 output                                               */
} AUDADC_SL7CFG_CHSEL7_Enum;

/* ==============================================  AUDADC SL7CFG WCEN7 [1..1]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL7CFG_WCEN7                                                       */
  AUDADC_SL7CFG_WCEN7_WCEN             = 1,     /*!< WCEN : Enable the window compare for slot 7.                              */
  AUDADC_SL7CFG_WCEN7_WCDIS            = 0,     /*!< WCDIS : Disable the window compare for slot 7.                            */
} AUDADC_SL7CFG_WCEN7_Enum;

/* ==============================================  AUDADC SL7CFG SLEN7 [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_SL7CFG_SLEN7                                                       */
  AUDADC_SL7CFG_SLEN7_SLEN             = 1,     /*!< SLEN : Enable slot 7 for AUDADC conversions.                              */
  AUDADC_SL7CFG_SLEN7_SLDIS            = 0,     /*!< SLDIS : Disable slot 7 for AUDADC conversions.                            */
} AUDADC_SL7CFG_SLEN7_Enum;

/* =========================================================  WULIM  ========================================================= */
/* =========================================================  WLLIM  ========================================================= */
/* ========================================================  SCWLIM  ========================================================= */
/* =========================================================  FIFO  ========================================================== */
/* ========================================================  FIFOPR  ========================================================= */
/* =====================================================  INTTRIGTIMER  ====================================================== */
/* =========================================  AUDADC INTTRIGTIMER TIMEREN [31..31]  ========================================== */
typedef enum {                                  /*!< AUDADC_INTTRIGTIMER_TIMEREN                                               */
  AUDADC_INTTRIGTIMER_TIMEREN_DIS      = 0,     /*!< DIS : Disable the AUDADC-internal trigger timer.                          */
  AUDADC_INTTRIGTIMER_TIMEREN_EN       = 1,     /*!< EN : Enable the AUDADC-internal trigger timer.                            */
} AUDADC_INTTRIGTIMER_TIMEREN_Enum;

/* =======================================================  FIFOSTAT  ======================================================== */
/* ======================================================  DATAOFFSET  ======================================================= */
/* =========================================================  ZXCFG  ========================================================= */
/* =========================================================  ZXLIM  ========================================================= */
/* ========================================================  GAINCFG  ======================================================== */
/* ===========================================  AUDADC GAINCFG UPDATEMODE [4..4]  ============================================ */
typedef enum {                                  /*!< AUDADC_GAINCFG_UPDATEMODE                                                 */
  AUDADC_GAINCFG_UPDATEMODE_IMMED      = 0,     /*!< IMMED : Immediate update mode. Once gain is written, it is immediately
                                                     encoded and provided to the PGA.                                          */
  AUDADC_GAINCFG_UPDATEMODE_ZX         = 1,     /*!< ZX : Update gain only at detected zero crossing as configured
                                                     by ZX registers.                                                          */
} AUDADC_GAINCFG_UPDATEMODE_Enum;

/* =========================================================  GAIN  ========================================================== */
/* ========================================================  SATCFG  ========================================================= */
/* ========================================================  SATLIM  ========================================================= */
/* ========================================================  SATMAX  ========================================================= */
/* ========================================================  SATCLR  ========================================================= */
/* =========================================================  INTEN  ========================================================= */
/* ==============================================  AUDADC INTEN SATCB [11..11]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_SATCB                                                        */
  AUDADC_INTEN_SATCB_SATCBINT          = 1,     /*!< SATCBINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
  AUDADC_INTEN_SATCB_NONSATCBINT       = 0,     /*!< NONSATCBINT : No-Saturation                                               */
} AUDADC_INTEN_SATCB_Enum;

/* ==============================================  AUDADC INTEN SATCA [10..10]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTEN_SATCA                                                        */
  AUDADC_INTEN_SATCA_SATCAINT          = 1,     /*!< SATCAINT : Saturation, as specified by SAT configuration registers,
                                                     occurred on either slot 0 or 1 (channel A)                                */
  AUDADC_INTEN_SATCA_NONSATCAINT       = 0,     /*!< NONSATCAINT : No Saturation                                               */
} AUDADC_INTEN_SATCA_Enum;

/* ===============================================  AUDADC INTEN ZXCB [9..9]  ================================================ */
typedef enum {                                  /*!< AUDADC_INTEN_ZXCB                                                         */
  AUDADC_INTEN_ZXCB_ZXCBINT            = 1,     /*!< ZXCBINT : Zero Crossing, as specified by ZX configuration registers,
                                                     occurred on either slot 2 or 3 (channel B)                                */
  AUDADC_INTEN_ZXCB_NONZXCBINT         = 0,     /*!< NONZXCBINT : Non Zero Crossing                                            */
} AUDADC_INTEN_ZXCB_Enum;

