AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* ========================================================  BGCOLOR  ======================================================== */
/* =========================================================  RESXY  ========================================================= */
/* =====================================================  FRONTPORCHXY  ====================================================== */
/* ======================================================  BLANKINGXY  ======================================================= */
/* ======================================================  BACKPORCHXY  ====================================================== */
/* =======================================================  CURSORXY  ======================================================== */
/* ========================================================  DBICFG  ========================================================= */
/* ===============================================  DC DBICFG CSXSET [29..29]  =============================================== */
typedef enum {                                  /*!< DC_DBICFG_CSXSET                                                          */
  DC_DBICFG_CSXSET_CSX1                = 1,     /*!< CSX1 : is set to one if DBI_CFG[29] has the value of one                  */
  DC_DBICFG_CSXSET_CSX0                = 0,     /*!< CSX0 : is set to zero if DBI_CFG[29] has the value of zero                */
} DC_DBICFG_CSXSET_Enum;

/* ==============================================  DC DBICFG TYPEBWIDTH [6..7]  ============================================== */
typedef enum {                                  /*!< DC_DBICFG_TYPEBWIDTH                                                      */
  DC_DBICFG_TYPEBWIDTH_INT_16          = 0,     /*!< INT_16 : 16-bit interface                                                 */
  DC_DBICFG_TYPEBWIDTH_INT_9           = 1,     /*!< INT_9 : 9-bit interface                                                   */
  DC_DBICFG_TYPEBWIDTH_INT_8           = 2,     /*!< INT_8 : 8-bit interface                                                   */
  DC_DBICFG_TYPEBWIDTH_INT_SERIAL      = 3,     /*!< INT_SERIAL : Serial interface                                             */
} DC_DBICFG_TYPEBWIDTH_Enum;

/* =============================================  DC DBICFG DATAWDORDER [3..5]  ============================================== */
typedef enum {                                  /*!< DC_DBICFG_DATAWDORDER                                                     */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT0  = 0,     /*!< WD_ORDER_OPT0 : option 0                                                  */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT1  = 1,     /*!< WD_ORDER_OPT1 : option 1                                                  */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT2  = 2,     /*!< WD_ORDER_OPT2 : option 2                                                  */
  DC_DBICFG_DATAWDORDER_WD_ORDER_OPT3  = 3,     /*!< WD_ORDER_OPT3 : option 3                                                  */
} DC_DBICFG_DATAWDORDER_Enum;

/* =============================================  DC DBICFG DBICOLORFMT [0..2]  ============================================== */
typedef enum {                                  /*!< DC_DBICFG_DBICOLORFMT                                                     */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB111 = 1,     /*!< DBI_FMT_RGB111 : RGB111 (3 bits/pixel)                                    */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB332 = 2,     /*!< DBI_FMT_RGB332 : RGB332 (8 bits/pixel)                                    */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB444 = 3,     /*!< DBI_FMT_RGB444 : RGB444 (12 bits/pixel)                                   */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB565 = 5,     /*!< DBI_FMT_RGB565 : RGB565 (16 bits/pixel)                                   */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB666 = 6,     /*!< DBI_FMT_RGB666 : RGB666 (18 bits/pixel)                                   */
  DC_DBICFG_DBICOLORFMT_DBI_FMT_RGB888 = 7,     /*!< DBI_FMT_RGB888 : RGB888 (24 bits/pixel)                                   */
} DC_DBICFG_DBICOLORFMT_Enum;

/* ========================================================  DCGPIO  ========================================================= */
/* ======================================================  LAYER0MODE  ======================================================= */
/* ==========================================  DC LAYER0MODE LAYER0DBLEND [12..15]  ========================================== */
typedef enum {                                  /*!< DC_LAYER0MODE_LAYER0DBLEND                                                */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DBLACK_BLEND = 0,/*!< LAYER0_DBLACK_BLEND : blend black                                    */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DWHITE_BLEND = 1,/*!< LAYER0_DWHITE_BLEND : blend white                                    */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALBHAS_BLEND = 2,/*!< LAYER0_DALBHAS_BLEND : blend alpha source                           */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALPHAG_BLEND = 3,/*!< LAYER0_DALPHAG_BLEND : blend alpha global                           */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALPHASG_BLEND = 4,/*!< LAYER0_DALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERT_BLEND_SRC = 5,/*!< LAYER0_DINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERT_GLOBAL_BLEND = 6,/*!< LAYER0_DINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERTSG_BLEND = 7,/*!< LAYER0_DINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DALPHA_BLEND = 10,/*!< LAYER0_DALPHA_BLEND : blend alpha destination                       */
  DC_LAYER0MODE_LAYER0DBLEND_LAYER0_DINVERT_BLEND_DST = 13,/*!< LAYER0_DINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER0MODE_LAYER0DBLEND_Enum;

/* ==========================================  DC LAYER0MODE LAYER0SBLEND [8..11]  =========================================== */
typedef enum {                                  /*!< DC_LAYER0MODE_LAYER0SBLEND                                                */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SBLACK_BLEND = 0,/*!< LAYER0_SBLACK_BLEND : blend black                                    */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SWHITE_BLEND = 1,/*!< LAYER0_SWHITE_BLEND : blend white                                    */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALBHAS_BLEND = 2,/*!< LAYER0_SALBHAS_BLEND : blend alpha source                           */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALPHAG_BLEND = 3,/*!< LAYER0_SALPHAG_BLEND : blend alpha global                           */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALPHASG_BLEND = 4,/*!< LAYER0_SALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERT_BLEND_SRC = 5,/*!< LAYER0_SINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERT_GLOBAL_BLEND = 6,/*!< LAYER0_SINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERTSG_BLEND = 7,/*!< LAYER0_SINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SALPHA_BLEND = 10,/*!< LAYER0_SALPHA_BLEND : blend alpha destination                       */
  DC_LAYER0MODE_LAYER0SBLEND_LAYER0_SINVERT_BLEND_DST = 13,/*!< LAYER0_SINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER0MODE_LAYER0SBLEND_Enum;

/* ==========================================  DC LAYER0MODE LAYER0COLMODE [0..4]  =========================================== */
typedef enum {                                  /*!< DC_LAYER0MODE_LAYER0COLMODE                                               */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_LUTBLE = 0,/*!< LAYER0CM_LUTBLE : 8-bit color palette look-up table (LUT8)              */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGBX5551 = 1,/*!< LAYER0CM_RGBX5551 : 16-bit RGBX5551 color format                      */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGBX8888 = 2,/*!< LAYER0CM_RGBX8888 : 32-bit RGBX8888 color format                      */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGB332 = 4,/*!< LAYER0CM_RGB332 : 8-bit RGB332 color format                             */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RGB565 = 5,/*!< LAYER0CM_RGB565 : 16-bit RGB565 color format                            */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_XRGB8888 = 6,/*!< LAYER0CM_XRGB8888 : 32-bit XRGB8888 color format                      */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_L8 = 7,  /*!< LAYER0CM_L8 : L8 Grayscale/Palette format                                 */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_L1 = 8,  /*!< LAYER0CM_L1 : L1 Grayscale/Palette format                                 */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_L4 = 9,  /*!< LAYER0CM_L4 : L4 Grayscale/Palette format                                 */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_YUYV = 10,/*!< LAYER0CM_YUYV : color format                                             */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_RBG = 11,/*!< LAYER0CM_RBG : 24-bit RGB color format                                    */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_YUY2 = 12,/*!< LAYER0CM_YUY2 : YUY2 color format                                        */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_ABGR8888 = 13,/*!< LAYER0CM_ABGR8888 : 32-bit ABGR8888 color format                     */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_BGRA8888 = 14,/*!< LAYER0CM_BGRA8888 : 32-bit BGRA8888 color format                     */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_Video = 16,/*!< LAYER0CM_Video : Video 420 Mode                                         */
  DC_LAYER0MODE_LAYER0COLMODE_LAYER0CM_Trilinear = 17,/*!< LAYER0CM_Trilinear : Trilinea 420 Video Mode                        */
} DC_LAYER0MODE_LAYER0COLMODE_Enum;

/* =====================================================  LAYER0STARTXY  ===================================================== */
/* =====================================================  LAYER0SIZEXY  ====================================================== */
/* ======================================================  LAYER0ADDR  ======================================================= */
/* =====================================================  LAYER0STRIDE  ====================================================== */
/* ======================================  DC LAYER0STRIDE LAYER0AXIFIFOTHLD [19..20]  ======================================= */
typedef enum {                                  /*!< DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD                                         */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_HALF_SZ = 0,/*!< LAYER0_BURST_HALF_SZ : half fifo (default)                   */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_2 = 1,/*!< LAYER0_BURST_2 : 2 burst-size                                      */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_4 = 2,/*!< LAYER0_BURST_4 : 4 burst-size                                      */
  DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_LAYER0_BURST_8 = 3,/*!< LAYER0_BURST_8 : 8 burst-size                                      */
} DC_LAYER0STRIDE_LAYER0AXIFIFOTHLD_Enum;

/* ======================================  DC LAYER0STRIDE LAYER0AXIBURSTBITS [16..18]  ====================================== */
typedef enum {                                  /*!< DC_LAYER0STRIDE_LAYER0AXIBURSTBITS                                        */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_DEF = 0,/*!< LAYER0_BEATS_DEF : 16-beats (default)                           */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_2 = 1,/*!< LAYER0_BEATS_2 : 2-beats                                          */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_4 = 2,/*!< LAYER0_BEATS_4 : 4-beats                                          */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_8 = 3,/*!< LAYER0_BEATS_8 : 8-beats                                          */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_16 = 4,/*!< LAYER0_BEATS_16 : 16-beats (CHECK mistake?)                      */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_32 = 5,/*!< LAYER0_BEATS_32 : 32-beats (AXI4 only)                           */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_64 = 6,/*!< LAYER0_BEATS_64 : 64-beats (AXI4 only)                           */
  DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_LAYER0_BEATS_128 = 7,/*!< LAYER0_BEATS_128 : 128-beats (AXI4 only)                        */
} DC_LAYER0STRIDE_LAYER0AXIBURSTBITS_Enum;

/* ======================================================  LAYER0RESXY  ====================================================== */
/* =====================================================  LAYER0SCALEX  ====================================================== */
/* =====================================================  LAYER0SCALEY  ====================================================== */
/* ======================================================  LAYER1MODE  ======================================================= */
/* ==========================================  DC LAYER1MODE LAYER1DBLEND [12..15]  ========================================== */
typedef enum {                                  /*!< DC_LAYER1MODE_LAYER1DBLEND                                                */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DBLACK_BLEND = 0,/*!< LAYER1_DBLACK_BLEND : blend black                                    */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DWHITE_BLEND = 1,/*!< LAYER1_DWHITE_BLEND : blend white                                    */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DALBHAS_BLEND = 2,/*!< LAYER1_DALBHAS_BLEND : blend alpha source                           */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DALPHAG_BLEND = 3,/*!< LAYER1_DALPHAG_BLEND : blend alpha global                           */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DALPHASG_BLEND = 4,/*!< LAYER1_DALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DINVERT_BLEND_SRC = 5,/*!< LAYER1_DINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DINVERT_GLOBAL_BLEND = 6,/*!< LAYER1_DINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DINVERTSG_BLEND = 7,/*!< LAYER1_DINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DALPHA_BLEND = 10,/*!< LAYER1_DALPHA_BLEND : blend alpha destination                       */
  DC_LAYER1MODE_LAYER1DBLEND_LAYER1_DINVERT_BLEND_DST = 13,/*!< LAYER1_DINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER1MODE_LAYER1DBLEND_Enum;

/* ==========================================  DC LAYER1MODE LAYER1SBLEND [8..11]  =========================================== */
typedef enum {                                  /*!< DC_LAYER1MODE_LAYER1SBLEND                                                */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SBLACK_BLEND = 0,/*!< LAYER1_SBLACK_BLEND : blend black                                    */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SWHITE_BLEND = 1,/*!< LAYER1_SWHITE_BLEND : blend white                                    */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SALBHAS_BLEND = 2,/*!< LAYER1_SALBHAS_BLEND : blend alpha source                           */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SALPHAG_BLEND = 3,/*!< LAYER1_SALPHAG_BLEND : blend alpha global                           */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SALPHASG_BLEND = 4,/*!< LAYER1_SALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SINVERT_BLEND_SRC = 5,/*!< LAYER1_SINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SINVERT_GLOBAL_BLEND = 6,/*!< LAYER1_SINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SINVERTSG_BLEND = 7,/*!< LAYER1_SINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SALPHA_BLEND = 10,/*!< LAYER1_SALPHA_BLEND : blend alpha destination                       */
  DC_LAYER1MODE_LAYER1SBLEND_LAYER1_SINVERT_BLEND_DST = 13,/*!< LAYER1_SINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER1MODE_LAYER1SBLEND_Enum;

