AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* ========================================  PWRCTRL AUDSSPWREN PWRENAUDADC [10..10]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENAUDADC                                            */
  PWRCTRL_AUDSSPWREN_PWRENAUDADC_EN    = 1,     /*!< EN : Power up AUDADC                                                      */
  PWRCTRL_AUDSSPWREN_PWRENAUDADC_DIS   = 0,     /*!< DIS : Power down AUDADC                                                   */
} PWRCTRL_AUDSSPWREN_PWRENAUDADC_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENI2S1 [7..7]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENI2S1                                              */
  PWRCTRL_AUDSSPWREN_PWRENI2S1_EN      = 1,     /*!< EN : Power up I2S1                                                        */
  PWRCTRL_AUDSSPWREN_PWRENI2S1_DIS     = 0,     /*!< DIS : Power down I2S1                                                     */
} PWRCTRL_AUDSSPWREN_PWRENI2S1_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENI2S0 [6..6]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENI2S0                                              */
  PWRCTRL_AUDSSPWREN_PWRENI2S0_EN      = 1,     /*!< EN : Power up I2S0                                                        */
  PWRCTRL_AUDSSPWREN_PWRENI2S0_DIS     = 0,     /*!< DIS : Power down I2S0                                                     */
} PWRCTRL_AUDSSPWREN_PWRENI2S0_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENPDM3 [5..5]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENPDM3                                              */
  PWRCTRL_AUDSSPWREN_PWRENPDM3_EN      = 1,     /*!< EN : Power up PDM3                                                        */
  PWRCTRL_AUDSSPWREN_PWRENPDM3_DIS     = 0,     /*!< DIS : Power down PDM3                                                     */
} PWRCTRL_AUDSSPWREN_PWRENPDM3_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENPDM2 [4..4]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENPDM2                                              */
  PWRCTRL_AUDSSPWREN_PWRENPDM2_EN      = 1,     /*!< EN : Power up PDM2                                                        */
  PWRCTRL_AUDSSPWREN_PWRENPDM2_DIS     = 0,     /*!< DIS : Power down PDM2                                                     */
} PWRCTRL_AUDSSPWREN_PWRENPDM2_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENPDM1 [3..3]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENPDM1                                              */
  PWRCTRL_AUDSSPWREN_PWRENPDM1_EN      = 1,     /*!< EN : Power up PDM1                                                        */
  PWRCTRL_AUDSSPWREN_PWRENPDM1_DIS     = 0,     /*!< DIS : Power down PDM1                                                     */
} PWRCTRL_AUDSSPWREN_PWRENPDM1_Enum;

/* ==========================================  PWRCTRL AUDSSPWREN PWRENPDM0 [2..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENPDM0                                              */
  PWRCTRL_AUDSSPWREN_PWRENPDM0_EN      = 1,     /*!< EN : Power up PDM0                                                        */
  PWRCTRL_AUDSSPWREN_PWRENPDM0_DIS     = 0,     /*!< DIS : Power down PDM0                                                     */
} PWRCTRL_AUDSSPWREN_PWRENPDM0_Enum;

/* =========================================  PWRCTRL AUDSSPWREN PWRENAUDPB [1..1]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENAUDPB                                             */
  PWRCTRL_AUDSSPWREN_PWRENAUDPB_EN     = 1,     /*!< EN : Power up AUDPB                                                       */
  PWRCTRL_AUDSSPWREN_PWRENAUDPB_DIS    = 0,     /*!< DIS : Power down AUDPB                                                    */
} PWRCTRL_AUDSSPWREN_PWRENAUDPB_Enum;

/* =========================================  PWRCTRL AUDSSPWREN PWRENAUDREC [0..0]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWREN_PWRENAUDREC                                            */
  PWRCTRL_AUDSSPWREN_PWRENAUDREC_EN    = 1,     /*!< EN : Power up AUDREC                                                      */
  PWRCTRL_AUDSSPWREN_PWRENAUDREC_DIS   = 0,     /*!< DIS : Power down AUDREC                                                   */
} PWRCTRL_AUDSSPWREN_PWRENAUDREC_Enum;

/* ====================================================  AUDSSPWRSTATUS  ===================================================== */
/* =======================================  PWRCTRL AUDSSPWRSTATUS PWRSTDSPA [11..11]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTDSPA                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTDSPA_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTDSPA_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTDSPA_Enum;

/* ======================================  PWRCTRL AUDSSPWRSTATUS PWRSTAUDADC [10..10]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC                                        */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC_ON = 1,    /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC_OFF = 0,   /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDADC_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTI2S1 [7..7]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S1_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTI2S0 [6..6]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTPDM3 [5..5]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM3                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM3_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM3_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM3_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTPDM2 [4..4]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM2                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM2_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM2_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM2_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTPDM1 [3..3]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM1                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM1_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM1_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM1_Enum;

/* ========================================  PWRCTRL AUDSSPWRSTATUS PWRSTPDM0 [2..2]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0                                          */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_ON  = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_OFF = 0,     /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_Enum;

/* =======================================  PWRCTRL AUDSSPWRSTATUS PWRSTAUDPB [1..1]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDPB                                         */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDPB_ON = 1,     /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDPB_OFF = 0,    /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDPB_Enum;

/* =======================================  PWRCTRL AUDSSPWRSTATUS PWRSTAUDREC [0..0]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDREC                                        */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDREC_ON = 1,    /*!< ON : Domain powered on                                                    */
  PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDREC_OFF = 0,   /*!< OFF : Domain powered off                                                  */
} PWRCTRL_AUDSSPWRSTATUS_PWRSTAUDREC_Enum;

/* =======================================================  MEMPWREN  ======================================================== */
/* =========================================  PWRCTRL MEMPWREN PWRENCACHEB2 [5..5]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENCACHEB2                                             */
  PWRCTRL_MEMPWREN_PWRENCACHEB2_EN     = 1,     /*!< EN : Power up Cache Bank 2                                                */
  PWRCTRL_MEMPWREN_PWRENCACHEB2_DIS    = 0,     /*!< DIS : Power down Cache Bank 2                                             */
} PWRCTRL_MEMPWREN_PWRENCACHEB2_Enum;

/* =========================================  PWRCTRL MEMPWREN PWRENCACHEB0 [4..4]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENCACHEB0                                             */
  PWRCTRL_MEMPWREN_PWRENCACHEB0_EN     = 1,     /*!< EN : Power up Cache Bank 0                                                */
  PWRCTRL_MEMPWREN_PWRENCACHEB0_DIS    = 0,     /*!< DIS : Power down Cache Bank 0                                             */
} PWRCTRL_MEMPWREN_PWRENCACHEB0_Enum;

/* ===========================================  PWRCTRL MEMPWREN PWRENNVM0 [3..3]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENNVM0                                                */
  PWRCTRL_MEMPWREN_PWRENNVM0_EN        = 1,     /*!< EN : Power up NVM0                                                        */
  PWRCTRL_MEMPWREN_PWRENNVM0_DIS       = 0,     /*!< DIS : Power down NVM0                                                     */
} PWRCTRL_MEMPWREN_PWRENNVM0_Enum;

/* ===========================================  PWRCTRL MEMPWREN PWRENDTCM [0..2]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWREN_PWRENDTCM                                                */
  PWRCTRL_MEMPWREN_PWRENDTCM_NONE      = 0,     /*!< NONE : Do not enable power to any DTCMs                                   */
  PWRCTRL_MEMPWREN_PWRENDTCM_TCM8K     = 1,     /*!< TCM8K : Power ON only lower 8k                                            */
  PWRCTRL_MEMPWREN_PWRENDTCM_TCM128K   = 3,     /*!< TCM128K : Power ON only lower 128k                                        */
  PWRCTRL_MEMPWREN_PWRENDTCM_TCM384K   = 7,     /*!< TCM384K : Power ON 384k                                                   */
} PWRCTRL_MEMPWREN_PWRENDTCM_Enum;

