AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* =======================================================  EMONCFG5  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG5 EMONSEL5 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG5_EMONSEL5                                                 */
  PWRCTRL_EMONCFG5_EMONSEL5_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG5_EMONSEL5_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG5_EMONSEL5_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG5_EMONSEL5_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG5_EMONSEL5_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG5_EMONSEL5_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG5_EMONSEL5_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG5_EMONSEL5_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG5_EMONSEL5_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_PDM0ON     = 11,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_PDM1ON     = 12,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_PDM2ON     = 13,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_PDM3ON     = 14,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_AUDADCON   = 15,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG5_EMONSEL5_CRYPTOON   = 16,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG5_EMONSEL5_DBGON      = 17,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG5_EMONSEL5_DISPON     = 18,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_DISPPHYON  = 19,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG5_EMONSEL5_DSPAON     = 20,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_GFXON      = 21,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG5_EMONSEL5_UART0ON    = 22,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_UART1ON    = 23,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_UART2ON    = 24,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_UART3ON    = 25,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM0ON     = 26,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM1ON     = 27,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM2ON     = 28,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM3ON     = 29,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_RESERVED30 = 30,    /*!< RESERVED30 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG5_EMONSEL5_RESERVED31 = 31,    /*!< RESERVED31 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM4ON     = 32,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM5ON     = 33,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM6ON     = 34,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_IOM7ON     = 35,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_IOSON      = 36,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG5_EMONSEL5_MSPI0ON    = 37,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_MSPI1ON    = 38,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_MSPI2ON    = 39,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG5_EMONSEL5_SDIOON     = 40,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG5_EMONSEL5_USBON      = 41,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG5_EMONSEL5_USBPHYON   = 42,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG5_EMONSEL5_Enum;

/* =======================================================  EMONCFG6  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG6 EMONSEL6 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG6_EMONSEL6                                                 */
  PWRCTRL_EMONCFG6_EMONSEL6_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG6_EMONSEL6_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG6_EMONSEL6_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG6_EMONSEL6_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG6_EMONSEL6_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG6_EMONSEL6_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG6_EMONSEL6_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG6_EMONSEL6_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG6_EMONSEL6_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_PDM0ON     = 11,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_PDM1ON     = 12,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_PDM2ON     = 13,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_PDM3ON     = 14,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_AUDADCON   = 15,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG6_EMONSEL6_CRYPTOON   = 16,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG6_EMONSEL6_DBGON      = 17,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG6_EMONSEL6_DISPON     = 18,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_DISPPHYON  = 19,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG6_EMONSEL6_DSPAON     = 20,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_GFXON      = 21,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG6_EMONSEL6_UART0ON    = 22,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_UART1ON    = 23,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_UART2ON    = 24,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_UART3ON    = 25,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM0ON     = 26,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM1ON     = 27,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM2ON     = 28,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM3ON     = 29,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_RESERVED30 = 30,    /*!< RESERVED30 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG6_EMONSEL6_RESERVED31 = 31,    /*!< RESERVED31 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM4ON     = 32,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM5ON     = 33,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM6ON     = 34,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_IOM7ON     = 35,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_IOSON      = 36,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG6_EMONSEL6_MSPI0ON    = 37,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_MSPI1ON    = 38,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_MSPI2ON    = 39,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG6_EMONSEL6_SDIOON     = 40,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG6_EMONSEL6_USBON      = 41,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG6_EMONSEL6_USBPHYON   = 42,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG6_EMONSEL6_Enum;

/* =======================================================  EMONCFG7  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG7 EMONSEL7 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG7_EMONSEL7                                                 */
  PWRCTRL_EMONCFG7_EMONSEL7_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG7_EMONSEL7_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG7_EMONSEL7_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG7_EMONSEL7_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG7_EMONSEL7_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG7_EMONSEL7_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG7_EMONSEL7_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG7_EMONSEL7_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG7_EMONSEL7_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_PDM0ON     = 11,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_PDM1ON     = 12,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_PDM2ON     = 13,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_PDM3ON     = 14,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_AUDADCON   = 15,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG7_EMONSEL7_CRYPTOON   = 16,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG7_EMONSEL7_DBGON      = 17,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG7_EMONSEL7_DISPON     = 18,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_DISPPHYON  = 19,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG7_EMONSEL7_DSPAON     = 20,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_GFXON      = 21,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG7_EMONSEL7_UART0ON    = 22,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_UART1ON    = 23,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_UART2ON    = 24,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_UART3ON    = 25,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM0ON     = 26,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM1ON     = 27,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM2ON     = 28,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM3ON     = 29,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_RESERVED30 = 30,    /*!< RESERVED30 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG7_EMONSEL7_RESERVED31 = 31,    /*!< RESERVED31 : Reserved selection. Operation unknown if selected.           */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM4ON     = 32,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM5ON     = 33,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM6ON     = 34,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_IOM7ON     = 35,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_IOSON      = 36,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG7_EMONSEL7_MSPI0ON    = 37,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_MSPI1ON    = 38,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_MSPI2ON    = 39,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG7_EMONSEL7_SDIOON     = 40,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG7_EMONSEL7_USBON      = 41,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG7_EMONSEL7_USBPHYON   = 42,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG7_EMONSEL7_Enum;

/* ======================================================  EMONCOUNT0  ======================================================= */
/* ======================================================  EMONCOUNT1  ======================================================= */
/* ======================================================  EMONCOUNT2  ======================================================= */
/* ======================================================  EMONCOUNT3  ======================================================= */
/* ======================================================  EMONCOUNT4  ======================================================= */
/* ======================================================  EMONCOUNT5  ======================================================= */
/* ======================================================  EMONCOUNT6  ======================================================= */
/* ======================================================  EMONCOUNT7  ======================================================= */
/* ======================================================  EMONSTATUS  ======================================================= */


/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* =========================================================  SWPOI  ========================================================= */
/* =============================================  RSTGEN SWPOI SWPOIKEY [0..7]  ============================================== */
typedef enum {                                  /*!< RSTGEN_SWPOI_SWPOIKEY                                                     */
  RSTGEN_SWPOI_SWPOIKEY_KEYVALUE       = 27,    /*!< KEYVALUE : Writing 0x1B key value generates a software POI reset.         */
  RSTGEN_SWPOI_SWPOIKEY_DEFAULT        = 0,     /*!< DEFAULT : Default value.                                                  */
} RSTGEN_SWPOI_SWPOIKEY_Enum;

/* =========================================================  SWPOR  ========================================================= */
/* =============================================  RSTGEN SWPOR SWPORKEY [0..7]  ============================================== */
typedef enum {                                  /*!< RSTGEN_SWPOR_SWPORKEY                                                     */
  RSTGEN_SWPOR_SWPORKEY_KEYVALUE       = 212,   /*!< KEYVALUE : Writing 0xD4 key value generates a software POR reset.         */
  RSTGEN_SWPOR_SWPORKEY_DEFAULT        = 0,     /*!< DEFAULT : Default value.                                                  */
} RSTGEN_SWPOR_SWPORKEY_Enum;

/* =======================================================  SIMOBODM  ======================================================== */
/* ===========================================  RSTGEN SIMOBODM DIGBOECLV [3..3]  ============================================ */
typedef enum {                                  /*!< RSTGEN_SIMOBODM_DIGBOECLV                                                 */
  RSTGEN_SIMOBODM_DIGBOECLV_BOM        = 0,     /*!< BOM : Mask the VDDC_LV digital brownout detection into the interrupt
                                                     block.                                                                    */
  RSTGEN_SIMOBODM_DIGBOECLV_BOE        = 1,     /*!< BOE : Enable brown VDDC_LV digital brownout detection into the
                                                     interrupt block.                                                          */
} RSTGEN_SIMOBODM_DIGBOECLV_Enum;

