AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* ==========================================  SDIO PRESENT CARDINSERTED [16..16]  =========================================== */
typedef enum {                                  /*!< SDIO_PRESENT_CARDINSERTED                                                 */
  SDIO_PRESENT_CARDINSERTED_RESET_DEBOUNCING_NOCARD = 0,/*!< RESET_DEBOUNCING_NOCARD : Reset or Debouncing or No Card          */
  SDIO_PRESENT_CARDINSERTED_CARDINSERTED = 1,   /*!< CARDINSERTED : Card Inserted                                              */
} SDIO_PRESENT_CARDINSERTED_Enum;

/* =============================================  SDIO PRESENT BUFRDEN [11..11]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_BUFRDEN                                                      */
  SDIO_PRESENT_BUFRDEN_DISABLE         = 0,     /*!< DISABLE : Read Disable                                                    */
  SDIO_PRESENT_BUFRDEN_ENABLE          = 1,     /*!< ENABLE : Read Enable.                                                     */
} SDIO_PRESENT_BUFRDEN_Enum;

/* =============================================  SDIO PRESENT BUFWREN [10..10]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_BUFWREN                                                      */
  SDIO_PRESENT_BUFWREN_DISABLE         = 0,     /*!< DISABLE : Write Disable                                                   */
  SDIO_PRESENT_BUFWREN_ENABLE          = 1,     /*!< ENABLE : Write Enable.                                                    */
} SDIO_PRESENT_BUFWREN_Enum;

/* =============================================  SDIO PRESENT RDXFERACT [9..9]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_RDXFERACT                                                    */
  SDIO_PRESENT_RDXFERACT_TRANSFERRING  = 1,     /*!< TRANSFERRING : Transferring data                                          */
  SDIO_PRESENT_RDXFERACT_NOVALIDATA    = 0,     /*!< NOVALIDATA : No valid data                                                */
} SDIO_PRESENT_RDXFERACT_Enum;

/* =============================================  SDIO PRESENT WRXFERACT [8..8]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_WRXFERACT                                                    */
  SDIO_PRESENT_WRXFERACT_TRANSFERRING  = 1,     /*!< TRANSFERRING : transferring data                                          */
  SDIO_PRESENT_WRXFERACT_NOVALIDDATA   = 0,     /*!< NOVALIDDATA : No valid data                                               */
} SDIO_PRESENT_WRXFERACT_Enum;

/* ==========================================  SDIO PRESENT RETUNINGREQUEST [3..3]  ========================================== */
typedef enum {                                  /*!< SDIO_PRESENT_RETUNINGREQUEST                                              */
  SDIO_PRESENT_RETUNINGREQUEST_RETUNENEEDED = 1,/*!< RETUNENEEDED : Sampling clock needs re-tuning                             */
  SDIO_PRESENT_RETUNINGREQUEST_WELLTUNED = 0,   /*!< WELLTUNED : Fixed or well tuned sampling clock                            */
} SDIO_PRESENT_RETUNINGREQUEST_Enum;

/* =============================================  SDIO PRESENT DLINEACT [2..2]  ============================================== */
typedef enum {                                  /*!< SDIO_PRESENT_DLINEACT                                                     */
  SDIO_PRESENT_DLINEACT_ACTIVE         = 1,     /*!< ACTIVE : DAT line active                                                  */
  SDIO_PRESENT_DLINEACT_INACTIVE       = 0,     /*!< INACTIVE : DAT line inactive                                              */
} SDIO_PRESENT_DLINEACT_Enum;

/* =============================================  SDIO PRESENT CMDINHDAT [1..1]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_CMDINHDAT                                                    */
  SDIO_PRESENT_CMDINHDAT_DONTISSUE     = 1,     /*!< DONTISSUE : cannot issue command which uses the DAT line                  */
  SDIO_PRESENT_CMDINHDAT_ISSUE         = 0,     /*!< ISSUE : Can issue command which uses the DAT line                         */
} SDIO_PRESENT_CMDINHDAT_Enum;

/* =============================================  SDIO PRESENT CMDINHCMD [0..0]  ============================================= */
typedef enum {                                  /*!< SDIO_PRESENT_CMDINHCMD                                                    */
  SDIO_PRESENT_CMDINHCMD_DONTISSUE     = 1,     /*!< DONTISSUE : CMD line is in use                                            */
  SDIO_PRESENT_CMDINHCMD_ISSUE         = 0,     /*!< ISSUE : Indicates that the CMD line is not in use and the HC
                                                     can issue a SD command using the CMD line.                                */
} SDIO_PRESENT_CMDINHCMD_Enum;

/* =======================================================  HOSTCTRL1  ======================================================= */
/* ========================================  SDIO HOSTCTRL1 WUENCARDREMOVL [26..26]  ========================================= */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_WUENCARDREMOVL                                             */
  SDIO_HOSTCTRL1_WUENCARDREMOVL_ENABLE = 1,     /*!< ENABLE : Enable                                                           */
  SDIO_HOSTCTRL1_WUENCARDREMOVL_DISABLE = 0,    /*!< DISABLE : Disable                                                         */
} SDIO_HOSTCTRL1_WUENCARDREMOVL_Enum;

/* ========================================  SDIO HOSTCTRL1 WUENCARDINSERT [25..25]  ========================================= */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_WUENCARDINSERT                                             */
  SDIO_HOSTCTRL1_WUENCARDINSERT_ENABLE = 1,     /*!< ENABLE : Enable                                                           */
  SDIO_HOSTCTRL1_WUENCARDINSERT_DISABLE = 0,    /*!< DISABLE : Disable                                                         */
} SDIO_HOSTCTRL1_WUENCARDINSERT_Enum;

