AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* ==========================================  SDIO HOSTCTRL1 WUENCARDINT [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_WUENCARDINT                                                */
  SDIO_HOSTCTRL1_WUENCARDINT_ENABLE    = 1,     /*!< ENABLE : Enable                                                           */
  SDIO_HOSTCTRL1_WUENCARDINT_DISABLE   = 0,     /*!< DISABLE : Disable                                                         */
} SDIO_HOSTCTRL1_WUENCARDINT_Enum;

/* ==========================================  SDIO HOSTCTRL1 BOOTACKCHK [23..23]  =========================================== */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_BOOTACKCHK                                                 */
  SDIO_HOSTCTRL1_BOOTACKCHK_WAIT       = 1,     /*!< WAIT : wait for boot ack from eMMC card                                   */
  SDIO_HOSTCTRL1_BOOTACKCHK_NOWAIT     = 0,     /*!< NOWAIT : Will not wait for boot ack from eMMC card                        */
} SDIO_HOSTCTRL1_BOOTACKCHK_Enum;

/* ===========================================  SDIO HOSTCTRL1 ALTBOOTEN [22..22]  =========================================== */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_ALTBOOTEN                                                  */
  SDIO_HOSTCTRL1_ALTBOOTEN_START       = 1,     /*!< START : To start alternate boot mode access                               */
  SDIO_HOSTCTRL1_ALTBOOTEN_STOP        = 0,     /*!< STOP : To stop alternate boot mode access                                 */
} SDIO_HOSTCTRL1_ALTBOOTEN_Enum;

/* ============================================  SDIO HOSTCTRL1 BOOTEN [21..21]  ============================================= */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_BOOTEN                                                     */
  SDIO_HOSTCTRL1_BOOTEN_START          = 1,     /*!< START : To start boot code access                                         */
  SDIO_HOSTCTRL1_BOOTEN_STOP           = 0,     /*!< STOP : To stop boot code access                                           */
} SDIO_HOSTCTRL1_BOOTEN_Enum;

/* ============================================  SDIO HOSTCTRL1 SPIMODE [20..20]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_SPIMODE                                                    */
  SDIO_HOSTCTRL1_SPIMODE_SPI           = 1,     /*!< SPI : SPI mode                                                            */
  SDIO_HOSTCTRL1_SPIMODE_SD            = 0,     /*!< SD : SD mode                                                              */
} SDIO_HOSTCTRL1_SPIMODE_Enum;

/* =========================================  SDIO HOSTCTRL1 READWAITCTRL [18..18]  ========================================== */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_READWAITCTRL                                               */
  SDIO_HOSTCTRL1_READWAITCTRL_ENABLE   = 1,     /*!< ENABLE : Enable Read Wait Control                                         */
  SDIO_HOSTCTRL1_READWAITCTRL_DISABLE  = 0,     /*!< DISABLE : Disable Read Wait Control                                       */
} SDIO_HOSTCTRL1_READWAITCTRL_Enum;

/* ============================================  SDIO HOSTCTRL1 CONTREQ [17..17]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_CONTREQ                                                    */
  SDIO_HOSTCTRL1_CONTREQ_RESTART       = 1,     /*!< RESTART : Restart                                                         */
  SDIO_HOSTCTRL1_CONTREQ_IGNORED       = 0,     /*!< IGNORED : Ignored                                                         */
} SDIO_HOSTCTRL1_CONTREQ_Enum;

/* =====================================  SDIO HOSTCTRL1 STOPATBLOCKGAPREQUEST [16..16]  ===================================== */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_STOPATBLOCKGAPREQUEST                                      */
  SDIO_HOSTCTRL1_STOPATBLOCKGAPREQUEST_STOP = 1,/*!< STOP : Stop                                                               */
  SDIO_HOSTCTRL1_STOPATBLOCKGAPREQUEST_TRANSFER = 0,/*!< TRANSFER : Transfer                                                   */
} SDIO_HOSTCTRL1_STOPATBLOCKGAPREQUEST_Enum;

/* ============================================  SDIO HOSTCTRL1 HWRESET [12..12]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_HWRESET                                                    */
  SDIO_HOSTCTRL1_HWRESET_ASSERT        = 1,     /*!< ASSERT : Drives the hardware reset pin as ZERO (Active LOW to
                                                     eMMC card)                                                                */
  SDIO_HOSTCTRL1_HWRESET_DEASSERT      = 0,     /*!< DEASSERT : Deassert the hardware reset pin                                */
} SDIO_HOSTCTRL1_HWRESET_Enum;

/* ===========================================  SDIO HOSTCTRL1 VOLTSELECT [9..11]  =========================================== */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_VOLTSELECT                                                 */
  SDIO_HOSTCTRL1_VOLTSELECT_3_3V       = 7,     /*!< 3_3V : 3.3 V(Typ.)                                                        */
  SDIO_HOSTCTRL1_VOLTSELECT_3_0V       = 6,     /*!< 3_0V : 3.0 V(Typ.)                                                        */
  SDIO_HOSTCTRL1_VOLTSELECT_1_8V       = 5,     /*!< 1_8V : 1.8 V(Typ.)                                                        */
} SDIO_HOSTCTRL1_VOLTSELECT_Enum;

/* ===========================================  SDIO HOSTCTRL1 SDBUSPOWER [8..8]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_SDBUSPOWER                                                 */
  SDIO_HOSTCTRL1_SDBUSPOWER_POWERON    = 1,     /*!< POWERON : Power on                                                        */
  SDIO_HOSTCTRL1_SDBUSPOWER_POWEROFF   = 0,     /*!< POWEROFF : Power off                                                      */
} SDIO_HOSTCTRL1_SDBUSPOWER_Enum;

/* =============================================  SDIO HOSTCTRL1 CARDSRC [7..7]  ============================================= */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_CARDSRC                                                    */
  SDIO_HOSTCTRL1_CARDSRC_TEST          = 1,     /*!< TEST : The card detect test level is selected                             */
  SDIO_HOSTCTRL1_CARDSRC_SDCD          = 0,     /*!< SDCD : SDCD is selected (for normal use)                                  */
} SDIO_HOSTCTRL1_CARDSRC_Enum;

/* ============================================  SDIO HOSTCTRL1 TESTLEVEL [6..6]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_TESTLEVEL                                                  */
  SDIO_HOSTCTRL1_TESTLEVEL_CARDINSERTED = 1,    /*!< CARDINSERTED : Card Inserted                                              */
  SDIO_HOSTCTRL1_TESTLEVEL_NOCARD      = 0,     /*!< NOCARD : No Card                                                          */
} SDIO_HOSTCTRL1_TESTLEVEL_Enum;

/* ============================================  SDIO HOSTCTRL1 XFERWIDTH [5..5]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_XFERWIDTH                                                  */
  SDIO_HOSTCTRL1_XFERWIDTH_8BIT        = 1,     /*!< 8BIT : 8-bit Bus Width                                                    */
  SDIO_HOSTCTRL1_XFERWIDTH_XFER        = 0,     /*!< XFER : Bus Width is selected by Data Transfer Width                       */
} SDIO_HOSTCTRL1_XFERWIDTH_Enum;

/* ============================================  SDIO HOSTCTRL1 DMASELECT [3..4]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_DMASELECT                                                  */
  SDIO_HOSTCTRL1_DMASELECT_SDMA        = 0,     /*!< SDMA : SDMA is selected                                                   */
  SDIO_HOSTCTRL1_DMASELECT_ADMA132     = 1,     /*!< ADMA132 : 32-bit Address ADMA1 is selected                                */
  SDIO_HOSTCTRL1_DMASELECT_ADMA232     = 2,     /*!< ADMA232 : 32-bit Address ADMA2 is selected                                */
  SDIO_HOSTCTRL1_DMASELECT_ADMA264     = 3,     /*!< ADMA264 : 64-bit Address ADMA2 is selected                                */
} SDIO_HOSTCTRL1_DMASELECT_Enum;

/* ============================================  SDIO HOSTCTRL1 HISPEEDEN [2..2]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_HISPEEDEN                                                  */
  SDIO_HOSTCTRL1_HISPEEDEN_HIGH        = 1,     /*!< HIGH : High Speed Mode                                                    */
  SDIO_HOSTCTRL1_HISPEEDEN_NORMAL      = 0,     /*!< NORMAL : Normal Speed Mode                                                */
} SDIO_HOSTCTRL1_HISPEEDEN_Enum;

/* ========================================  SDIO HOSTCTRL1 DATATRANSFERWIDTH [1..1]  ======================================== */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_DATATRANSFERWIDTH                                          */
  SDIO_HOSTCTRL1_DATATRANSFERWIDTH_SD4 = 1,     /*!< SD4 : 4 bit mode                                                          */
  SDIO_HOSTCTRL1_DATATRANSFERWIDTH_SD1 = 0,     /*!< SD1 : 1 bit mode                                                          */
} SDIO_HOSTCTRL1_DATATRANSFERWIDTH_Enum;

/* ===========================================  SDIO HOSTCTRL1 LEDCONTROL [0..0]  ============================================ */
typedef enum {                                  /*!< SDIO_HOSTCTRL1_LEDCONTROL                                                 */
  SDIO_HOSTCTRL1_LEDCONTROL_ON         = 1,     /*!< ON : LED on                                                               */
  SDIO_HOSTCTRL1_LEDCONTROL_OFF        = 0,     /*!< OFF : LED off                                                             */
} SDIO_HOSTCTRL1_LEDCONTROL_Enum;

/* =======================================================  CLOCKCTRL  ======================================================= */
/* ===========================================  SDIO CLOCKCTRL SWRSTDAT [26..26]  ============================================ */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_SWRSTDAT                                                   */
  SDIO_CLOCKCTRL_SWRSTDAT_RESET        = 1,     /*!< RESET : Reset                                                             */
  SDIO_CLOCKCTRL_SWRSTDAT_WORK         = 0,     /*!< WORK : Work                                                               */
} SDIO_CLOCKCTRL_SWRSTDAT_Enum;

/* ===========================================  SDIO CLOCKCTRL SWRSTCMD [25..25]  ============================================ */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_SWRSTCMD                                                   */
  SDIO_CLOCKCTRL_SWRSTCMD_RESET        = 1,     /*!< RESET : Reset                                                             */
  SDIO_CLOCKCTRL_SWRSTCMD_WORK         = 0,     /*!< WORK : Work                                                               */
} SDIO_CLOCKCTRL_SWRSTCMD_Enum;

/* ===========================================  SDIO CLOCKCTRL SWRSTALL [24..24]  ============================================ */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_SWRSTALL                                                   */
  SDIO_CLOCKCTRL_SWRSTALL_RESET        = 1,     /*!< RESET : Reset                                                             */
  SDIO_CLOCKCTRL_SWRSTALL_WORK         = 0,     /*!< WORK : Work                                                               */
} SDIO_CLOCKCTRL_SWRSTALL_Enum;

/* ==========================================  SDIO CLOCKCTRL TIMEOUTCNT [16..19]  =========================================== */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_TIMEOUTCNT                                                 */
  SDIO_CLOCKCTRL_TIMEOUTCNT_27         = 14,    /*!< 27 : TMCLK * 2^27                                                         */
  SDIO_CLOCKCTRL_TIMEOUTCNT_26         = 0,     /*!< 26 : TMCLK * 2^26                                                         */
} SDIO_CLOCKCTRL_TIMEOUTCNT_Enum;

/* ============================================  SDIO CLOCKCTRL FREQSEL [8..15]  ============================================= */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_FREQSEL                                                    */
  SDIO_CLOCKCTRL_FREQSEL_DIV256        = 128,   /*!< DIV256 : base clock divided by 256                                        */
  SDIO_CLOCKCTRL_FREQSEL_DIV128        = 64,    /*!< DIV128 : base clock divided by 128                                        */
  SDIO_CLOCKCTRL_FREQSEL_DIV64         = 32,    /*!< DIV64 : base clock divided by 64                                          */
  SDIO_CLOCKCTRL_FREQSEL_DIV32         = 16,    /*!< DIV32 : base clock divided by 32                                          */
  SDIO_CLOCKCTRL_FREQSEL_DIV16         = 8,     /*!< DIV16 : base clock divided by 16                                          */
  SDIO_CLOCKCTRL_FREQSEL_DIV8          = 4,     /*!< DIV8 : base clock divided by 8                                            */
  SDIO_CLOCKCTRL_FREQSEL_DIV4          = 2,     /*!< DIV4 : base clock divided by 4                                            */
  SDIO_CLOCKCTRL_FREQSEL_DIV2          = 1,     /*!< DIV2 : base clock divided by 2                                            */
  SDIO_CLOCKCTRL_FREQSEL_BASECLK       = 0,     /*!< BASECLK : Base clock (10MHz - 63MHz)                                      */
} SDIO_CLOCKCTRL_FREQSEL_Enum;

/* ============================================  SDIO CLOCKCTRL CLKGENSEL [5..5]  ============================================ */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_CLKGENSEL                                                  */
  SDIO_CLOCKCTRL_CLKGENSEL_PROGCLK     = 1,     /*!< PROGCLK : Programmable Clock Mode                                         */
  SDIO_CLOCKCTRL_CLKGENSEL_DIVCLK      = 0,     /*!< DIVCLK : Divided Clock Mode                                               */
} SDIO_CLOCKCTRL_CLKGENSEL_Enum;

/* =============================================  SDIO CLOCKCTRL SDCLKEN [2..2]  ============================================= */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_SDCLKEN                                                    */
  SDIO_CLOCKCTRL_SDCLKEN_ENABLE        = 1,     /*!< ENABLE : Enable                                                           */
  SDIO_CLOCKCTRL_SDCLKEN_DISABLE       = 0,     /*!< DISABLE : Disable                                                         */
} SDIO_CLOCKCTRL_SDCLKEN_Enum;

/* ============================================  SDIO CLOCKCTRL CLKSTABLE [1..1]  ============================================ */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_CLKSTABLE                                                  */
  SDIO_CLOCKCTRL_CLKSTABLE_READY       = 1,     /*!< READY : Ready                                                             */
  SDIO_CLOCKCTRL_CLKSTABLE_NOTREADY    = 0,     /*!< NOTREADY : Not Ready                                                      */
} SDIO_CLOCKCTRL_CLKSTABLE_Enum;

/* ==============================================  SDIO CLOCKCTRL CLKEN [0..0]  ============================================== */
typedef enum {                                  /*!< SDIO_CLOCKCTRL_CLKEN                                                      */
  SDIO_CLOCKCTRL_CLKEN_OSC             = 1,     /*!< OSC : Oscillate                                                           */
  SDIO_CLOCKCTRL_CLKEN_STOP            = 0,     /*!< STOP : Stop                                                               */
} SDIO_CLOCKCTRL_CLKEN_Enum;

/* ========================================================  INTSTAT  ======================================================== */
/* ===========================================  SDIO INTSTAT VNDERRSTAT [29..31]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSTAT_VNDERRSTAT                                                   */
  SDIO_INTSTAT_VNDERRSTAT_READY        = 1,     /*!< READY : Ready                                                             */
  SDIO_INTSTAT_VNDERRSTAT_NOTREADY     = 0,     /*!< NOTREADY : Not Ready                                                      */
} SDIO_INTSTAT_VNDERRSTAT_Enum;

/* ===========================================  SDIO INTSTAT TGTRESPERR [28..28]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSTAT_TGTRESPERR                                                   */
  SDIO_INTSTAT_TGTRESPERR_NOERROR      = 0,     /*!< NOERROR : no error                                                        */
  SDIO_INTSTAT_TGTRESPERR_ERROR        = 1,     /*!< ERROR : error                                                             */
} SDIO_INTSTAT_TGTRESPERR_Enum;

/* ============================================  SDIO INTSTAT ADMAERROR [25..25]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSTAT_ADMAERROR                                                    */
  SDIO_INTSTAT_ADMAERROR_ERROR         = 1,     /*!< ERROR : Error                                                             */
  SDIO_INTSTAT_ADMAERROR_NOERROR       = 0,     /*!< NOERROR : No error                                                        */
} SDIO_INTSTAT_ADMAERROR_Enum;

/* ==========================================  SDIO INTSTAT AUTOCMDERROR [24..24]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_AUTOCMDERROR                                                 */
  SDIO_INTSTAT_AUTOCMDERROR_NOERROR    = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_AUTOCMDERROR_ERROR      = 1,     /*!< ERROR : Error                                                             */
} SDIO_INTSTAT_AUTOCMDERROR_Enum;

/* ========================================  SDIO INTSTAT CURRENTLIMITERROR [23..23]  ======================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_CURRENTLIMITERROR                                            */
  SDIO_INTSTAT_CURRENTLIMITERROR_NOERROR = 0,   /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_CURRENTLIMITERROR_ERROR = 1,     /*!< ERROR : Power Fail                                                        */
} SDIO_INTSTAT_CURRENTLIMITERROR_Enum;

/* =========================================  SDIO INTSTAT DATAENDBITERROR [22..22]  ========================================= */
typedef enum {                                  /*!< SDIO_INTSTAT_DATAENDBITERROR                                              */
  SDIO_INTSTAT_DATAENDBITERROR_NOERROR = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_DATAENDBITERROR_ERROR   = 1,     /*!< ERROR : Error                                                             */
} SDIO_INTSTAT_DATAENDBITERROR_Enum;

/* ==========================================  SDIO INTSTAT DATACRCERROR [21..21]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_DATACRCERROR                                                 */
  SDIO_INTSTAT_DATACRCERROR_NOERROR    = 0,     /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_DATACRCERROR_ERROR      = 1,     /*!< ERROR : Error                                                             */
} SDIO_INTSTAT_DATACRCERROR_Enum;

/* ========================================  SDIO INTSTAT DATATIMEOUTERROR [20..20]  ========================================= */
typedef enum {                                  /*!< SDIO_INTSTAT_DATATIMEOUTERROR                                             */
  SDIO_INTSTAT_DATATIMEOUTERROR_NOERROR = 0,    /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_DATATIMEOUTERROR_ERROR  = 1,     /*!< ERROR : Timeout                                                           */
} SDIO_INTSTAT_DATATIMEOUTERROR_Enum;

/* ========================================  SDIO INTSTAT COMMANDINDEXERROR [19..19]  ======================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_COMMANDINDEXERROR                                            */
  SDIO_INTSTAT_COMMANDINDEXERROR_NOERROR = 0,   /*!< NOERROR : No Error                                                        */
  SDIO_INTSTAT_COMMANDINDEXERROR_ERROR = 1,     /*!< ERROR : Error                                                             */
} SDIO_INTSTAT_COMMANDINDEXERROR_Enum;

