AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* ===========================================  SDIO CAPABILITIES1 SDR104 [1..1]  ============================================ */
typedef enum {                                  /*!< SDIO_CAPABILITIES1_SDR104                                                 */
  SDIO_CAPABILITIES1_SDR104_SUPPORTED  = 1,     /*!< SUPPORTED : SDR104 is Not Supported                                       */
  SDIO_CAPABILITIES1_SDR104_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : SDR104 is Not Supported                                    */
} SDIO_CAPABILITIES1_SDR104_Enum;

/* ============================================  SDIO CAPABILITIES1 SDR50 [0..0]  ============================================ */
typedef enum {                                  /*!< SDIO_CAPABILITIES1_SDR50                                                  */
  SDIO_CAPABILITIES1_SDR50_SUPPORTED   = 1,     /*!< SUPPORTED : SDR50 is Not Supported                                        */
  SDIO_CAPABILITIES1_SDR50_NOTSUPPORTED = 0,    /*!< NOTSUPPORTED : SDR50 is Not Supported                                     */
} SDIO_CAPABILITIES1_SDR50_Enum;

/* =======================================================  MAXIMUM0  ======================================================== */
/* =======================================================  MAXIMUM1  ======================================================== */
/* ===========================================  SDIO MAXIMUM1 MAXCURR18V [16..23]  =========================================== */
typedef enum {                                  /*!< SDIO_MAXIMUM1_MAXCURR18V                                                  */
  SDIO_MAXIMUM1_MAXCURR18V_1020mA      = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO_MAXIMUM1_MAXCURR18V_4mA         = 1,     /*!< 4mA : 1020mA, 255 * 4mA                                                   */
} SDIO_MAXIMUM1_MAXCURR18V_Enum;

/* ===========================================  SDIO MAXIMUM1 MAXCURR30V [8..15]  ============================================ */
typedef enum {                                  /*!< SDIO_MAXIMUM1_MAXCURR30V                                                  */
  SDIO_MAXIMUM1_MAXCURR30V_1020mA      = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO_MAXIMUM1_MAXCURR30V_4mA         = 1,     /*!< 4mA : 1020mA, 255 * 4mA                                                   */
} SDIO_MAXIMUM1_MAXCURR30V_Enum;

/* ============================================  SDIO MAXIMUM1 MAXCURR33V [0..7]  ============================================ */
typedef enum {                                  /*!< SDIO_MAXIMUM1_MAXCURR33V                                                  */
  SDIO_MAXIMUM1_MAXCURR33V_1020mA      = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO_MAXIMUM1_MAXCURR33V_4mA         = 1,     /*!< 4mA : 1020mA, 255 * 4mA                                                   */
} SDIO_MAXIMUM1_MAXCURR33V_Enum;

/* =========================================================  FORCE  ========================================================= */
/* ===========================================  SDIO FORCE FORCEADMAERR [25..25]  ============================================ */
typedef enum {                                  /*!< SDIO_FORCE_FORCEADMAERR                                                   */
  SDIO_FORCE_FORCEADMAERR_INT          = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEADMAERR_NOINT        = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEADMAERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDERR [24..24]  ============================================ */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDERR                                                   */
  SDIO_FORCE_FORCEACMDERR_INT          = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDERR_NOINT        = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEACMDERR_Enum;

/* =========================================  SDIO FORCE FORCECURRLIMITERR [23..23]  ========================================= */
typedef enum {                                  /*!< SDIO_FORCE_FORCECURRLIMITERR                                              */
  SDIO_FORCE_FORCECURRLIMITERR_INT     = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECURRLIMITERR_NOINT   = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECURRLIMITERR_Enum;

/* ==========================================  SDIO FORCE FORCEDATAENDERR [22..22]  ========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEDATAENDERR                                                */
  SDIO_FORCE_FORCEDATAENDERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEDATAENDERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEDATAENDERR_Enum;

/* ==========================================  SDIO FORCE FORCEDATACRCERR [21..21]  ========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEDATACRCERR                                                */
  SDIO_FORCE_FORCEDATACRCERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEDATACRCERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEDATACRCERR_Enum;

/* ==========================================  SDIO FORCE FORCEDATATOERR [20..20]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEDATATOERR                                                 */
  SDIO_FORCE_FORCEDATATOERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEDATATOERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEDATATOERR_Enum;

/* ==========================================  SDIO FORCE FORCECMDIDXERR [19..19]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDIDXERR                                                 */
  SDIO_FORCE_FORCECMDIDXERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDIDXERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDIDXERR_Enum;

/* ==========================================  SDIO FORCE FORCECMDENDERR [18..18]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDENDERR                                                 */
  SDIO_FORCE_FORCECMDENDERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDENDERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDENDERR_Enum;

/* ==========================================  SDIO FORCE FORCECMDCRCERR [17..17]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDCRCERR                                                 */
  SDIO_FORCE_FORCECMDCRCERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDCRCERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDCRCERR_Enum;

/* ===========================================  SDIO FORCE FORCECMDTOERR [16..16]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDTOERR                                                  */
  SDIO_FORCE_FORCECMDTOERR_INT         = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDTOERR_NOINT       = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDTOERR_Enum;

/* =========================================  SDIO FORCE FORCEACMDISSUEDERR [7..7]  ========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDISSUEDERR                                             */
  SDIO_FORCE_FORCEACMDISSUEDERR_INT    = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDISSUEDERR_NOINT  = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDISSUEDERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDIDXERR [4..4]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDIDXERR                                                */
  SDIO_FORCE_FORCEACMDIDXERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDIDXERR_NOINT     = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDIDXERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDENDERR [3..3]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDENDERR                                                */
  SDIO_FORCE_FORCEACMDENDERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDENDERR_NOINT     = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDENDERR_Enum;

