AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo4p_generic.h
/* ===============================================  VCOMP STAT CMPOUT [0..0]  ================================================ */
typedef enum {                                  /*!< VCOMP_STAT_CMPOUT                                                         */
  VCOMP_STAT_CMPOUT_VOUT_LOW           = 0,     /*!< VOUT_LOW : The negative input of the comparator is greater than
                                                     the positive input.                                                       */
  VCOMP_STAT_CMPOUT_VOUT_HIGH          = 1,     /*!< VOUT_HIGH : The positive input of the comparator is greater
                                                     than the negative input.                                                  */
} VCOMP_STAT_CMPOUT_Enum;

/* ========================================================  PWDKEY  ========================================================= */
/* ==============================================  VCOMP PWDKEY PWDKEY [0..31]  ============================================== */
typedef enum {                                  /*!< VCOMP_PWDKEY_PWDKEY                                                       */
  VCOMP_PWDKEY_PWDKEY_Key              = 55,    /*!< Key : Key value to unlock the register.                                   */
} VCOMP_PWDKEY_PWDKEY_Enum;

/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* ================================================  WDT CFG CLKSEL [24..26]  ================================================ */
typedef enum {                                  /*!< WDT_CFG_CLKSEL                                                            */
  WDT_CFG_CLKSEL_OFF                   = 0,     /*!< OFF : Low Power Mode. This setting disables the watch dog timer.          */
  WDT_CFG_CLKSEL_128HZ                 = 1,     /*!< 128HZ : 128 Hz LFRC clock.                                                */
  WDT_CFG_CLKSEL_16HZ                  = 2,     /*!< 16HZ : 16 Hz LFRC clock.                                                  */
  WDT_CFG_CLKSEL_1HZ                   = 3,     /*!< 1HZ : 1 Hz LFRC clock.                                                    */
  WDT_CFG_CLKSEL_1_16HZ                = 4,     /*!< 1_16HZ : 1/16th Hz LFRC clock.                                            */
} WDT_CFG_CLKSEL_Enum;

/* =========================================================  RSTRT  ========================================================= */
/* ================================================  WDT RSTRT RSTRT [0..7]  ================================================= */
typedef enum {                                  /*!< WDT_RSTRT_RSTRT                                                           */
  WDT_RSTRT_RSTRT_KEYVALUE             = 178,   /*!< KEYVALUE : This is the key value to write to WDTRSTRT to restart
                                                     the WDT. This is a write only register.                                   */
  WDT_RSTRT_RSTRT_DEFAULT              = 0,     /*!< DEFAULT : Default/Reset value. This is a write only register.             */
} WDT_RSTRT_RSTRT_Enum;

/* =========================================================  LOCK  ========================================================== */
/* =================================================  WDT LOCK LOCK [0..7]  ================================================== */
typedef enum {                                  /*!< WDT_LOCK_LOCK                                                             */
  WDT_LOCK_LOCK_KEYVALUE               = 58,    /*!< KEYVALUE : This is the key value to write to WDTLOCK to lock
                                                     the WDT.                                                                  */
  WDT_LOCK_LOCK_DEFAULT                = 0,     /*!< DEFAULT : Default/Reset value.                                            */
} WDT_LOCK_LOCK_Enum;

/* =========================================================  COUNT  ========================================================= */
/* ========================================================  DSP0CFG  ======================================================== */
/* =======================================================  DSP0RSTRT  ======================================================= */
/* ============================================  WDT DSP0RSTRT DSP0RSTART [0..7]  ============================================ */
typedef enum {                                  /*!< WDT_DSP0RSTRT_DSP0RSTART                                                  */
  WDT_DSP0RSTRT_DSP0RSTART_KEYVALUE    = 105,   /*!< KEYVALUE : This is the key value to write to WDTRSTRT to restart
                                                     the WDT. This is a write only register.                                   */
  WDT_DSP0RSTRT_DSP0RSTART_DEFAULT     = 0,     /*!< DEFAULT : Reset value                                                     */
} WDT_DSP0RSTRT_DSP0RSTART_Enum;

/* =======================================================  DSP0TLOCK  ======================================================= */
/* =============================================  WDT DSP0TLOCK DSP0LOCK [0..7]  ============================================= */
typedef enum {                                  /*!< WDT_DSP0TLOCK_DSP0LOCK                                                    */
  WDT_DSP0TLOCK_DSP0LOCK_KEYVALUE      = 167,   /*!< KEYVALUE : This is the key value to write to WDTLOCK to lock
                                                     the WDT.                                                                  */
  WDT_DSP0TLOCK_DSP0LOCK_DEFAULT       = 0,     /*!< DEFAULT : Reset Value.                                                    */
} WDT_DSP0TLOCK_DSP0LOCK_Enum;

/* =======================================================  DSP0COUNT  ======================================================= */
/* ========================================================  DSP1CFG  ======================================================== */
/* =======================================================  DSP1RSTRT  ======================================================= */
/* ============================================  WDT DSP1RSTRT DSP1RSTART [0..7]  ============================================ */
typedef enum {                                  /*!< WDT_DSP1RSTRT_DSP1RSTART                                                  */
  WDT_DSP1RSTRT_DSP1RSTART_KEYVALUE    = 210,   /*!< KEYVALUE : This is the key value to write to WDTRSTRT to restart
                                                     the WDT. This is a write only register.                                   */
  WDT_DSP1RSTRT_DSP1RSTART_DEFAULT     = 0,     /*!< DEFAULT : Reset value                                                     */
} WDT_DSP1RSTRT_DSP1RSTART_Enum;

/* =======================================================  DSP1TLOCK  ======================================================= */
/* =============================================  WDT DSP1TLOCK DSP1LOCK [0..7]  ============================================= */
typedef enum {                                  /*!< WDT_DSP1TLOCK_DSP1LOCK                                                    */
  WDT_DSP1TLOCK_DSP1LOCK_KEYVALUE      = 78,    /*!< KEYVALUE : This is the key value to write to WDTLOCK to lock
                                                     the WDT.                                                                  */
  WDT_DSP1TLOCK_DSP1LOCK_DEFAULT       = 0,     /*!< DEFAULT : Reset Value.                                                    */
} WDT_DSP1TLOCK_DSP1LOCK_Enum;

/* =======================================================  DSP1COUNT  ======================================================= */
/* =======================================================  WDTIEREN  ======================================================== */
/* ======================================================  WDTIERSTAT  ======================================================= */
/* =======================================================  WDTIERCLR  ======================================================= */
/* =======================================================  WDTIERSET  ======================================================= */
/* =======================================================  DSP0IEREN  ======================================================= */
/* ======================================================  DSP0IERSTAT  ====================================================== */
/* ======================================================  DSP0IERCLR  ======================================================= */
/* ======================================================  DSP0IERSET  ======================================================= */
/* =======================================================  DSP1IEREN  ======================================================= */
/* ======================================================  DSP1IERSTAT  ====================================================== */
/* ======================================================  DSP1IERCLR  ======================================================= */
/* ======================================================  DSP1IERSET  ======================================================= */

/** @} */ /* End of group EnumValue_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* APOLLO4P_H */


/** @} */ /* End of group apollo4p */

/** @} */ /* End of group Ambiq Micro */
